[
    {"id": 1, "day": "Thursday", "time": "5:00 pm - 6:00 pm", "location": "Aft Lounge", "name": "Opening Reception", "speaker": "", "info": "Join us for the ‘Welcome Aboard CoderCruise 2018’ reception and opening remarks from your hosts Eli and Heather White of One for All Events and our presenting sponsor RingCentral. Adult and non-alcoholic drinks will be provided."},
    {"id": 2, "day": "Friday", "time": "9:00 am - 9:45 am", "location": "Alberts", "name": "Denied! Securing your Application with Better User Authorization", "speaker": "Brian Childress", "info": "As our applications grow in complexity, application security needs to change to keep pace. Using real-world examples we will explore new implementations for front-end user authorization and authentication best practices. We’ll go beyond the basics of determining if a user is logged in, and discuss using JSON Web Tokens (JWT) for authentication. By examining security vulnerabilities lurking in most web applications we will demonstrate strategies to implement new security patterns using today’s hottest JavaScript frameworks (Angular, React, Vue). You’ll find unique ways to differentiate users by roles or security groups, changing the user experience. We’ll discuss ways to control a user’s access down to a single data point by moving our authorization model to the component level. Key areas we’ll cover: JSON Web Token (JWT) best practices, Route and Component level authorization, Role based user access, Vulnerabilities in modern web apps"},
    {"id": 3, "day": "Friday", "time": "9:00 am - 9:45 am", "location": "Blues", "name": "Career Paths Beyond Senior Developer", "speaker": "David Oleksa", "info": "“What will be your job title in the year before your retirement?” This is a question most software developers struggle with, in large part because there haven’t been generations of engineers before us that have matured through the IT workforce and on to retirement. What career paths will we follow to remain technical while still being challenged? What career paths will lead us to management and leadership? In this talk, David Oleksa will show some traditional career paths in IT, as well as visions on how the software development workplace will mature over the next several decades. Additionally, David will talk about what skills and experience will be required for the careers beyond Senior Developer."},
    {"id": 4, "day": "Friday", "time": "10:00 am - 10:45 am", "location": "Alberts", "name": "Virtual Reality and Augmented Reality Web Apps", "speaker": "Andrew Cassell", "info": "Virtual reality and augmented reality will revolutionize the Web. In this talk, we will build and demo both an augmented reality web application built using three.js and a webcam, and a virtual reality web application using PHP, React.js, A-Frame, and an Oculus Rift."},
    {"id": 5, "day": "Friday", "time": "10:00 am - 10:45 am", "location": "Blues", "name": "From Zero to Serverless", "speaker": "Chad Green", "info": "So many times our customers need a simple routine that can be executed on a routine basis but the solution doesn’t need to be an elaborate solution without going the trouble of setting servers and other infrastructure. Serverless computer is the abstraction of servers, infrastructure, and operating systems and make getting solutions to your customer’s needs much quicker and cheaper. During this session we will look at how Azure Functions will enable you to run code on-demand without having to explicitly provision or manage infrastructure."},
    {"id": 6, "day": "Friday", "time": "11:00 am - 11:45 am", "location": "Alberts", "name": "The Developer Lifestyle (Or How to Survive as a Programmer)", "speaker": "Sven Anders Robbestad", "info": "Sven Anders Robbestad has been a programmer for over two decades and would like to share his battle scars and advice on how you can thrive as a programmer and keep your family and your loved ones happy."},
    {"id": 7, "day": "Friday", "time": "11:00 am - 11:45 am", "location": "Blues", "name": "Maintaining Homestead", "speaker": "Joe Ferguson", "info": "Laravel’s Homestead project is the second most downloaded public vagrant environment. Initially designed to be a full featured local development environment focused on making Laravel developer’s experience easier Homestead has grown into a solid well-rounded LAMP stack Vagrant environment for nearly any PHP project. Join us as we review the features and inner workings of Homestead, explore some features you may not be aware of, and even take a trip deep into the operations process of how we build and deliver the best vagrant environment for the PHP community. We’ll also cover extending Homestead and making it work for your custom applications and how you can easily share the customized environment with your teammates, coworkers, or contributors."},
    {"id": 8, "day": "Friday", "time": "1:30 pm - 2:15 pm", "location": "Alberts", "name": "Shedquarters—Upping the Work at Home Game", "speaker": "Kevin Griffin", "info": "The trend of remote working has been increasing over the past several years. It’s a fantastic way to equalize your work-life balance and cut out time-wasting activities, such as commuting to an office. However, working from home can have numerous issues you need to identify and resolve in order to be successful. As a dad with three growing boys, Kevin Griffin has found working from home to be a continuous challenge. With his oldest going into 1st grade, Kevin and his wife decided to take the route of homeschooling. To best set their kids up for success, Kevin moved out of his office over the garage so it could be converted into a homeschooling/playroom. But where is an office-less dad supposed to go? Enter the Shedquarters. With a budget of under $10,000, Kevin successfully created a brand new office for himself in the backyard. This talk is a postmortem of his experience with the project and will provide guidance to other work-from-home developers who need something more than a “room in the house.”"},
    {"id": 9, "day": "Friday", "time": "1:30 pm - 2:15 pm", "location": "Blues", "name": "Design Patterns and Meta-Programming for Fun and Profit", "speaker": "David Litvak Bruno", "info": "Design patterns are often now seen as archaic solutions that were relevant in the old days of programming mostly in Java and C++, when Java didn’t support lambda expressions and dynamic features were nowhere to be seen. In this talk, we’ll show how this patterns, in combination with meta-programming techniques can be super interesting to use in helping to solve problems in the modern programming ecosystem. We’ll use examples in Ruby, Python and JavaScript to exemplify some modern applications of these patterns. Be ware though, user discretion is advised, some of the implementations I will provide, are implemented in a VERY, VERY unorthodox, but extremely fun way! Because… after all, we’re programmers because we love what we do! And having fun while doing it is awesome!"},
    {"id": 10, "day": "Friday", "time": "2:30 pm - 3:15 pm", "location": "Alberts", "name": "SOLID Principles in Action: From Slack to Twilio", "speaker": "Micah Silverman", "info": "SOLID principles make software more flexible and maintainable. In this talk, Micah Silverman touches on each of the principles: Single responsibility principle, Open/closed principle, Liskov substitution principle, Interface segregation principle, Dependency inversion principle. However, rather than talk about them in the abstract, the talk focuses on a specific code example. The example starts out as a Slack integration which shows a random “Magic: the Gathering” card in a channel when a certain command is issued. Micah refactors the code to integrate with Twilio and demonstrate each principle along the way. The example is written as a Spring Boot application, and all source is available on GitHub."},
    {"id": 11, "day": "Friday", "time": "2:30 pm - 3:15 pm", "location": "Blues", "name": "0 to 2000 – How I Got 2000 Reputation on Stack Overflow in 6 Weeks", "speaker": "John Wang", "info": "Stack Overflow is a great site for learning and sharing developer knowledge, but it takes reputation to make the site easy to use. Specifically, 1500 points allows you to create tags and 2000 enables you to edit posts and use the site like a wiki. In this session we’ll cover site policies, culture and how to contribute effectively to build reputation and become a respected community member quickly."},
    {"id": 12, "day": "Friday", "time": "3:30 pm - 4:15 pm", "location": "Alberts", "name": "Improving Customer Interactions with AI", "speaker": "Paco Vu", "info": "Artificial Intelligence (AI) is changing the way we do business, giving us greater insights and allowing for more meaningful interactions than ever before. It’s so powerful that you can even take call log or call recording data (voicemails, phone calls, etc), transcribe them into text, and gain a deep understanding of your customers from overall sentiment, to lead scoring, to building intelligent customer profiles while measuring overall satisfaction, and even next action prediction (what they will buy next or need next). And in this session we’ll show you how to do just that!"},
    {"id": 13, "day": "Friday", "time": "3:30 pm - 4:15 pm", "location": "Blues", "name": "Design: The Science of Making Stuff Pretty", "speaker": "Adam Privette", "info": "Even if you’re not a creative, mastering the principles of what makes for a great user experience is important to most of our jobs. Because of this, I like to look at web and application design as more of a science than an art. In this talk, I’ll draw parallels between development practices and design to demonstrate the impact of UX. You’ll learn how to implement designs better, have two way conversations with your designers, and gain a better understanding about the design processes that go into your deliverables."},
    {"id": 14, "day": "Friday", "time": "4:30 pm - 5:15 pm", "location": "Alberts", "name": "Taking Code on the Road", "speaker": "Cindy Cullen", "info": "Cindy Cullen has learned a lot of things about coding, freelancing, languages, web development, WordPress, PHP, MySQL, JavaScript, servers, Laravel, and much more from her life on the road. Freedom is important to her. Programming has allowed Cindy and her wife to live the life of their dreams with some of the most wonderful clients in the world. Cindy will talk about the ups and downs of life on the road, finding clients, mixing fun, travel and code, how they get paid, and much more. Code and travel are a great fit! What better place to talk about freedom than on a CoderCruise?"},
    {"id": 15, "day": "Friday", "time": "4:30 pm - 5:15 pm", "location": "Blues", "name": "Design for Developers", "speaker": "Cathy Bruce", "info": "While there is some truth to “some amount of innate talent is required to be a true artist”, it’s not necessarily so in learning how to design. And as developers, we’ve all found ourselves struggling when called on to be both the designer and developer of a website. There are processes and techniques you can use to create a well-designed site. From “hierarchy of content” to “font usage” to “proximity of elements”, I will teach you how to develop an eye for design that will carry you through any task, and may even alter how you see the world as you learn related patterns are everywhere."},
    {"id": 16, "day": "Saturday", "time": "2:30 pm - 3:15 pm", "location": "Alberts", "name": "APIs, Chains & Graphs", "speaker": "Mike Stowe", "info": "Let’s face it, REST APIs can be problematic, and hypermedia hasn’t quite proven to be the answer we’ve looked for. GraphQL has quickly become more popular offering a solution to the problems REST created – but opens back up the very problems REST was created to avoid (remember SOAP?). But what if there was a way to take the best of both: enter API chains. In this session we’ll take a look at the pros and cons of REST, GraphQL, and a new specification and library for chaining numerous resource calls into a single HTTP request."},
    {"id": 17, "day": "Saturday", "time": "2:30 pm - 3:15 pm", "location": "Blues", "name": "Intro to Web Components", "speaker": "Chris Lorenzo", "info": "Native browser support for Web Components is underway, providing web developers with powerful new APIs. Web Components allow developers to create reusable components without a framework. During this talk we’ll learn about the Custom Elements, Template, and Shadow Dom specifications with code examples and different tools to help you utilize these new APIs. We’ll also cover an example custom element that Comcast is using across all of its sites for millions of users."},
    {"id": 18, "day": "Saturday", "time": "3:30 pm - 4:15 pm", "location": "Alberts", "name": "I Don’t Care About Security (And Neither Should You)", "speaker": "Joel Lord", "info": "Remember when setting up a login page was easy? It seems like nowadays, it takes many weeks to start a project just to create a signup form, a login form, and a forgotten password screen. And that’s if you don’t need two-factor authentication or passwordless authentication. During this presentation, the attendees will be introduced to OpenID and OAuth. They will also learn how to leverage this to create a secure application or, most importantly, how to delegate to a third party so they can focus on their real work."},
    {"id": 19, "day": "Saturday", "time": "3:30 pm - 4:15 pm", "location": "Blues", "name": "The Open Source Talk That Changed My Life Wasn’t Technical!", "speaker": "Joe Ferguson", "info": "The first PHP conference I ever went to changed my life. I saw Ed Finkler talking about his struggles with mental health issues. I related so well with everything he said and was shocked to find out not everyone feels this way. Come learn about Open Sourcing Mental Illness, a nonprofit built on a movement of changing how we talk about mental health in the tech community. We’ll talk about survey results from multiple years of OSMI’s Mental Health In Tech surveys showing how employees feel about discussing mental health issues with employers and coworkers. We’ll talk about resources, where and how to find help. The most important thing is to know you’re not alone."},
    {"id": 20, "day": "Saturday", "time": "4:30 pm - 5:15 pm", "location": "Alberts", "name": "Enhance Your Career with a Mastermind Group", "speaker": "Kevin Griffin", "info": "What do King Arthur, Franklin D. Roosevelt, Andrew Carnegie, and Napoleon all have in common? Each of them belonged to groups called Masterminds, or brain trusts. The term was originally coined back in 1937, but the concept has survived the test of time. By surrounding yourself with like-minded individuals, each coming into the conversation with their own thoughts, perspective, and motivations, the overall group can lift themselves to a higher level. You don’t need to wear a crown or command an army to be in a mastermind group. Average people every day meet and discuss their careers and personal lives within constructive, judgment-free zones. Do you find yourself going to work each day without direction? Do you feel like you are the only person in the world with the problems you’re facing? A mastermind group would help you push forward. This presentation will discuss how to join or organize a mastermind group, including meeting structure and timing. What are the do’s and don’ts? How can every member benefit? Come to learn and take your career to the next level."},
    {"id": 21, "day": "Saturday", "time": "4:30 pm - 5:15 pm", "location": "Blues", "name": "Distributed Apps for Web Developers: Web 3.0", "speaker": "Reid Workman", "info": "Full Stack Web Developers know how every aspect of their web apps work in concert with each other, but a Full Stack Blockchain Developer has a set of knowledge specifically for building apps that run. Enabled by smart contracts, distributed applications (dapps) read and write to the blockchain, but put the user in control of their own data. Learn how blockchains work under the covers, how to develop dapps, and how developers are using them to build entire services on Ethereum."},
    {"id": 22, "day": "Sunday", "time": "2:00 pm - 2:45 pm", "location": "Alberts", "name": "Three Steps on the Path to Automated Testing", "speaker": "James Quick", "info": "Bugs happen, it’s as simple as that. No developer can guarantee they can write perfect code. With that in mind, maybe you’ve heard success stories of automated testing, and maybe you’ve even started doing research, but you just haven’t been able to get the ball rolling. You’re probably asking yourself, “What does it really take?” In this session, we will start with driving home the importance of automated testing and how it can increase efficiency, decrease technical debt, and improve customer experience. From getting buy-in to actual implementation, we will focus on three key steps to get started with automated testing. Along the way, you will hear first-hand experience of going through this process starting from scratch. If you recognize the benefits of automated testing and are looking for help getting started, this session is for you."},
    {"id": 23, "day": "Sunday", "time": "2:00 pm - 2:45 pm", "location": "Blues", "name": "Are You Solving the Right Problem? How Business Analysis Can Help Teams Build the Right Thing at the Right Time", "speaker": "Stephanie Fulbright", "info": "Ever implemented or purchased something that didn’t actually solve your problem and hindsight felt 20/20? There’s a way to bring that hindsight forward and have clarity when you start. Business analysis helps individuals and teams figure out the right problem to solve and the best way to solve it. This talk will explore how to determine the path to success and differentiate it from the path to a solution. We will go through the foundations of business analysis and how this methodology can help make sure projects are successful. We will review common temptations and how to avoid them, as well as how to leverage a business analyst if you have one on your team. The talk will use real-life examples from healthcare IT as well as everyday experiences like planning a wedding and buying a couch. Attendees will have an opportunity to practice this methodology on a problem of their own."},
    {"id": 24, "day": "Sunday", "time": "3:00 pm - 3:45 pm", "location": "Alberts", "name": "Performance Optimizations for Enterprise Web Apps", "speaker": "Chris Lorenzo", "info": "Struggling to get your website to load in less than five seconds on a mobile phone? You’re not alone! At Comcast, we’ve built many responsive sites and work hard at optimizing for performance. Using the latest PRPL pattern and Progressive Web API’s, we provide a compelling alternative to native apps. This talk will cover why the performance of your site is so important and dive into the Chrome performance tools to explain exactly how a browser loads a site and what causes things to slow down. Lastly, we’ll cover how to create your own PWA with service workers and app installs."},
    {"id": 25, "day": "Sunday", "time": "3:00 pm - 3:45 pm", "location": "Blues", "name": "Call…Text…Video Me Maybe?", "speaker": "Mike Stowe", "info": "Have you ever wondered how you could add voice, telephone, SMS, MMS, messaging, video, meeting, or fax (yes – I said fax) capabilities to your web app? Learn how easy it is to build in all of these with HTTP based APIs and take your application beyond the browser. For this session we’ll focus on using the RingCentral APIs (although you can easily use any other vendor as the process is nearly the same)."},
    {"id": 26, "day": "Sunday", "time": "4:00 pm - 4:45 pm", "location": "Alberts", "name": "Procrastination as a Service: Caching and Queueing", "speaker": "Lawrence Shea", "info": "In this talk, Lawrence Shea will convince you that your parents were wrong and procrastination is actually a best practice. He’ll discuss: what caching is, what queuing is, why you (probably) don’t need live data, why you should push everything off until later, and how we can get our lazy on with Redis."},
    {"id": 27, "day": "Sunday", "time": "4:00 pm - 4:45 pm", "location": "Blues", "name": "Don’t Eat Grandma: Common Grammatical Issues in Technical Writing", "speaker": "Kara Ferguson", "info": "As a copy editor working in tech, Kara Ferguson sees many of the same flaws in writing over and over again. Being a developer isn’t only about writing code. Devs must be able to communicate via verbal and written means properly. Sometimes, it’s something as simple as writing an email or message in Slack to a coworker, or contributing to the much-dreaded documentation. For some, it’s sharing your knowledge via authoring blog posts, articles, or books. Even conference speakers spend hours writing text for their slides. In this talk, she’ll point out some of the most common and most frustrating grammatical issues such as double spacing after punctuation, how and when to use a comma, and how grammar can help you assert your expertise on the topic of your choice!"},
    {"id": 28, "day": "Sunday", "time": "5:00 pm - 5:30 pm", "location": "Alberts", "name": "Building Better Software", "speaker": "John Holmes", "info": "We are in a magical industry where we literally create value by arranging ones and zeros… But what is it that really creates value in our industry? Is it the passion of the developers? Is it the process that you use? Is it the programming language? Is it the number of mountain dews that you drank while coding? Is it the way that you tested? Is it the user’s reaction? Is it the size of the team? Is it the location in the world? Is it the gender, age, ethnicity, … of the programmers? Hopefully, it’s obvious that some of these are just silly. In this talk, we’ll dive into what makes software great and how we create value in the industry."}
]
