[{"id":142126,"day":"Tuesday","time":"9:30 - 10:15","location":"Mainstage","name":"How we will build the software of tomorrow","speaker":"Thomas Dohmke","info":"<p>The software we build and the ways in which we build it have changed dramatically over the last 10 years. Open source has been key to accelerating software innovation. We&rsquo;re now in an era of AI and cloud-based software development, and we&rsquo;re getting early glimpses of how that can enable the software of tomorrow. Thomas Dohmke, CEO of GitHub, joins us to talk about the challenges we currently face as an industry and gives his vision of opportunities ahead in software development and how it will redefine the way companies build for decades.</p>"},{"id":142127,"day":"Tuesday","time":"10:20 - 10:50","location":"Mainstage","name":"Staying Safe in the AI Future","speaker":"Cassie Kozyrkov","info":"<p>Machine learning and artificial intelligence are no longer science fiction, but what does it take to harness their potential effectively, responsibly, and reliably? How should leaders think about their roles and responsibilities in a future where complex algorithms and black box models are the norm? What do developers need to know to keep their skills relevant? And how can regular citizens ensure that they're informed and empowered to participate in decisions based on their data. This talk gives you actionable advice based on lessons learned at Google that will help you adopt an AI safety mindset to be a responsible leader and citizen in an increasingly data-fueled future.</p>"},{"id":142352,"day":"Tuesday","time":"10:30 - 11:05","location":"Virtual Only Track","name":"Data Portraits: Turning Data into Design","speaker":"Marc Biemer","info":"<p>Portraiture has been around for centuries, bringing forward splendid Egyptian busts, royal paintings and the world-renowned Mona Lisa. Most of these portraits resemble the physical appearance of the subject. In times where we leave digital footprints almost everywhere we go, artists can however depict way more than just a subject&rsquo;s face: This is the beginning of the age of Data Portraits. In this talk we will take a brief tour through the history of portraiture and reveal its underlying mechanics. The journey continues by taking a look at the notion of Data Portraits and analyzing existing projects. We will dig deeper into the techniques of creating a data portrait using a case study we built at Futurice, before closing with a reflection on useful applications today, and the outlook for the future ahead!</p>"},{"id":142119,"day":"Tuesday","time":"10:30 - 12:30","location":"Workshops M8","name":"How to a11y? - All you need to know about building accessible web content","speaker":"Tanja Ulianova","info":"<p>During this workshop participants will learn about the principles of web accessibility. Starting with an introduction on the importance of providing accessible web content, we will look into the current web accessibility guidelines and their practical application by covering various aspects such as accessible design, usage of semantic HTML, keyboard accessibility, building rich accessible components, and more. This workshop is suited for web developers new to the topic and/or those who are willing to broaden their knowledge. The goal of this workshop is to provide you with an overview of the topic of accessibility and equip you with the techniques to tackle most common accessibility pitfalls in your future projects. The participants must bring their own laptop with a code editor for HTML, CSS and JavaScript installed (e.g., Visual Studio Code, Sublime Text, WebStorm) and a working Node.js installation.</p>"},{"id":142128,"day":"Tuesday","time":"10:30 - 11:15","location":"Panorama Stage","name":"Event based cache invalidation in GraphQL","speaker":"Simone Sanfratello","info":"<p>Caching is one of the most effective ways to achieve fast performance, probably the main one, but in a GraphQL context it&rsquo;s not that easy: once we get to caching GraphQL queries in order to speed up our application backend, we also need to refresh the cache. How can we do that? What are the strategies we can apply to keep our dynamic data ready to use and up to date at the same time? How can we invalidate the cache efficiently? Time based invalidation is widely used but not very precise, so let's introduce event based invalidation, with node.js, fastify and mercurius!</p>"},{"id":142129,"day":"Tuesday","time":"10:30 - 11:00","location":"Microstage 2","name":"How I learned to stop worrying and love Garbage Collection","speaker":"Neda Divbandi, Forud Ghafouri","info":"<p>I will try to cover important topics about Garbage collectors in my talk.</p>\n<ul>\n<li>2 minutes about computer memory , Ram structure , data types ,heap vs stack and memory allocation mechanism</li>\n<li>4 minutes Memory management , why do we need it, a comparison between manual and automated management</li>\n<li>6 minutes about GC, History of GC, advantages and disadvantages, purpose of GC</li>\n<li>3 minutes python GC algorithms, Reference counting and A cycle-detecting algorithm (circular references)</li>\n<li>3~ minutes Java GC algorithms, G1 and shenandoah</li>\n<li>3 minutes Golang GC algorithm, all about tricolor algorithm which is my favorite topic</li>\n<li>4 minutes comparing those algorithms advantages and disadvantages</li>\n<li>3 minute conclusion What are best practices on garbage collection? How can garbage collection be improved?</li>\n<li>Q&amp;A</li>\n</ul>"},{"id":142130,"day":"Tuesday","time":"10:30 - 11:00","location":"Stage 4","name":"The Future of Cloud is Abstraction - Why Kubernetes is not the Endgame for STACKIT","speaker":"Dominik Kress","info":"<p>With the Cloud transformation many companies are introducing self-service portals for infrastructure. The times of writing a ticket to your infrastructure department and then waiting a couple of months until your virtual machine is delivered are (hopefully) over. Especially in combination with the DevOps Mindset development teams can with just a few clicks get the infrastructure they need to host their applications. And orchestration tools just like Kubernetes make sure those apps can scale up, down and out to cover even the highest load peaks with minimal costs. But this enablement of development teams to get high performance infrastructure with just a few clicks also comes with some risks! In this talk we want to have a look why your development team might not need Kubernetes, what the idea behind Platform as a Service is and how we use Cloud Foundry to put the consumer experience first in the STACKIT Cloud.</p>"},{"id":142131,"day":"Tuesday","time":"10:30 - 11:00","location":"Microstage 1","name":"Git for Code Reviews","speaker":"Johannes Haux","info":"<p>&ldquo;Write useful feedback and keep your changes small&rdquo; - the internet is full of these code review tips. What is often missed: the technical part. But knowing how to properly utilize git is key for efficient code reviews. This is harder than it sounds. Git offers nearly 150 commands and 80.000 lines of documentation. Who has time to read all of this? Save yourself the time and join our talk to get an overview of all the interesting bits. We will not only take a look at the basics you need for efficient code reviews. We'll also explore the hidden gems that you might not be aware of, even if you have been using git for years. Prepare yourself for a hands-on talk for beginners and experts that helps you improve your code review workflow.</p>"},{"id":142132,"day":"Tuesday","time":"10:30 - 11:00","location":"Microstage 3","name":"Programming Focusing on Performance and Ecology.","speaker":"Pablo Weremczuk","info":"<p>CPU and GPU Shortage, energy crisis, and global warming. How can we contribute to the solution of these issues by creating highly performant software and using the resources on the computer in a more efficient way. In the beginning, the software industry was considered \"green\", since it contributed to eliminating the use of paper in the office. But is not as green as it used to be. Software is everywhere, and since it's everywhere, we can contribute to the challenges the world is facing by changing the way we work and the way we build products.</p>"},{"id":142133,"day":"Tuesday","time":"10:30 - 11:00","location":"Stage 3","name":"To New Frontiers: The Future of Frontend Development","speaker":"Rainer Hahnekamp","info":"<p>React, Vue &amp; Angular have positioned themselves as the \"Big 3\" frameworks for frontend development for the last couple of years. They still add new features, but not at that rate compared to the early days. So did we already reach the peak? On the contrary! Svelte's compiler approach, React's Server Components or esbuild's performance (via not using JavaScript) are groundbreaking changes that will shape the next generation. If the \"Big 3\" will adopt or vanish, is another topic... Join my talk and see how these new approaches expand the frontiers even more.</p>"},{"id":142134,"day":"Tuesday","time":"10:30 - 11:15","location":"Stage 1","name":"Get Ready for Jakarta EE 10!","speaker":"Ivar Grimstad","info":"<p>Jakarta EE 9 lowered the barriers of entry and established a foundation for future innovation paving the way for Jakarta EE 10. With Jakarta EE 10, we introduced Jakarta EE Core Profile which targets smaller runtimes suitable for microservices. The Jakarta EE Core Profile also aims to be an even better fit for compiling to native images. But it does not stop there. Both Jakarta EE Web Profile and Jakarta EE Platform is moving forward as well with updates to almost all the individual specifications. Join this session for the latest updates on the progress with Jakarta EE 10. I will go through what Jakarta EE 10 brings to the table, and what to expect when the specifications are moving forward. The session will also give you a clear understanding of how to migrate from previous versions of Jakarta EE and Java EE as well as show how to leverage Java SE 17 and newer features with Jakarta EE.</p>"},{"id":142135,"day":"Tuesday","time":"10:30 - 11:15","location":"Stage 2","name":"Turbocharged: Writing High-Performance C# and .NET Code","speaker":"Steve Gordon","info":"<p>In this session, you'll learn to write C# code that executes faster and allocates less. This session is packed with practical examples and demos of where the latest high-performance APIs and language features can be applied. We'll apply types such as Span and Memory to efficiently process data and to parse strings. We'll examine System.IO.Pipelines, offering high-performance I/O and we'll utilise ArrayPool to reduce GC allocations. We'll discuss when and why performance matters and you'll learn how to measure your code, using a data-driven approach to focus your optimisations. These features can seem complicated, unapproachable and difficult to apply. In this session, Steve introduces high-performance newcomers to the features, showing you how they work, where they can be applied and how to measure performance improvements in your code. This talk is for developers, who like Steve, are ready to begin their journey towards writing faster .NET code, which allocates less.</p>"},{"id":142136,"day":"Tuesday","time":"10:30 - 11:15","location":"Stage 5","name":"Micro-frontends anti-patterns","speaker":"Luca Mezzalira","info":"<p>Micro-frontends are adopted more often by organizations in different industries thanks to their capability of scaling the organization and creating independent teams. Thanks to this rapid adoption, similar challenges are faced by organizations new to this architecture pattern. In this session, you will learn the most common anti-patterns I've seen in the past 7 years of implementing and consulting multiple companies in their journey into the micro-frontends architecture Whether you are an expert or a newbie, in this talk, you will learn how to structure properly your micro-frontends architecture</p>"},{"id":142137,"day":"Tuesday","time":"10:30 - 12:30","location":"Workshops M3","name":"Explore the duality behind building a Data Science business with IIoT in the Railway industry.","speaker":"Arthur Van de Wiele, Nrithya Muniswamy","info":"<p>More often than not, \"development\" is about engineering a lean and efficient solution to a known problem. Development would normally come after the \"research\" where the last thing on your mind should be to stay \"lean\" or \"efficient\". After all, you should be exploring and characterizing a problem by whatever means necessary. But how much of this is really true? Let's delve into the reality of \"developing\" for \"research\" and the duality that it entails. We will discuss hardware-enabled data science and how we develop a \"product\" for research as much as for our customers.</p>"},{"id":142138,"day":"Tuesday","time":"10:30 - 11:15","location":"Outdoor Airstream","name":"How to become a tech author?","speaker":"Timo Zander, Nils Kasseckert, Stefania Chaplin","info":"<p>Are you interested in writing a tech article but don&rsquo;t know where to start? Then this talk is for you. You will learn the basics in five steps: Find out about the process from choosing a topic to structuring your article and submitting it.</p>\n<p>Additionally, you can use the opportunity to speak with published authors and learn from their experiences. Discover how they get started on writing an article, how their approach to an online article differs from an academic paper, and what tips they have for newcomers.</p>"},{"id":142139,"day":"Tuesday","time":"10:30 - 12:30","location":"Workshops M4","name":"Integrate Communication Channels into Your Python Application","speaker":"Dino Lozina","info":"<p>This workshop is a step-by-step guide on adding communication features to your Python application. Perhaps you need to interact with users over WhatsApp, Email, or SMS&mdash;schedule reminders, send notifications, or even broadcast messages to multiple users. You don&rsquo;t have to reinvent the wheel to add those features. Infobip has the largest cloud communication platform, and we will show you how seamless integration with this platform is. We believe that developers need good tools and great developer experience to be able to focus on the important stuff&mdash;the business logic of the application they are developing. Let&rsquo;s see how you can add communication channels to your applications in a couple of minutes!</p>\n<ol>\n<li>How to Create a Self-Service Account&nbsp;</li>\n<li>Where to Find Tools (SDK)&nbsp;</li>\n<li>How to Use Tools&nbsp;</li>\n<li>Adding Advanced Communication Features to Your Applications (Guided use case)</li>\n</ol>"},{"id":142140,"day":"Tuesday","time":"10:30 - 12:30","location":"Workshops M2","name":"Building Reusable Server Components in React 18","speaker":"Addison Schultz","info":"<p>React 18 just launched earlier this year, with a feature React developers have been looking forward to for a long time: Server Components. In this workshop, you&rsquo;ll learn the basics of what React Server Components are, how to effectively build and use them, while focusing on one of the major advantages of React: Reusability through components. You'll also learn more about integrating your web projects with emerging tools and APIs in the modern web development market. Join Addison and Will from Miro to see how you can get ahead of the curve and start building reusable server components for your next project.</p>"},{"id":142141,"day":"Tuesday","time":"10:30 - 12:30","location":"Workshops M5","name":"Data Engineering 2.0 - Let's build a simple Data Pipeline using Singer.io","speaker":"Michel Ebner","info":"<p>\"Data engineering\" - a simple job title which hides a lot. But everyone knows him as the guy responsible for new data in the Data Warehouse! Together we will have a quick peak into the evolution of data engineering, some of the work a data engineer has to do and we will try to build a simple data pipeline. - We will look into a common Data Engineer Tool Architecture. What is he responsible for? What tools or technologies should he master? How has it evolved? Why talk about \"Data Engineering 2.0\"? Now and in the near future? - After those basics and theoretical informations, we will do some hands on to build our own Data Pipeline. To do so, we will create a python programm using the singer.io framework. - To end the session, we will look into a whole data pipeline including CI/CD (with GitLab and K8s) and answer: \"Why modern Data Engineers are more likely Data Platform Engineers?\" Hands on if wanted. Otherwise you can just follow the example to get a look into data engineering.</p>"},{"id":142436,"day":"Tuesday","time":"10:30 - 12:30","location":"Workshops M7","name":"Database Workflows & API Development with Prisma","speaker":"Nikolas Burk","info":"<p>Prisma is an open-source ORM for Node.js and TypeScript. In this workshop, you&rsquo;ll learn the fundamental Prisma workflows to model data, perform database migrations and query the database to read and write data. You&rsquo;ll also learn how Prisma fits into your application stack by building a REST API and a GraphQL API from scratch using SQLite as the database.</p>\n<ol>\n<li>Setting up Prisma, data modeling &amp; migrations&nbsp;</li>\n<li>Exploring Prisma Client to query the database&nbsp;</li>\n<li>Building REST API routes with Express&nbsp;</li>\n<li>Building a GraphQL API with Apollo Server&nbsp;</li>\n</ol>\n<p>Prerequisites:&nbsp;</p>\n<ul>\n<li>Node.js: 12.2.X / 14.X</li>\n<li>NO prior knowledge of TypeScript or SQL required.&nbsp;</li>\n<li>This workshop is planned for 120min.</li>\n</ul>"},{"id":145816,"day":"Tuesday","time":"10:30 - 12:30","location":"Workshops M6","name":"Hands on BDD (Behaviour Driven Developmet)","speaker":"Manel Sellés, Félix Carpena","info":"<p>The session will be guided in Java, but we will also provide the skeleton for JavaScript.</p>\n<p>The session will start with an explanation of BDD (behavior driven development) and an overview of the available tools. Then we will go to the practical side, so please bring your laptop. We will use BDD as a means in order to improve/refactor existing examples of the code provided. The session will be guided and it will be divided into several timed steps, like adding tests to the existing code, learning to write gherkin, refactoring and adapting the solution to new requirements. The session will be:</p>\n<ul>\n<li>Presenting BDD and tooling</li>\n<li>Present an example of code and the proposed gherkin. The attendee must implement the test scenarios.</li>\n<li>Refactor some parts of the code taking advantage of tests.</li>\n<li>Adapt the code to new features from PO and see how tests help you.</li>\n</ul>\n<p>Requirements: laptop with your IDE and docker installed</p>"},{"id":146331,"day":"Tuesday","time":"11:00 - 11:30","location":"Mainstage","name":"Finding the Unknown Unknowns: Intelligent Data Collection for Autonomous Driving Development","speaker":"Liang Yu","info":"<p>In a safety-critical application such as autonomous driving, understanding what a model does not know is of paramount importance. Liang and her team are working on the Big Loop, an intelligent data aggregation system that supports data-driven development.</p>\n<p>It helps identify a perception model&rsquo;s weakness by detecting samples that pose a challenge to the model, and collects such data to improve its performance. Liang will dive deeper into the development of this system, specifically into a deep neural network-based software component called INSTINCT (IN SiTu INtelligent data CollecTor).</p>\n<p>This piece of software analyses, in real time, all of the sensor data streamed throughout a vehicle to identify samples that can most efficiently improve the reliability of the automated driving systems.</p>"},{"id":142143,"day":"Tuesday","time":"11:05 - 11:35","location":"Stage 4","name":"Containers in the cloud - State of the Art in 2022","speaker":"Federico Fregosi","info":"<p>In only a few years, the number of options available to run containers in the Cloud has literally exploded. Each provider now offers tens of &ldquo;slightly different&rdquo; services, each with its own minor trade-offs. Furthermore, running your applications in 2022 is definitely not like doing it in 2019: some of the new serverless options offer unique value propositions that shouldn&rsquo;t be missed. It&rsquo;s easy to get overwhelmed! This talk will categorize the various options available on AWS, Azure &amp; GCP, focusing on what is state-of-the-art in 2022. We&rsquo;ll look at Kubernetes and its evolution. Finally, we&rsquo;ll explain the trade-offs between different categories from a technical and organizational standpoint. We&rsquo;ll then do a deep dive with a demo on some of the new services that have been recently launched and that are quickly evolving to change the game: GCP Cloud Run, Azure Container Instances, and AWS Fargate.</p>"},{"id":146893,"day":"Tuesday","time":"11:05 - 11:35","location":"Stage 3","name":"What the heck do \"declarative\" and \"reactive\" actually mean?","speaker":"André Kovac","info":"<p>You&rsquo;ve built apps with frontend frameworks before? - Then you surely came across the terms \"declarative\" and &ldquo;reactive&rdquo;. Every modern UI framework or library wants to be it, but what do these terms actually mean? And what&rsquo;s the difference between &ldquo;declarative&rdquo; and &ldquo;imperative&rdquo; code?</p>\n<p>It took me a long while to grasp these sentence - but when I finally did, I saw frontend frameworks in a totally new light! And I hope you will feel the same after this talk.</p>\n<p>We&rsquo;ll delve into a lot of code examples to deeply understand the terms - with examples using vanilla JavaScript, React and Svelte. But the learnings will be universal. After this talk you&rsquo;ll be able to confidently join discussions about the \"declarative\" and \"reactive\" nature of any new package or library.</p>"},{"id":142355,"day":"Tuesday","time":"11:15 - 11:50","location":"Virtual Only Track","name":"How Does CSS Work?","speaker":"Elad Shechter","info":"<p>When you start creating a new website or web application, even before writing a single style, the browser applies styles to it &mdash; its default styles. Have you ever asked yourself who decides what those basic default styles will be? In this talk, I want to teach you the different CSS levels in browsers, how they work, and how we can control and manipulate them.</p>"},{"id":142144,"day":"Tuesday","time":"11:15 - 12:00","location":"Microstage 3","name":"Build and deploy production ready PyTorch models","speaker":"Henk Boelman","info":"<p>With machine learning becoming more and more an engineering problem the need to track, work together and easily deploy ML experiments with integrated CI/CD tooling is becoming more relevant then ever. In this session we take a deep-dive into Azure Machine Learning, a cloud service that you can use to track as you build, train, deploy, and manage models. We use the Azure Machine Learning Python SDK to manage the complete life cycle of a PyTorch model, from managing the data, to train the model and finally run it into a production Kubernetes cluster. At the end of this session you have a good grasp of the technological building blocks of Azure machine learning services and train a PyTorch model on scale.</p>"},{"id":142145,"day":"Tuesday","time":"11:15 - 12:15","location":"Microstage 2","name":"Building a schema-driven UI using TerminusX","speaker":"Kitty Jose","info":"<p>TerminusDB is an open-source document graph database. The database itself enables you to build quickly with the simplicity of JSON documents and turn objects into powerful knowledge graphs &ndash; perfect for critical asset relationships. This workshop will demonstrate the simplicity at which a Critical Asset Management System (CAMS) can be developed using TerminusX and TerminusDB Documents SDK. The SDK automatically generates the UI from the schema frames of documents which can also be customized to any look and feel.</p>"},{"id":142146,"day":"Tuesday","time":"11:15 - 11:45","location":"Microstage 1","name":"The automotive OS – what is it, why do I need it, and what does it take to build and operate it?","speaker":"Moritz Neukirchner","info":"<p>Everyone is talking about Automotive OS these days. Many major OEMs have announced their own platforms, oftentimes even giving them the same name of [OEM].OS. However, these platforms differ in scope and technology. In this speech, Moritz Neukirchner from Elektrobit introduces fundamental ideas of Automotive OS and how they impact the industry.&nbsp;</p>\n<ul>\n<li>Learn how an automotive OS differs from established middleware solutions like AUTOSAR</li>\n<li>Discover how an automotive OS influences the development and maintenance of software</li>\n</ul>"},{"id":142147,"day":"Tuesday","time":"11:20 - 12:05","location":"Stage 5","name":"Building software that scales with Typescript","speaker":"Tal Joffe","info":"<p>Typescript was built by Microsoft for this very purpose - helping developers manage large and complex Javascript codebases. But simply using Typescript will not magically make your code scalable. In this talk, I'll explain some key architecture and implementation principles that can leverage Typescript abilities and allow your Javascript code to scale. We will start by understanding what are the prerequisites for a scalable project and will see how to achieve them one by one and how to know if we have succeeded and created a scalable solution. Since the use of Typescript among JS developers is opinionated I'll try to share also how not to use Typescript.</p>"},{"id":142148,"day":"Tuesday","time":"11:20 - 11:50","location":"Stage 1","name":"Using Java 17 latest features in real world projects","speaker":"Ron Veen","info":"<p>This talk is a follow-up to my talk \"New language features in Java since JDK11\". In that talk, I walked you through all the awesome new stuff. Today I&rsquo;ll show you actual usages of these new features so that you can start using them in your project too. Come and see real-world usage for constructs like records, switch functions, sealed classes, and pattern matching to name a few. This is even more important if you consider that the upcoming releases of extremely popular and widely used frameworks such as Spring (v6) and Spring-Boot (v3) will use JDK17 as the minimum baseline for development. Don't get left behind and let me show you how to use all the new language features from JDK11 up to JDK17 in these frameworks.</p>"},{"id":142149,"day":"Tuesday","time":"11:20 - 11:50","location":"Stage 2","name":"5 features that help you get the most out of C# 10","speaker":"Louëlla Creemers","info":"<p>Are you still not sure about using C# 10 in your new projects? Have you not found any time yet to look into the new features? C# 10 together with .NET 6 includes a lot of new features that makes working with C# easier for a developer every single day.</p>\n<p>In this session I will show you 5 of them which you can use for every project you&rsquo;re working on. Does this sound interesting to you? Join me and get yourself back up to date in the world of .NET and make your code cleaner and better with these new features.</p>"},{"id":142151,"day":"Tuesday","time":"11:20 - 11:50","location":"Panorama Stage","name":"Evolving your APIs, a step-by-step approach","speaker":"Nicolas Fränkel","info":"<p>When you publish your first HTTP API, you&rsquo;re more focused on short-term issues than planning for the future. However, chances are you&rsquo;ll be successful, and you&rsquo;ll &ldquo;hit the wall&rdquo;. How do you evolve your API without breaking the contract with your existing users?</p>\n<p>In this talk, I&rsquo;ll first show you some tips and tricks to achieve that: moving your endpoints, deprecating them, monitoring who&rsquo;s using them, and letting users know about the new endpoints. The talk is demo-based, and I&rsquo;ll use the Apache APISIX project for it.</p>"},{"id":142160,"day":"Tuesday","time":"11:20 - 12:05","location":"Outdoor Airstream","name":"Giving a talk - how to start?","speaker":"Falk Sippach","info":"<p>Giving a presentation in front of a group of people is a big hurdle for many of us. But with the right preparation and a little practice, it doesn't have to be a problem at all and is very useful, especially for everyday business. And even if it sounds paradoxical, user groups meetups and conferences offer the best conditions to try yourself out in front of an audience.</p>\n<p>But how to find a topic, how to write an exciting abstract, how to prepare the talk and what are the best tricks to cut a good figure on stage? I would like to tell you about my experiences as a speaker and also conference and user group organizer.&nbsp;</p>\n<p>And I am sure to convince some of you. \"Aftercare\" is free of charge and included, by the way.</p>"},{"id":142153,"day":"Tuesday","time":"11:40 - 12:10","location":"Mainstage","name":"Design Principles For The Web","speaker":"Jeremy Keith","info":"<p>Designing and developing on the web can feel like a never-ending crusade against the unknown. Design principles are one way of unifying your team to better fight this battle. But as well as the design principles specific to your product or service, there are core principles underpinning the very fabric of the World Wide Web itself.</p>\n<p>Together, we&rsquo;ll dive into applying these design principles to build websites that are resilient, performant, accessible, and beautiful.</p>"},{"id":142154,"day":"Tuesday","time":"11:40 - 12:25","location":"Stage 3","name":"Building the Right Product and Building It Right: A Glimpse into Extreme Programming, Atomic Design","speaker":"Rita Castro","info":"<p>Have you heard about Atomic Design? How about Extreme Programming and Test-Driven Development? For sure you have heard about React - a few things, I bet. How about Micro-frontends?</p>\n<p>In this talk you will get some insight on leveraging the power of Atomic Design to build the right product (using React) and capitalize on Extreme Programming and Test-Driven Development to build it right (by exploring the React Testing Library) and use the Micro-frontends pattern to scale it beyond the scope of a Minimum Viable Product.</p>"},{"id":142161,"day":"Tuesday","time":"11:40 - 12:25","location":"Stage 4","name":"Kubernetes Security - Challenge and Opportunity","speaker":"Marc Nimmerrichter","info":"<p>For anyone in software development, there is no way around Kubernetes. Containerization has changed the way software is developed, deployed and operated. Microservices is the new paradigm.</p>\n<p>Many teams around the world discuss just now: What does containerization and Kubernetes mean to security and how to fit this technology into our existing architectures and processes? In this talk we will dissect the various components of Kubernetes and explain how they work technically under the hood.&nbsp;</p>\n<p>We will discuss common pitfalls and how they could be exploited by attackers to compromise the whole cluster. There will be a demo of kernel exploits and their risks to container isolation mechanisms. But not all is bad: With the right approach, Kubernetes environments can even lead to security improvements.&nbsp;</p>\n<p>This talk will provide the key principles for designing secure Kubernetes architectures.</p>"},{"id":142155,"day":"Tuesday","time":"11:55 - 12:40","location":"Stage 2","name":"What is a Message Queue and when and why would I use it?","speaker":"Clemens Vasters","info":"<p>I'm the lead architect in central engineering of Microsoft Azure's messaging and eventing services fleet and one observation we keep making is that developers don't know about queues and what to do with them. This session is a 101 basic introduction into what a message queue is, what solution patterns it helps with, and what to do with features like dead-lettering and expiry.</p>\n<p>This session isn't about what's new, it's about the whole concept. The talk is not product specific and applies to anyone's product's and services, even though I'll certainly mention our own.</p>"},{"id":142156,"day":"Tuesday","time":"11:55 - 12:40","location":"Stage 1","name":"Quarkus. A Bliss for developers","speaker":"Alex Soto","info":"<p>Everyone is excited about Quarkus, the Kubernetes Native Java stack that lets you create Java applications with a small memory footprint and amazingly fast boot time (just some milliseconds) offering near-instant scale-up and high-density memory utilization in container orchestration platforms like Kubernetes and a perfect match for serverless. But these capabilities are useful at runtime, but what does Quarkus offer to developers to use at development time?</p>\n<p>As developers, we want to improve our performance, we want to spend as much time as possible coding and not recompiling/repackaging the application every time we want to check if the application is working or not, running the full test suite when only one small part of the code has been modified or preparing external dependencies such as a database or a Kafka broker.&nbsp;</p>\n<p>If you are willing to boost your performance as a developer, come to this session and learn how Quarkus can help you, yes you, the developer.</p>"},{"id":142390,"day":"Tuesday","time":"12:00 - 12:35","location":"Virtual Only Track","name":"Natural Language Processing: Changing the way we tell machines what we want them to do.","speaker":"Adam Grzywaczewski","info":"<p>Software development process involves describing the desired functionality using a formal programming language (such as C++ or Python). Recent progress in Natural Language Processing (NLP) brings us closer than ever before to a point where that formal programming language is no longer necessary and can be replaced by just plain text description of program&rsquo;s behaviour. An early example of this capability can be seen in &ldquo;GitHub coPilot&rdquo;. In this talk we will discuss the most recent breakthroughs in NLP and the reasons for their success. In particular we will focus on the ability of NLP models to learn new tasks with just a few training examples. We will discuss how those advances in AI change the software development process and show a demo illustrating the process of teaching an NLP model how to carry out new, previously unseen tasks. We will conclude by discussing the tools (e.g. NVIDIA Megatron-LM) you can use to build SOTA NLP models (such as GPT-3) and deploy them to production.</p>"},{"id":142400,"day":"Tuesday","time":"12:00 - 12:35","location":"Virtual Only Track","name":"The Sound of Code: Instrument with OpenTelemetry","speaker":"Henrik Rexed","info":"<p>We have experienced over the last 12 years a lot of changes in the way we are building and managing our software stack. We moved from Waterfall to Agile, and now DevOps. To Make sure we provide a reliable system to our users we also had to implement SRE methodology on top of our DevOps initiatives. In reality, DevOps and SRE rely on one fundamental concept: Observability.</p>\n<p>To help us in our observability journey, OpenTelemetry has provided a standard on the way we are able to produce and collect measurements from our environments. We all understand the value of having traces generated out of our application, but the journey could seem difficult and time-consuming. How can we utilize properly the instruments of Opentelemtry to make our code sound beautiful?&nbsp;</p>\n<p>During this presentation we will explain:&nbsp;</p>\n<ul>\n<li>The various components of OpenTelemetry&nbsp;</li>\n<li>The various core Objects required to instrument your code&nbsp;</li>\n<li>Best practices related to instrumentation&nbsp;</li>\n<li>The latest news related to OpenTelemetry</li>\n</ul>"},{"id":142157,"day":"Tuesday","time":"12:00 - 13:00","location":"Microstage 1","name":"Automated Code Quality Checks with Custom SonarQube Rules","speaker":"Martin Gluhak, Daniel Strmečki","info":"<p>In this lecture, we'll present the IBM iX project quality approach, including coding guidelines, static code analysis, and testing automation. Coding guidelines define our aligned best practices, which are enforced through architectural unit tests and SonarQube static code analysis. Furthermore, we used our company coding guidelines to create a set of custom SonarQube rules. Naturally, we don&rsquo;t want to repeat the same mistakes on multiple projects. Moreover, we want our new-joiners to learn from our previous experience.</p>\n<p>We'll also do a live coding session. We'll show how to create custom Sonar rules for Java. Utilizing a template project provided by SonarSource, we will create a new custom rule and accompanying unit tests.&nbsp;</p>\n<p>Once created, we'll deploy the rule to a local SonarQube instance and add it to our quality profile. After everything is configured, we will demonstrate rule usage from the end-user perspective when developing in IntelliJ with help of the SonarLint plugin.</p>"},{"id":142158,"day":"Tuesday","time":"12:10 - 12:40","location":"Stage 5","name":"Next, Nest, Nuxt… Nust?","speaker":"Marius Obert","info":"<p>By the time this talk is over, someone will have invented a new JS framework. Thankfully it's probably not gained much popularity yet. In the meantime, Express.js is no longer the most used framework, Next.js recently took the top spot in the StateOfJS survey with several others following closely.</p>\n<p>So, in this session we'll compare the big frameworks of today, check out their features, what they are missing and consider their different use-cases.&nbsp;</p>\n<p>By the end of the talk, there might be a new framework, but at least you'll know when and where to use the existing ones.</p>"},{"id":142159,"day":"Tuesday","time":"12:10 - 12:40","location":"Panorama Stage","name":"Hybrid AI: Next Generation Natural Language Processing","speaker":"Jan Schweiger","info":"<p>Unfortunately, 90% of AI projects do not make it into production. In this talk, I therefore show how hybrid AI combines the strengths of recent machine learning and traditional NLP methods. The hybrid approach increases the accuracy, robustness and efficiency of Natural Language Processing systems so that they can be used in real word scenarios.&nbsp;</p>\n<p>To begin, I will briefly explain the different NLP approaches, as well as their strengths and weaknesses.</p>\n<p>I will then show how we at HuForce have implemented highly accurate but efficient search using the hybrid approach.&nbsp;</p>\n<p>Finally, I'll briefly discuss two other real-world use cases of how we leverage hybrid NLP, namely: expert identification and knowledge analysis in companies.</p>"},{"id":142162,"day":"Tuesday","time":"12:15 - 13:15","location":"Microstage 3","name":"How modern technology in finance makes the world more sustainable","speaker":"Tobias Beranek, Stephanie Hohendorff","info":"<p>What can and should a bank do to achieve the goals of the &ldquo;Paris Agreement&rdquo; and the &ldquo;Sustainable Development Goals (SDGs)&rdquo;? And why do we need you as a developer to make sure we achieve these goals in the context of sustainable finance? As a promotional bank KfW is evolving to become a transformative promotional bank. Hence, it is our ambition to be a pioneer in the promotion of sustainability.&nbsp;</p>\n<p>This includes continuously developing the identification, measurement and presentation of the impacts of our promotion. In order to live up to this aspiration we are convinced that we need to follow a data driven approach. We need to make sure, that we understand the impact our investments have worldwide. This is why we are currently building modern, cloud-based IT solutions.</p>\n<p>Are you interested in where we stand and how software can make the world more sustainable?</p>"},{"id":142171,"day":"Tuesday","time":"12:20 - 12:50","location":"Mainstage","name":"How to build the best Food service in the world","speaker":"Tomáš Čupr","info":"<p>- To become an undisputed leader in online grocery, we must create the perfect environment for our IT.</p>\n<p>- We have implemented our adaptation of agile over a year ago and been through ups and downs with it</p>\n<p>- We always seek ways to improve our way of working and are super fast in doing so</p>\n<p>- We can&rsquo;t wait to give you a sneak peek of how we work @ Rohlik</p>"},{"id":146475,"day":"Tuesday","time":"12:30 - 13:15","location":"Stage 4","name":"A Guide To Functional Programming","speaker":"Jemima Abu","info":"<p>Functional Programming is a paradigm as old as time (well as old as the 1950s if we&rsquo;re being literal) but that doesn&rsquo;t make it any easier to understand. While there are languages that are functional by design, it&rsquo;s also possible to use functional programming as a coding guide for any language you're working in.</p>\n<p>In this presentation, we'll explore the What, Why and How of Functional Programming and also take a look at how to use functional programming with popular languages to write code that is scalable, readable and easy to maintain - all the things good code should be.</p>"},{"id":142163,"day":"Tuesday","time":"12:30 - 13:00","location":"Microstage 2","name":"LiaScript - Interactive Markdown for Education & Documentation","speaker":"André Dietrich","info":"<p>Well... there is a so called OER movement - OER stands for OpenEducationalResources. In contrast to the OpenSource initiative, there is no such thing as a common or uniting (programming) language, where people can contribute peaces to a larger project. It might sound strange, but we think that Markdown can be an ideal language candidate for e-learning.</p>\n<p>But it is mainly used to create static content, the syntax is fixed and not extendable. We tried to reinterpret Markdown and started to develop LiaScript, a WebApp that runs entirely within the browser; and just by referencing can turn any README into an interactive textbook, presentation, or screencast with an auto. narrator where:&nbsp;</p>\n<ul>\n<li>code-snippets can be executed &amp; edited&nbsp;</li>\n<li>tables turn into diagrams</li>\n<li>native JavaScript support&nbsp;</li>\n<li>as well as quizzes, surveys, ASCII-art, etc.&nbsp;</li>\n</ul>\n<p>LiaScript has its own macro-language, which can be used by developers to introduce new features that can be utilized in other courses. Like it? [[X]] YES [[ ]] no</p>"},{"id":142164,"day":"Tuesday","time":"12:30 - 13:15","location":"Stage 3","name":"Is Flutter ready for the web yet? - A live coding comparison between Flutter and React","speaker":"Thomas Hinterwimmer, Marcus Wojtusik","info":"<p>What is the right choice for your next web project: the rising star Flutter or the established React? What do you need to consider and what can you expect from each solution? We want to share our insights and experiences with you. Further, we would like to provide you with a precise comparison and guidance for your own product decisions.</p>"},{"id":147227,"day":"Tuesday","time":"12:45 - 14:45","location":"Workshops M4","name":"Build ultra-fast In-Memory Database Apps and Microservices with Java","speaker":"Christian Kümmel, Markus Kett","info":"<p>Modern software applications have to collect, link, and search tons of data - preferably in real-time. Cloud-native microservices are the defacto-standard architecture and the trend is increasingly toward serverless computing. However, conventional databases cannot keep pace and the traditional Java stack is not suited for building cloud-native apps. The biggest challenges are low performance, slow startup time, high memory consumption, disproportionately high administration effort, and skyrocketing cloud costs. Are Java and classic database systems still suited for modern cloud-native and serverless systems?<br>In this workshop, you will learn first of all what cloud-native microservices and serverless actually mean, how these systems basically work, and why the traditional Java stack and conventional database systems are not suited for the cloud. After that, you will learn how you can build ultra-fast, highly available, horizontally scalable, and cost-efficient in-memory database apps and microservice by using the modern Java cloud-native technology stack combining modern serverless platforms.<br>This is a get started workshop. You will get an easy-to-understand intro, see lots of code and an incredible performance demo, and learn step by step how to get started building ultra-fast database apps and cloud-native microservices.</p>"},{"id":142395,"day":"Tuesday","time":"12:45 - 14:45","location":"Workshops M6","name":"Pictures: Smart Way to Bypass Logical Brain","speaker":"Kris Corbus","info":"<p>We humans can become stuck in our heads through talking about the issue in front of us. I am sure you are familiar with the feeling: moving round and round the same problem again and again. How can we break a vicious circle? One way is to change \"the language&rdquo;. Instead of words let's use pictures!</p>\n<p>Words appeal mainly to the consciousness, instead pictures bring everything together into a much simpler way. Since the 1980s, usage of &ldquo;metaphoric cards&rdquo; - picture language - has been a well-known and widely used method in therapy and coaching.&nbsp;</p>\n<p>In my talk I will explain my take on this method and how you can use it individually or in groups. In the hands-on workshop we will dive deep into the picture world and I will share some ways how to use them to help to illustrate complex issues or to find new perspectives and approaches or simply to give feedback.&nbsp;</p>\n<p>For this workshop you need to have an open mindset and to be ready to be a fool and do foolish things.</p>"},{"id":142415,"day":"Tuesday","time":"12:45 - 13:25","location":"Virtual Only Track","name":"Graph-based stream processing","speaker":"Ivan Despot, Dominik Tomicevic","info":"<p>Graph analytics can provide insights into complex networks that would otherwise require resource-intensive computations. Fraud detection, recommendation engines and process optimization are some of the use cases where real-time decisions are mission-critical, and the underlying domain can be easily modeled as a graph. It is also much simpler to store streaming data in the form of graphs, as the NoSQL graph database approach doesn't rely on predefined and rigid tables.</p>\n<p>When connecting a data stream to Memgraph, you only need to create a transformation module that will map incoming messages to the graph model. This data can then be analyzed using the Cypher query language without having to implement custom algorithms or relying on development-heavy solutions.&nbsp;</p>\n<p>MAGE is a graph library that works well with stream processing systems and contains graph algorithms for analyzing streaming data.</p>"},{"id":142419,"day":"Tuesday","time":"12:45 - 13:25","location":"Virtual Only Track","name":"With WasmEdge to new shores","speaker":"Max Körbächer","info":"<p>WebAssembly aka WASM is migrating from a portable enclosed browser runtime to process serious backend tasks. What makes it so interesting is the fact that the WASM container is secure, efficient, portable and fast - at least on the paper it looks like the better implementation of containers. However, this abilities make WASM very attractive to be utilized in environments with limit capabilities on security isolation, resources and computing power. We will look into how to get started with WasmEdge and implement a simple application to talk to. Then we will discover the behavior of WasmEdge, and which use cases we can derive from it. And finally where are the limits and critically question if implementations like WasmEdge are really the future.</p>"},{"id":142420,"day":"Tuesday","time":"12:45 - 14:45","location":"Workshops M7","name":"JAMStack 2022 - Build Your Own SaaS in 1 Day","speaker":"Dávid Lévai","info":"<p>Building a SaaS product is different now compared to 10 or even just 5 years ago. Authentication, authorization, payments, emailing, billing, notifications, media handling, or other features were either a headache or boring to develop every time. And it took a long time.</p>\n<p>There's no need to reinvent the wheel anymore with all of the modern platforms on the market. In this workshop, we will build an online course SaaS to sell pre-recorded video courses with downloadables, progress tracking, and a subscription system.</p>"},{"id":142165,"day":"Tuesday","time":"12:45 - 13:15","location":"Stage 2","name":"Debugging Static Web Apps","speaker":"Stacy Cashmore","info":"<p>Static Web Apps are a wonderful way of deploying web apps that use a client-side framework, using an Azure Function in order to deliver dynamic content. In the static web app itself the client and API are proxied so that, to the outside world they appear as one.</p>\n<p>On our local machines that is not the case... So just how can we debug them easily? We are going to be setting up a Visual Studio project to allow debugging out of the box. After that we'll take a tour of the new Static Web App CLI - using a command line tool to replicate the function of the web app itself on our local machine.</p>"},{"id":142166,"day":"Tuesday","time":"12:45 - 13:15","location":"Panorama Stage","name":"Go Generics","speaker":"Nils Kasseckert","info":"<p>You had to wait a long time - now Go (finally) supports generics. This makes generic programming in Go possible. The talk will give an introduction to generic programming with Go. Using an example project, the basics will be explained and pitfalls will be pointed out.</p>\n<p>At the beginning the basic principle of generics will be explained and first the Go constraints will be discussed. Afterwards the usage of generics in Go will be shown by examples. The lecture will be concluded with notes on generic programming in Go.</p>"},{"id":142167,"day":"Tuesday","time":"12:45 - 13:15","location":"Stage 5","name":"Full Stack Web Apps With Nothing But Python","speaker":"Eli Holderness","info":"<p>Building web apps is a complicated mess. You need to know Python, JS, HTML, CSS, SQL, Flask, Bootstrap, SQLAlchemy, Webpack...the list goes on. What if you could do it all in Python? That's what we built: an open-source framework with Python in the browser, Python on the server - even a Python UI toolkit. And then we built an online IDE, drag'n'drop designer and hosting platform for it - all available for free. In this talk, I'm going to discuss the current web landscape, why we built Anvil the way we did - then take a deep dive into how it works, including a live demo.&nbsp;</p>\n<p>How do you run Python in the browser? How do you build an autocompleter that knows about everything from your UI layout to your database schema? And what does it mean for a programming tool to be \"accessible\"? No web development knowledge required &amp; no paid features of Anvil are showcased in this talk.</p>"},{"id":142168,"day":"Tuesday","time":"12:45 - 14:45","location":"Workshops M2","name":"Unit vs Integration Testing in Spring Boot","speaker":"Dajana Jeđud, Ivan Foro","info":"<p>These days testing our Java code is a must. However, it's not that simple to do it right. In this workshop, we&rsquo;ll explain why testing is important and what is the difference between Unit and Integration testing. We'll do a live coding session creating both Unit and Integration tests on a small Spring Boot application.</p>\n<p>We use a couple of libraries including JUnit, Mockito, MockServer, MockMVC, and Testcontainers. We&rsquo;ll compare Unit vs Integration testing approaches and state their pros and cons. Finally, we'll provide tips and best practices on when and how to develop both types of tests.</p>"},{"id":142170,"day":"Tuesday","time":"12:45 - 14:45","location":"Workshops M5","name":"How to build the case to invest in technical work","speaker":"Andrea Stubbe","info":"<p>Do you struggle to make your managers (or other decision-makers) schedule enough time for technical work and improvements? Do you regularly find yourself working longer hours or secretly sneaking in improvement work? Increasing test coverage, refactoring, cleaning up code, updating to new library versions, and experimenting with new technologies - they all bring value to businesses.</p>\n<p>It's just not always super obvious. Join this workshop to learn basic techniques and see examples of successful and failed attempts to make the case to invest in technical work.</p>\n<p>Bring your own examples and practice arguing with a real-life VP of Product.</p>"},{"id":147302,"day":"Tuesday","time":"12:45 - 13:45","location":"Workshops M8","name":"How to kickstart freelancing as a developer and work independent, flexible and self-determined","speaker":"Pascal Schäfer","info":"<p>Did you know that 25% of Europe&rsquo;s 13 million digital professionals are freelancers? And with a strong demand in technical skills, developers of any type are the most sought after profiles - from SMBs up to big corporates: They are looking for you!</p>\n<p>So whether you already did think about becoming a freelance developer or even already started out - we've got some tipps, insights and hands-on advice how to become successful in freelancing.&nbsp;</p>\n<p>In this workshop we will step-by-step cover all subjects relevant for the start of a freelance career:</p>\n<p>- How to market yourself<br>- How to find clients and convert leads into paying customers<br>- What legal status to choose<br>- How to define your daily rate to compete on the market<br>- How to build your reputation online</p>\n<p>In addition we will share some insights of the European freelancer landscape to give you guidance on what your competition looks like and how to stand out of the masses.</p>\n<p>Are you ready to kickstart your career in freelancing? We are here to support you!</p>"},{"id":142313,"day":"Tuesday","time":"12:45 - 14:45","location":"Workshops M3","name":"Building a Video Communication Platform from Scratch","speaker":"Christoph Lipautz","info":"<p>Dealing with video conferences can be a complex task. In this workshop we will build a custom web based platform from scratch that connects users to online meetings. The software will authenticate users, manage and control video conferences and store a history of meetings.</p>\n<p>As a communication base we will stick to the eyeson API and utilize its features to our needs. Some of the topics covered by the workshop are: User Authentication, Meeting Access Control, Meeting History, Storage of Snapshots and Recordings, Custom User Interface. Although we build a standalone application, we will see how easy it is to adapt the solution to use within an existing project.</p>"},{"id":142118,"day":"Tuesday","time":"13:00 - 13:30","location":"Mainstage","name":"TBA (Service Session)","speaker":"","info":""},{"id":146473,"day":"Tuesday","time":"13:30 - 14:00","location":"Stage 3","name":"We are all part of the game","speaker":"Johanna Pirker","info":"<p>We live in a time of technological revolutions and innovations. Technologies are becoming increasingly connected to our society and announcements from tech companies like the idea of the Metaverse are making big waves not only in the tech world, but in many different areas of our society.</p>\n<p>Computer games and their dev tools in particular are playing an increasingly important role in the many areas of our society.&nbsp;</p>\n<p>In this talk, Johanna Pirker discusses different opportunities and technologies that will or will not gain relevance in our future.</p>"},{"id":146477,"day":"Tuesday","time":"13:30 - 14:15","location":"Outdoor Airstream","name":"Fireside Chat: Thomas Dohmke & Sead Ahmetovic","speaker":"Thomas Dohmke, Sead Ahmetović","info":""},{"id":147016,"day":"Tuesday","time":"13:30 - 14:05","location":"Virtual Only Track","name":"Serverless AWS Architecture for Smart Manufacturing","speaker":"Julian Michel, Markus Großmann","info":"<p>Automotive OEMs need highly flexible backend systems that are scalable and easily adjustable for changing manufacturing processes.</p>\n<p>In this session we will examine the architecture for a cloud native system that provides manufacturing settings to robots on the shopfloor. The architecture is purely based on serverless AWS services and highly configurable with microservices, microfrontends and UIs changeable on-the-fly without any system downtime.&nbsp;</p>\n<p>We will share best practices and lessons learned how to achieve high configurability for 24/7 scenarios and how to use serverless AWS services for Intranet web applications. Furthermore we will give recommendations for using AWS IoT and AWS Greengrass as OT/IT gateway in context of Smart Manufacturing.</p>\n<p><span style=\"text-decoration: underline;\"><strong>LIVE DISCUSSION after the session</strong></span><br>We invite you to our virtual room to discuss more about our virtual talk topic right after the session - simply&nbsp;<br>Of course there is also room to ask questions or to share your own experiences.<br><a href=\"https://events.hubilo.com/wearedevelopers---world-congress-2022/rooms\">Simply join here</a></p>"},{"id":142172,"day":"Tuesday","time":"13:30 - 14:15","location":"Stage 1","name":"Kubernetes Native Java","speaker":"Josh Long","info":"<p>Spring is all about helping developers get to production quickly and safely. These days, \"production\" is all but guaranteed to mean Kubernetes, and Spring has you covered. Join me, Spring Developer Advocate Josh Long (@starbuxman), and we'll look at how Spring Boot makes writing blisteringly fast, cloud-native, and scalable services more effortless than ever.</p>\n<p>We'll look at topics like service orchestration and composition, reactive programming, containerization, GraalVM native images, GraphQL, and more</p>"},{"id":142459,"day":"Tuesday","time":"13:30 - 13:45","location":"Microstage 1","name":"Cloud Native Data Management Day","speaker":"Michael Cade","info":"<p>Cloud Native Data Management Day (CNDM Day) is a community designed to bring together Kubernetes and cloud native data management enthusiasts. Our community welcomes users, developers and vendors of cloud native storage, backup, and other aspects of data management.</p>\n<p>Host and Moderator: Michael Cade, Senior Technologist, Cloud-Native Product Strategy &amp; DevRel at Kasten by Veeam</p>"},{"id":142173,"day":"Tuesday","time":"13:40 - 14:10","location":"Mainstage","name":"Building Enduring Infrastructure: Lessons from the First 12 Years of Stripe","speaker":"David Singleton","info":"<p>Stripe CTO David Singleton shares insights from the first decade-plus of the company's history, from building the Stripe API to launching its remote-first engineering hub in 2019. Learn how the company has approached the challenges of managing change, growing its product ecosystem, and keeping a laser focus on the end-user experience.</p>"},{"id":142174,"day":"Tuesday","time":"13:45 - 14:45","location":"Panorama Stage","name":"Yes, You Need to Unit Test your JavaScript. Here's How.","speaker":"James Bender","info":"<p>When asked about Unit Testing, most developers will give you the stock answer about how they help you write better code that has fewer defects and is more resilient to change, etc. We know the benefits. But ask them if they are doing Unit Testing, and you hear &ldquo;no, we don&rsquo;t.&rdquo; Why aren&rsquo;t developers Unit Testing their JavaScript?</p>\n<p>Most common answers:&nbsp;</p>\n<ul>\n<li>Too much work&nbsp;</li>\n<li>We&rsquo;re already behind&nbsp;</li>\n<li>It won&rsquo;t work with the framework we&rsquo;re using&nbsp;</li>\n<li>We started but ran into trouble, so we gave up&nbsp;</li>\n<li>We already have TypeScript, so we really don&rsquo;t need it&nbsp;</li>\n</ul>\n<p>In the end, most of these are obfuscations of the real reason: we don&rsquo;t know how to properly Unit Test our JavaScript. You&rsquo;ll learn how to write effective unit tests of your JavaScript applications, no matter what framework you're using.&nbsp;</p>\n<p>You&rsquo;ll learn how to structure your code for testability, how to get the most out of your testing framework and tooling, why just using TypeScript is NOT enough, and how to build a unit-friendly development culture.</p>"},{"id":142175,"day":"Tuesday","time":"13:45 - 14:15","location":"Microstage 3","name":"How to build a preorder service with SvelteKit in 8 weeks","speaker":"Domenik Reitzner","info":"<p>I'll talk about how we build a preorder service for Billa PLUS (part of REWE group) as a team of nine, from 4 countries, in 8 weeks (https://vorbestellservice.billa.at/). The main focus will be on how we build out the Frontend with SvelteKit and tailwind. We connected the frontend to a .NET 5 backend running inside of docker.</p>\n<p>As a team we really enjoyed the freedom of working with a fast dev environment (powered by vite), coupled with the rapid style development (JIT compilation of tailwind) and all of the tools (e.g. animations) baked into svelte, while maintaining a small bundle size shipped to the client.&nbsp;</p>\n<p>I'll also mention the deployment to Azure static web app and how the api driven static site approach worked for us. I'll close with some of the challenges we faced, specifically around stale data and team communication, before I'll show some code examples.</p>"},{"id":142177,"day":"Tuesday","time":"13:45 - 14:15","location":"Microstage 1","name":"CNDM Day - Winning the Hybrid Cloud","speaker":"Alex Soto","info":"<p>Life happens, and so does the Hybrid Cloud. If your company is successful enough, it'll likely have workloads spread across different public cloud providers and on-premises servers. For winning in these scenarios, you need the power of open-source.</p>\n<p>Join us in this session to witness how technologies like Kubernetes, and Skupper can turn the odds in your favor. You'll see how effectively you'll achieve requirements like cost management, failover, resiliency, and others yet maintaining your data safe.</p>"},{"id":142178,"day":"Tuesday","time":"13:45 - 14:15","location":"Microstage 2","name":"Observability For Mobile Dev: Going Beyond Basic Metric Monitoring For Mobile App Development","speaker":"Julie Gatt","info":"<p>Instabug Field Engineer, Sean Higgins will lead a discussion on how to set up, benchmark, and monitor key performance metrics for your mobile app. Learn how to prioritize issues according to impact and code ownership, and which key metrics you must track to ensure fewer headaches for the development team during troubleshooting, the rollout of new app versions, and critical periods of mobile app development.</p>\n<p>Learn how to become proactive in solving your mobile app challenges and explore the reasons why mobile apdex and crash-free sessions are critical to monitor during and beyond your app release.</p>"},{"id":142179,"day":"Tuesday","time":"14:00 - 14:45","location":"Stage 2","name":"What non-automotive Machine Learning projects can learn from automotive Machine Learning projects","speaker":"Jan Zawadzki","info":"<p>Developing ML applications in a safety-critical context is different from developing ML applications for non-safety use-cases. In the automotive industry, development standards, robustness of neural networks, and traceability from requirements to model development play a significant role.</p>\n<p>Although the use of these methods might be overkill in some situation for your ML application, I believe that other ML use-cases can still learn a few things from our approach to ML development for your own projects.</p>"},{"id":142180,"day":"Tuesday","time":"14:00 - 14:30","location":"Stage 5","name":"Capture the Flag 101","speaker":"Micah Silverman","info":"<p>Capture the Flag events are exciting and competitive. But, they can be scary to developers who have never participated in them. In this session, I introduce CTFs, discuss the benefits to developers and do a deep dive into a medium difficulty CTF challenge.</p>\n<p>I'll walk through the thought process of the wiley developer and how to pick up on clues based on programming language, protocols involved, googling against what little information is provided in the challenge and local testing. While the example is in python, no prior knowledge of python is required.</p>"},{"id":142203,"day":"Tuesday","time":"14:00 - 14:45","location":"Stage 4","name":"The good, the bad and the ugly of technology-driven innovation","speaker":"Awi Lifshitz, Wolfgang Strunk, Tomislav Tipurić, Sophie Chung","info":"<p>How technology decisions are being made and what pitfalls are to avoid. For fast-growing start-ups and established corporates.</p>"},{"id":142429,"day":"Tuesday","time":"14:15 - 15:05","location":"Virtual Only Track","name":"Event Messaging and Streaming with Apache Pulsar","speaker":"Mary Grygleski","info":"<p>When it comes to distributed, event-driven messaging systems, we usually see them supporting either one of two types of semantics: streaming, or queueing, and rarely do we find a platform that supports both. In this presentation, we&rsquo;ll first get an introduction and some clarifications of event-driven versus message-driven systems, event streams, and stream processing.&nbsp;</p>\n<p>We&rsquo;ll then take a look at Apache Pulsar which offers a very unique capability in modern, cloud-native applications and architecture, in which its platform supports both Pub-Sub and Message Queues, and extends into streams processing as well as performs message mediation &amp; transformation.</p>\n<p>We will look at how it relies on Apache Bookkeeper for its durable, scalable, and performant storage of log streams, and leverages on Apache Zookeeper. We will also see how Pulsar is meant to bring the best of other systems, such as how it fills the gaps that Kafka has and extends its streaming capability in the complex cloud world.</p>"},{"id":142462,"day":"Tuesday","time":"14:15 - 15:00","location":"Outdoor Airstream","name":"Fireside Chat with David Singleton","speaker":"David Singleton","info":""},{"id":147094,"day":"Tuesday","time":"14:15 - 15:45","location":"Virtual Only Track","name":"Deeper dive into gRPC microservices in Node.js","speaker":"Andrew Reddikh, Alex Korzhikov","info":"<p>The session overviews key architecture principles, design patterns, and technologies used to build microservices in the Node.js stack. It covers the theory of the GRPC framework and protocol buffers mechanism, as well as techniques and specifics of building isolated services using the monorepo approach with Lerna and yarn workspaces, TypeScript.&nbsp;</p>\n<p>In the second part of the session, we will jump into live coding of currency converter microservices infrastructure based on gRPC protocol in Node.js using typescript and showcase the process of creating a new microservice.</p>"},{"id":142181,"day":"Tuesday","time":"14:20 - 14:50","location":"Stage 1","name":"Moving from Java to Kotlin","speaker":"Urs Peter","info":"<p>In this talk, we will explore the journey you embark on when moving from Java to Kotlin. Based on real-world experience, code statistics, and many code samples, light will be shed on questions like &lsquo;What were the benefits and drawbacks?&rsquo;, &lsquo;How did we approach it?&rsquo; &hellip;and most of all: &lsquo;Was it worth it and why?&rsquo; At the end of this talk, you know in detail the differences between Java and Kotlin.</p>\n<p>You have learned what to expect when embracing Kotlin and which best practices you can apply, providing you with the information and tools to evaluate whether Kotlin is worth a try.</p>"},{"id":142182,"day":"Tuesday","time":"14:20 - 14:50","location":"Mainstage","name":"The Snowball Effect of Open Source","speaker":"Armin Ronacher","info":"<p>When contributing to Open Source projects, do you ever wonder how to get it more attention or even move it from a side project into something that is commercially available? In this session, you&rsquo;ll hear about the intertwined story of two Open Source projects &mdash; Sentry and the Jinja Template engine &mdash; and how these open source projects got snowballed into the commercial world.</p>\n<p>IP rights, Business Source Licenses, challenges, lessons that can be learned looking back at more than 18 years of Open Source software development - you&rsquo;ll hear it all.&nbsp;</p>\n<p>Added bonus is learning how to sustain a culture of support and contribution to Open Source within your own organizations.</p>"},{"id":142183,"day":"Tuesday","time":"14:20 - 14:50","location":"Microstage 1","name":"CNDM Day - Adjusting Pod Eviction Timings in Kubernetes","speaker":"Andrew Pruski","info":"<p>Kubernetes has high availability built into it but the default settings may not be optimal for certain workloads. In this short session we'll be looking at what happens to pods in Kubernetes when the node that they are running on fails.&nbsp;</p>\n<p>When a node goes into a not ready state, Kubernetes by default, will wait for 5 minutes to move any pods running on that node to a new healthy node. We'll discuss how this timing can be adjusted and then have a look at this in action!\" One thing I wanted to ask...with PVs on downed node..they don't move across until that node is brought up or removed from the cluster (tested in both AKS and EKS).</p>\n<p>It's something that has been holding us back from deploying SQL Server on K8s....the only option we've found is a third-party tool from Pure Storage called Portworx.</p>"},{"id":142184,"day":"Tuesday","time":"14:30 - 15:30","location":"Microstage 2","name":"Coding with quality - How quality assurance improves an agile team's daily work","speaker":"Alexander Rothenberg, Martin Fürstenau","info":"<p>Just as the world itself is changing, so is DKB! What once began as a traditional direct bank is increasingly evolving into a technology company with a banking license. Along this way, challenges in production and communication between DKB and its corporate tech startup DKB Code Factory had to be mastered.</p>\n<p>Developers, QA Engineers, and Product Owners started collaborating across the whole company and had to rethink the status quo of former product development.</p>\n<p>In this session, we will give you insights into our learning journey of transformation and quality assurance along our way to becoming a #techbank.</p>"},{"id":142185,"day":"Tuesday","time":"14:30 - 15:30","location":"Microstage 3","name":"unterkunft-ukraine.de - a War Story","speaker":"Falk Tandetzky","info":"<p>When Russia invaded Ukraine on 24 February 2022, this triggered Europe's largest refugee crisis since World War II. One day later, the website unterkunft-ukraine.de was setup to collect offers of people willing to provide a place to live as well as requests for places for refugees coming to Germany.</p>\n<p>Soon this platform became the address recommended by several media as well as the German government. After a short time more than 100.000 offers were collected. But this is just where the real challenge began.</p>\n<p>This talk will provide a look behind the scenes of this platform. It will cover the challenges we faced and the balance between security, quality and speed that we needed to achieve.</p>"},{"id":142186,"day":"Tuesday","time":"14:35 - 15:05","location":"Stage 5","name":"101 Typical Security Pitfalls","speaker":"Alexander Pirker","info":"<p>Have you ever wondered about how it comes to security incidents? I mean the really big ones like someone accessing a remote host, or executing some nice scripts inside your browser?&nbsp;</p>\n<p>In this session I want to show some of the most common pitfalls into which especially junior developers fall.&nbsp;</p>\n<p>Specifically, I want to cover the following frequent mistakes, and more:</p>\n<ul>\n<li>Missing Input Data Validation: Certainly a big one, since depending on the environment, this could lead to for example remote-code-execution (RCE) on your backend, or the execution of scripts in your browser, known under the term XSS&nbsp;</li>\n<li>Improper Usage of Data Types: One of my favorites, since it highlights how careless we sometimes use data types without reasoning about the consequences of our choices.&nbsp;</li>\n<li>Revocation processes: Unfortunately, as developers we build a system to run in a happy world, most of the time. But how do you deal with the revocation of a malicious entity?&nbsp;</li>\n<li>Denial-of-Service through service crashes</li>\n</ul>"},{"id":142187,"day":"Tuesday","time":"14:40 - 15:10","location":"Stage 3","name":"Generate Customer Journeys from reusable Building Blocks","speaker":"Jochen Supper, Tobias Siebert","info":"<p>We started with the goal to generate customer journeys (Angular web apps) targeted for different markets, use cases and products. On the technical side we wanted to provide a catalogue of reusable Building Blocks, that can be shared across teams and implemented independently.&nbsp;</p>\n<p>The ingredients you will learn about here are: how we use Angular Schematics to create whole apps, how we use Building Blocks as our modular lego bricks and how we glue all of this together through configurations.</p>\n<p>The result is a highly configurable Angular app, that can be adjusted to different markets and use cases. To enable this we had to essentially dissemble all pieces that a production app requires and piece them back together through configurations, Building Blocks and plugins.&nbsp;</p>\n<p>Although this platform contains numerous features and capabilities, the end result is always the same: a normal Angular app. In this talk we will take you through the concepts, the implementation and some examples of our platform.</p>"},{"id":142176,"day":"Tuesday","time":"14:55 - 15:40","location":"Stage 4","name":"Developer Relations - Speaking the Language of Developers","speaker":"Ivan Burazin, Stefania Chaplin, Marc Backes","info":""},{"id":142189,"day":"Tuesday","time":"14:55 - 15:25","location":"Stage 1","name":"Kubernetes and Microservices with Multi-Model Databases","speaker":"Wei Hu","info":"<p>Kubernetes and Microservices are important technologies for developing and deploying applications. In this talk, we will describe how a multi-model database such as Oracle is embracing and extending Kubernetes to enable developers to build mission-critical applications on these technologies.</p>\n<p>We will also describe how to best leverage the capabilities of a multi-model database such as Oracle to implement popular microservices patterns (such as Event Sourcing, Transactional Outbox, Idempotent, etc.).</p>\n<p>This talk will cover both what is in the current database release as well as a sneak peek at what is coming soon.</p>"},{"id":142190,"day":"Tuesday","time":"14:55 - 15:25","location":"Stage 2","name":"What is relational learning and why does it matter?","speaker":"Alexander Uhlig","info":"<p>Machine learning algorithms require fixed-size feature vectors. It is why modern deep learning architectures deliver sensational results on audio, vision, and language but fail on relational data. The only way out is feature engineering.</p>\n<p>Unfortunately, manual feature engineering requires a lot of SQL code and takes up to 90% of a project's time. In this talk, I want to introduce you to the domain of relational learning.</p>\n<p>Attendees will learn how to build end-to-end prediction pipelines on relational data using algorithms for automated feature engineering.</p>"},{"id":142191,"day":"Tuesday","time":"14:55 - 15:25","location":"Microstage 1","name":"CNDM Day - Make Your Data FABulous","speaker":"Philipp Krenn","info":"<p>The CAP theorem is widely known for distributed systems, but it&rsquo;s not the only tradeoff you should be aware of. For datastores there is also the FAB theory and just like with the CAP theorem you can only pick two: Fast: Results are real-time or near real-time instead of batch oriented. Accurate: Answers are exact and don&rsquo;t have a margin of error.</p>\n<p>Big: You require horizontal scaling and need to distribute your data. While Fast and Big are relatively easy to understand, Accurate is a bit harder to picture.&nbsp;</p>\n<p>This talk shows some concrete examples of accuracy tradeoffs Elasticsearch can take for terms aggregations, cardinality aggregations with HyperLogLog++, and the IDF part of full-text search.&nbsp;</p>\n<p>Or how to trade some speed or the distribution for more accuracy.</p>"},{"id":146471,"day":"Tuesday","time":"15:00 - 15:30","location":"Mainstage","name":"Blockchains are Dumb","speaker":"Jonan Scheffler","info":"<p>Humans are pretty terrible. We've done awful things in the pursuit of power, developing systems and technologies that oppress and exploit in an attempt to make progress.</p>\n<p>We're certainly moving somewhere quickly, but that doesn't necessarily imply forward motion. We need to think carefully about the technologies we build as they have at least as much opportunity to perpetuate harm as they do to overcome it.</p>\n<p>Just because we can doesn't mean we should.</p>\n<p>We'll briefly discuss human systems and use that insight to inform our exploration of the technical details in blockchain ecosystems. That will enable us to collectively assess their value to human society, if they have any at all.</p>\n<p>By the end of our adventures you will be well prepared to make your own decisions on the technical merits of these decentralized protocols.</p>\n<p>Our opinions as developers can potentially impact the lives of thousands and we owe it to ourselves to make informed decisions. Seek first to understand.</p>"},{"id":142402,"day":"Tuesday","time":"15:00 - 16:00","location":"Workshops M7","name":"Building an app in 30 minutes","speaker":"Tim Cadenbach","info":"<p>In this session i'd like to demonstrate how recent tools can be used to build a fully working app in 30 minutes.</p>\n<p>Based on Vue, AdaptiveCards, Hasura and .Net Core we'll use some of the best of whats currently available for developers speed up your development process while also improving maintainability and even adding a few nice dynamic customization features for your users.</p>\n<p>We'll setup all necessary things together, walk through the steps needed to build and deploy the app and have a fully working app example at the end.</p>"},{"id":142192,"day":"Tuesday","time":"15:00 - 15:45","location":"Panorama Stage","name":"Beyond Micro Frontends: Frontend-Moduliths with Nx","speaker":"Manfred Steyer","info":"<p>Micro Frontends are not the only solution, nor are they suitable in all scenarios. In this session, I will present an alternative architecture approach that we have used successfully in numerous projects over the last few years: the Frontend Modulith. We discuss dividing your application into manageable parts, mapping your business domains, categorizing libraries, and then defining access restrictions to enforce your intended front-end architecture.</p>\n<p>You also see how you can drastically improve the performance of your CI process with incremental builds and tests as well as with local and distributed build caches.&nbsp;</p>\n<p>The examples use Nx, a tool created by former Google employees to help with building structured enterprise applications using Angular, React, Vue, and other frameworks.&nbsp;</p>\n<p>By the end, you will know if frontend moduliths are the right approach for you and how to build your Angular applications with them.</p>"},{"id":142193,"day":"Tuesday","time":"15:00 - 17:00","location":"Workshops M4","name":"High-performing, editor-friendly web apps with incremental static regeneration","speaker":"Roman Zabeida","info":"<p>Modern, content-heavy web applications which are powered by content management systems (CMS) need to balance the need for high page performance with the content editors' demands for a seamless and quick publishing experience.</p>\n<p>In this workshop, participants will how to combine the GraphQL API of Contentful, a headless content management system (CMS), with Next.js's incremental static regeneration (ISR) feature in order to balance the advantages of high performance offered by static site generation with the ability for content editors to publish changes in no time.</p>"},{"id":142195,"day":"Tuesday","time":"15:00 - 17:00","location":"Workshops M3","name":"How to make your automated testing suck less","speaker":"Julia Reinhold","info":"<p>Tests come in various forms unit, integration and E2E. Which one should you use? High test coverage by automation enables you to release stable in higher frequency. In this live coding session, we test a web application with automated unit, component, screenshot, integration, api and e2e tests.</p>\n<p>We then run these tests in a continuous integration environment with usable test reports.&nbsp;</p>\n<p>We explain&nbsp;</p>\n<ul>\n<li>which test technique is relevant at which abstraction level&nbsp;</li>\n<li>best practices&nbsp;</li>\n<li>pitfalls to avoid&nbsp;</li>\n</ul>\n<p>In the end, we hope you have as much fun with testing as we do!</p>"},{"id":142196,"day":"Tuesday","time":"15:00 - 17:00","location":"Workshops M2","name":"Bridging gaps between apps - Leading edge application integration with MuleSoft Anypoint Platform","speaker":"Frank Zechert, Catharina Bauch, Imad El Miri","info":"<p>Together with Capgemini IT-Experts in developing and UX/UI designing you will put your hands on MuleSoft Anypoint Platform implementing a sleek, interactive chat program in this Low Code Platform.</p>\n<p>After a short introduction to MuleSoft we will follow the API-led approach and design an API specification, implement APIs of the chat application in a Low-Code environment, and test it out.&nbsp;</p>\n<p>As a result you will learn how to empower IT and business teams, gather insights in creating digital experiences, products, and services.</p>"},{"id":142197,"day":"Tuesday","time":"15:00 - 17:00","location":"Workshops M5","name":"Splitting the monolith with zero downtime","speaker":"Vasily Kirilichev, Andrii Polishchuk, Martin Moore","info":"<p>As a hyper growth startup, we grow very fast in terms of customer base as well as an organisation. In the days of a Kreuzberg apartment coding a few services were enough to cover our basic needs but as we grew to have more than 150 engineers and millions of customers, the need to break those old services became a necessity.</p>\n<p>As a fintech operating in a heavily regulated area, we need to provide stellar service to our customers without interruptions. These conditions can make splitting the monolith a really challenging task. In this session we will try to share our experience of how we did it, how we do it now and what learnings we got from it.</p>"},{"id":142198,"day":"Tuesday","time":"15:10 - 15:40","location":"Stage 5","name":"ZEISS & Microsoft - Building the Next Generation Medical Ecosystem in the Cloud","speaker":"Leo Lindhorst","info":"<p>Based on a multi-decade long experience in producing industry leading medical instruments and devices, ZEISS recently announced to launch a digital ecosystem for medical data and clinical workflows that should enable new ways to maximize clinical efficiency and performance.&nbsp;</p>\n<p>By developing a cloud-based digital platform for Health data, ZEISS will connect connecting devices, data and applications to streamline workflow, clinical planning, education, and the optimization of clinical procedures.</p>\n<p>To accelerate the journey, ZEISS is partnering with Microsoft as the technology provider for the cloud-based digital services. As Microsoft is currently heavily investing into their portfolio of Healthcare solutions on the Azure Platform and is releasing new Platform Services for medical solutions, ZEISS and Microsoft decided to join forces, by co-creating the Healthcare Services on Azure, while piloting them in the ZEISS Medical Ecosystem.&nbsp;</p>\n<p>For that the Software Development Teams of ZEISS and Microsoft teamed up, to test latest developments in the Azure Platform, discuss feedback from the field and solve the toughest challenged jointly. This talk will show how ZEISS is developing the Medical Ecosystem, how latest Microsoft technologies can accelerate the development of a cloud platform got Health data and how the Teams of ZEISS and Microsoft collaborated to shape the Azure Platform for Healthcare solutions.</p>"},{"id":142384,"day":"Tuesday","time":"15:15 - 16:00","location":"Virtual Only Track","name":"CrateDB: A Database or a Search Engine? Both!","speaker":"Marija Selakovic","info":"<p>Do you want to store huge amounts of data and search it in real-time? Do you have unstructured and structured data? Do you want to run distributed joins? Do you want to leverage the power of SQL? If so, let&rsquo;s talk about CrateDB.</p>\n<p>CrateDB is an open-source, distributed SQL database that runs queries on millions of data records daily. It is built for data-intensive analytics with a PostgreSQL interface that runs anywhere, from on-premises to the cloud.&nbsp;</p>\n<p>In this talk, I will give you an introduction to CrateDB, its architecture, and how to make ingestion and analysis of a large amount of data extremely simple and efficient. You will learn how to get all the benefits of traditional databases while utilizing the scalability and efficiency of a distributed search engine.</p>"},{"id":142194,"day":"Tuesday","time":"15:15 - 16:00","location":"Outdoor Airstream","name":"Panel: How to Raise Early-Stage Startup Funding","speaker":"Benjamin Ruschin, Mark Kaslatter, Leopold Lerach, Mor Eini, Jonas Sommer","info":""},{"id":142199,"day":"Tuesday","time":"15:15 - 16:00","location":"Stage 3","name":"Ultra-fast In-Memory Database Apps and Microservices with Java","speaker":"Markus Kett, Christian Kümmel","info":"<p>Modern software applications have to collect, link, and search tons of data - preferably in real-time. Cloud-native microservices are the defacto-standard architecture and the trend is increasingly toward serverless computing. However, conventional databases cannot keep pace and the traditional Java stack is not suited for building cloud-native apps. The biggest challenges are low performance, slow startup time, high memory consumption, disproportionately high administration effort, and skyrocketing cloud costs. Are Java and classic database systems still suited for modern cloud-native and serverless systems?</p>\n<p>In this session, you will learn first of all what cloud-native microservices and serverless actually mean, how these systems basically work, and why the traditional Java stack and conventional database systems are not suited for the cloud. After that, you will learn how you can build ultra-fast, highly available, horizontally scalable, and cost-efficient in-memory database apps and microservice by using the modern Java cloud-native technology stack combining modern serverless platforms.</p>"},{"id":146472,"day":"Tuesday","time":"15:30 - 16:00","location":"Stage 2","name":"MLOps - What’s the deal behind it?","speaker":"Nico Axtmann","info":"<p>While the new advances in AI research are exciting, startups and companies are still struggling with the adoption of machine learning.&nbsp;</p>\n<p>The operationalisation of machine learning remains a key challenge for startups and bigger companies. Fortunately, in recent years there has been a lot of development and movement around the practices, methodologies and tooling that are addressing the needs to build reliable machine learning systems. This new field is called Machine Learning Operations (in short MLOps).</p>\n<p>It&rsquo;s a multidisciplinary field that combines data science, software engineering and devops. In other words MLOps bridges the gap to apply machine learning in the real world.&nbsp;</p>\n<p>Through this talk we explore MLOps and unveil the challenges it solves and why it makes sense for companies to jump on the MLOps train.</p>"},{"id":142201,"day":"Tuesday","time":"15:30 - 16:00","location":"Stage 1","name":"Telemetry without the 'Tool Tax'","speaker":"Ben Greenberg","info":"<p>You want to instrument your application with observability tooling. You understand the benefits of doing so, but when you start investigating you discover a tooling sprawl that makes your head spin. This has been a persistent pain point for engineering teams, and a consistent deterrent to instituting a robust DevOps practice. Open Telemetry (OTel) comes to try and solve that tool tax for your observability needs.</p>\n<p>It is an open source project maintained by the community that radically democratizes your application's metrics, logs and traces, releases you from vendor exclusivity, and reduces your dependencies.&nbsp;</p>\n<p>In this talk, you will learn about the origin story of OTel, and how to transform your tool sprawl into a focused funnel of data powering your DevOps practice.</p>"},{"id":142202,"day":"Tuesday","time":"15:30 - 16:00","location":"Microstage 1","name":"CNDM Day - It's all about the Data","speaker":"Michael Cade","info":"<p>Data Management is required across the board when it comes to any platform, we could be talking about Virtualisation, Cloud (IaaS, PaaS, SaaS, etc), Cloud-Native, and Legacy and sometimes all of these platforms are linked together to serve the end-user.</p>\n<p>Data Management consists of many different facets including Backup, Recovery, Migration, and leveraging that data as part of another use case that does not interfere with the production environment. In this session we are going to focus on protecting stateful workloads in your cloud-native Kubernetes environment, the importance of making sure your data services are protected but also the capabilities available to enable easy migration between multiple different Kubernetes clusters and environments. Database not running in Kubernetes?&nbsp;</p>\n<p>That is fine we also have a unique way of being able to protect your data services that reside outside of the Kubernetes cluster. If we have time, we can also touch on the ability to add this to your continuous deployment process to ensure that your data service is also protected before any code change.</p>"},{"id":142204,"day":"Tuesday","time":"15:40 - 16:10","location":"Mainstage","name":"Can CSS recreate Tufte's designs?","speaker":"Håkon Wium Lie","info":"<p>Edward Tufte's beautiful books were an inspiration for creating CSS in 1994. Now, almost 30 years later, CSS has grown to the point where we are able to recreate his designs on screen and in print. Challenges still remain when scaling documents to fit small screens.</p>\n<p>How to you show a sidenote on a mobile phone? Should we still care about bandwidth? Are paper-based books still relevant? If so, what tools does CSS provide for positioning figures, footnotes and page numbers</p>\n<p>This presentation will describe the roots of CSS, and how it has evolved to create beautiful books.</p>"},{"id":142205,"day":"Tuesday","time":"15:45 - 16:15","location":"Microstage 2","name":"Optimize UX and performance through Grafana, Prometheus and Lighthouse","speaker":"Miki Lombardi","info":"<p>At MailUp we always develop to improve. Lighthouse is a tool that allows us to analyze our page and returns important metrics that allow us to operate to optimize performance and UX.&nbsp;</p>\n<p>We have created a tool that, thanks to Docker containers, allows us to quickly analyze our platform and view the data in the Grafana Dashboard.</p>\n<p>In this talk we will analyze our use case, show the architecture behind our software, how we automated the lighthouse test with Puppeteer in a Docker container and AWS Cloud environment.</p>"},{"id":142214,"day":"Tuesday","time":"15:45 - 16:15","location":"Microstage 3","name":"20 Million Txs Per Day: Writing Data to the World Largest PoW Blockchain","speaker":"Kurt Wuckert, Jad Wahab, Liam Missin","info":"<p>Most of the transactions committed to the BSV Blockchain over the last few years have been submitted in order to timestamp immutable data. Why are businesses doing this? How has it been possible without the network grinding to a halt? At what point will we hit capacity with respect to future growth? Infrastructure providers and protocol engineers walk us through the story to explain how and why it&rsquo;s done.</p>"},{"id":142213,"day":"Tuesday","time":"15:50 - 16:35","location":"Stage 5","name":"How Gatsby Cloud's real-time streaming architecture drives <5 second builds","speaker":"Kyle Mathews","info":"<p>Gatsby Cloud has applied the ideas from real-time streaming architectures like Spark to websites. Traditional static site generators follow a batch processing model which means websites that need fast updates must turn to traditional SSR and lose the benefits of static sites (atomic deploys, easy caching, fast sites). The popular belief is there's a fixed dichotomy between SSGs and SSR where SSGs are great for sites you don't update often but SSR is required for sites with dynamic updates.</p>\n<p>Gatsby Cloud challenges this dichotomy by offering a new and third way to update websites with its real-time streaming architecture which gives you atomic deploys with most builds well under 10s. This session will be a deep-dive by the founder of Gatsby into how Gatsby Cloud's streaming architecture works and how Gatsby enables software teams to repeatedly ship high quality, low maintenance headless CMS websites.</p>"},{"id":142231,"day":"Tuesday","time":"15:50 - 16:35","location":"Stage 4","name":"It’s all about the domain, honey ! Experiences from 15 years of Domain-Driven Design","speaker":"Carola Lilienthal","info":"<p>Great technologies, programming languages and tools are used when building software. That is good and right. But unfortunately, it is often lost sight of the fact that the decisive factor is not the technology, but the *business domain*. If we do not map the domain language and the business processes in the software, then it will not help our users in their work. No technology in the world can protect us from this. In this talk, I'll show you how you can identify problems in an existing legacy system that could be solved with Domain-Driven Design. We will see problems such as: large entities that are used all over the system, how we could divide them into smaller entities according to the business domain and how we should cut the source code into bounded contexts. All this will be done with many examples from analysis tools that help us to see the system on the level above the source code.</p>"},{"id":142215,"day":"Tuesday","time":"16:00 - 16:45","location":"Panorama Stage","name":"Making of paint.js.org—a Web Component-based Productivity PWA","speaker":"Christian Liebel","info":"<p>Progressive Web Apps and the new powerful web APIs provided by Project Fugu allow developers to implement desktop-class productivity apps using web technologies. In this session, Thinktecture's Christian Liebel shows you the critical parts of how paint.js.org was made, a remake of the productivity app dinosaur Microsoft Paint.</p>\n<p>It runs great as a standalone application, and since it is based on Web Components, it can even be embedded into other applications. And since everything is web-based, it runs on all operating systems, desktop or mobile, not just Windows 95.</p>"},{"id":142217,"day":"Tuesday","time":"16:05 - 16:35","location":"Stage 3","name":"One-click-to-production: Test and automate your application","speaker":"Bartosz Pietrucha","info":"<p>Learn how to cover your web application with full-stack tests and automate the process to improve the quality and speed of your work. Understand the different perspectives of testing, like unit, integration, and end-to-end in the modern web, both on the front-end and the back-end side.&nbsp;</p>\n<p>Build automation pipelines with GitHub actions and set up quality gates to establish a robust Continuous Integration and Continuous Delivery workflow.</p>\n<p>Catch security bugs and code smells before they land in the production environment. Deploy your application with peace of mind with just one click.</p>"},{"id":142218,"day":"Tuesday","time":"16:05 - 16:35","location":"Stage 2","name":"In the Dawn of the AI: Understanding and implementing AI-generated images","speaker":"Timo Zander","info":"<p>Machine Learning and Artificial Intelligence are surely some of the most headline-catching topics in IT, achieving stunning technological progress within the last decades.&nbsp;</p>\n<p>One of their various applications, creating fake images, not only creates societal discussions and political issues, but also leads to an interesting question:</p>\n<p>How is it actually made and how easy can you do it by yourself?&nbsp;</p>\n<p>You will be guided through the basic math required for this field of computer science (without previous knowledge above high school level required), learn about how Generative Adversarial Networks are designed in concept and see how to implement different GANs on your own using standard libraries.&nbsp;</p>\n<p>Based on different papers, the presented applications range from generating fake celebrities to creating stunning vistas from your hand-drawn sketches.</p>"},{"id":142219,"day":"Tuesday","time":"16:05 - 16:35","location":"Stage 1","name":"Keep your code refactorable","speaker":"Gerrit Stapper","info":"<p>In our fast-moving world of software development, requirements, opportunities, options, languages and skills are constantly changing and software must be ready to go along &ndash; otherwise it will be old and buggy before it is released. Thinking code refactoring not only as reducing technical debt, but also to place the much-needed agility at the core of our software, can lead to faster reaction times, higher software quality, better collaboration and closer fit with the requirements. Let&rsquo;s talk about three tools we as developers have at hand to create and keep our code refactorable</p>"},{"id":142220,"day":"Tuesday","time":"16:10 - 16:40","location":"Microstage 1","name":"Non-violent communication in agile teams","speaker":"Alexandre Borges","info":"<p>In this talk, I provide compiled thoughts about non-violent communication in a work-day with an agile team, where I point moments, situations, and ways to improve the team's accountability by creating a safe environment. Also, give a \"tool\" to be used for everyone. This talk is about connecting people around only one goal, solving the problems in an effective way, removing assumptions, understanding the intentions behind our requests, and a build a clear path to express our message to the whole team.</p>"},{"id":146322,"day":"Tuesday","time":"16:10 - 16:50","location":"Virtual Only Track","name":"IoT, JavaScript and Beer Brewing: Cheers to that!","speaker":"Joel Lord","info":"<p>Beer brewing can be fun, but combining brewing with IoT device hacking is even more fun. It is possible to connect and collect data about almost anything, including the fermentation process inside a closed fermenter using open source technologies. In this presentation, the speaker will introduce basic concepts of IoT devices, how to collect the data efficiently and how to use various tools to store, extract and manipulate that data. And if you&rsquo;re new to beer brewing, don&rsquo;t worry; you will also learn a thing or two about that as well!</p>"},{"id":142290,"day":"Tuesday","time":"16:10 - 16:55","location":"Virtual Only Track","name":"Design Data-Driven Polyglot Microservices, The Easy Way","speaker":"Paul Parkinson, Kuassi Mensah","info":"<p>In this session you will learn how to develop Data-Driven microservices using your favorite programming language (Java, JavaScript, Python, .NET, and Go), your favorite framework including Springboot, Micronaut, Eclipse MicroProfile (Quarkus, Helidon) in detail then quickly Django, Flask, React, Express, &hellip;), and your favorite data model (including relational, JSON, Text, Graph, Spatial, and so on). The session also discusses how to simplify polyglot data access in a Cloud Native microservices environment (Kubernetes, &hellip;), the related patterns (bounded contexts, event sourcing, CQRS, &hellip;), and finally, how to simplify transactions across microservices (LRA, Saga). Examples and references to related code and workshops will also be given.</p>"},{"id":142221,"day":"Tuesday","time":"16:20 - 17:05","location":"Mainstage","name":"Wolfenstein 3D Postmortem","speaker":"John Romero","info":"<p>In early 1992, id Software had just shipped their latest 2D platform games and were ready for something different. Having released the first texture-mapped 3D shooter, Catacomb 3D, just a couple months earlier, they were planning what their next project would be. Wolfenstein 3D was an ambitious design for an MS-DOS PC in 1992. There were no GPUs, most games were 320x200 pixels, a lot of memory was 4GB, and mice were rarely used.</p>\n<p>Follow the journey that the four founders of id Software took to create a watershed moment in gaming history that showed the world that the PC could play a new kind of game that no other machine could replicate. Game designer, programmer, and id Software co-founder, John Romero, will take the audience through this short seven month timeline and show you just how much happened during Wolfenstein 3D's development rollercoaster ride.</p>"},{"id":142222,"day":"Tuesday","time":"16:20 - 16:50","location":"Microstage 3","name":"Bitcoin is a Turing Complete System On Which You Can Build Smart Contracts and Issue Tokens","speaker":"Xiaohui Liu, Darren Kellenschwiler, Robin Kohze","info":"<p>A common misconception is that alternative systems are required to expand the capabilities of the Bitcoin protocol beyond simple transfers. We demonstrate that building smart contracts and issuing tokens on BitcoinSV is not only simple, but extremely cost effective. Unrolling loops, and iterating over payment channels, we put the topic to rest, and investigate the future possibilities.</p>"},{"id":142398,"day":"Tuesday","time":"16:30 - 17:15","location":"Outdoor Airstream","name":"The Era of Linkedin Influencers and How I Became One","speaker":"Dragan Petric","info":"<p>With Facebook and Instagram being challenged by modern networks such as TikTok as platforms for B2C influencer marketing, Linkedin has &ndash; finally &ndash; grown into perfect platform for a new type of influencers, those who operate on B2B level. A thousand likes for a post published by a network owner with a few hundred C-level connections is worth a lot more than tens of a thousand likes for a post by a movie or music star with a million teen followers. With more than 10,000 followers on Linkedin - mostly founders and CEOs of ICT companies, but also developers and other engineers and decision makers - I became the leading B2B tech influencer in the region. Through this session I will explain how to build your personal brand and become recognizable as the greatest expert in your niche on Liknkedin.</p>"},{"id":146784,"day":"Tuesday","time":"16:30 - 17:30","location":"Microstage 2","name":"Senior after six years, what's next?","speaker":"Hugo Lassiège, Dimitri Baeli","info":"<p>The recurring subject in IT: if you are a senior with 6 years of experience, what is the next step? Do you have to become a manager to progress?&nbsp;</p>\n<p>In this session, you will discover the roles of Staff Engineer, Principal Engineer, Fellow, Distinguished and the notion of impact that accompanies these roles. We also hope to make you think about the notion of leadership in your professions, your teams, your products and the company.</p>"},{"id":142223,"day":"Tuesday","time":"16:40 - 17:10","location":"Stage 5","name":"The Software Bug All Stars - and what we can learn from them","speaker":"Christian Seifert","info":"<p>No piece of software is perfect. Everyone of us has experience his or her own personal \"How the hell could this happen?\" moment. Some bugs and their consequences even make it to the headlines of big newspapers.</p>\n<p>This talk will present some of these \"all stars\" as it's always nice to hear about the mishaps of others.&nbsp;</p>\n<p>But we will also go one step further and ask ourselves what we can learn from them. What decisions and actions lead to these bugs and look for lessons learned that will help us in our daily work to avoid running into the same pitfalls.</p>"},{"id":142224,"day":"Tuesday","time":"16:40 - 17:10","location":"Stage 1","name":"But, you're not Facebook","speaker":"Kitze Ristovski","info":"<p>The main takeaway of the talk is to stop solving problems that are already solved or problems that don't exist. In this funny talk I'm taking a look at the state of our industry and how most frontend developers are focused on the wrong things, looking at the wrong metrics, and optimizing for an imaginary userbase.</p>\n<p>I'm pointing this out through a bunch of eye-opening examples, with the hopes that the developers in the audience will realize what they're doing and will stop spending time on things that don't matter.</p>"},{"id":142225,"day":"Tuesday","time":"16:40 - 17:10","location":"Stage 4","name":"The Data Mesh: Revolution in Data Handling","speaker":"Mario Meir-Huber","info":"<p>In the last 2 years, one trend emerged out of the data engineering field: the concept of the data mesh. It is considered to be a revolution for handling data. But what exactly is the data mesh, how is it different from previous data-handling approaches and what problems will it solve?</p>\n<p>Listen to this talk to learn more about the architectural guidelines and how to apply them in projects.</p>"},{"id":142226,"day":"Tuesday","time":"16:40 - 17:10","location":"Stage 3","name":"The What, Why, Who and How of accessibility on the web","speaker":"Konstantin Tieber","info":"<p>Every little accessibility improvement can have an impact, it doesn't have to be perfect, but we have to start at some point. Let's shift accessibility to the left of our product design process. This session serves as an introduction to accessibility on the web that is easy to understand.</p>\n<p>My goal is to inspire your accessibility learning journey. I will provide you with the resources and tools to build more accessible frontends while answering the most basic questions of \"What, Why, Who and How\".</p>"},{"id":142227,"day":"Tuesday","time":"16:40 - 17:10","location":"Stage 2","name":"DALL·E Flow: when neural search meets generative art","speaker":"Han Xiao","info":"<p>Neural search - the technology of using deep learning to search unstructured data, has developed rapidly in the last two years.&nbsp;</p>\n<p>With a framework like Jina (https://github.com/jina-ai/jina), searching cross-modal/multi-modal data via deep neural networks becomes extremely straightforward. DALL&middot;E, a powerful image-to-text generator released by OpenAI in 2021 further boosts the popularity of multimodal applications.&nbsp;</p>\n<p>We now see thousands of astonishing artwork made by DALL&middot;E every day. How all these new technologies will change the way of comprehending multi-/cross modal data?</p>"},{"id":142228,"day":"Tuesday","time":"16:45 - 17:45","location":"Microstage 1","name":"Autism in Tech","speaker":"Dennie Declercq","info":"<p>Are all software developers the same? Do all software developers make the same choices? Or are some of them having more worries or just think in a unique way? Yes! of course. There is a group of software developers who are autistic. It can be people with an ASD (Autism Spectrum Disorder) diagnose. But there also a lot of people with autism missing an official diagnose.</p>\n<p>Some people are just fighting more than others for getting things done. In this talk, I try to cover how the tech world is for me, as a person with autism. I am in tech for about 10 years. In fact, sometimes I feel differences between me and other people in tech. Besides my tech roll in life, I am responsible for a self &ndash; a support group of people with autism.</p>"},{"id":142372,"day":"Tuesday","time":"17:00 - 18:00","location":"Virtual Only Track","name":"Do Distributed Systems they said. It'll be fun they said.","speaker":"Sara Pellegrini, Milan Savić","info":"<p>We are all aware of fallacies of distributed computing (https://en.wikipedia.org/wiki/Fallacies_of_distributed_computing). Along side with them, there are other things we should consider as well. At AxonIQ(https://axoniq.io/), one of our core products is Axon Server(https://axoniq.io/product-overview/axon-server) which acts as a Messaging Platform and Event Store. In other words, a system that is by its nature distributed across several machines to be more reliable and scalable. Let's see together what it means to build such a system, how to maintain it in (large variety of our customers') production environments, and lastly, how to offer it as a service in cloud (https://cloud.axoniq.io/). This is a war story, told from trenches, by footsoldiers.</p>"},{"id":142396,"day":"Tuesday","time":"17:00 - 17:35","location":"Virtual Only Track","name":"Building Blockchain dApps using JavaScript","speaker":"Russell Anthony Fustino","info":"<p>Have we found nirvana for Blockchain developers? This session will focus on building blockchain dApps (distributed Apps) with one set of source code and deploy to multiple blockchains! The session will cover getting started with Reach and being able to deploy the same solution to multiple blockchains including Algorand, Ethereum, and Conflux. New to Reach? We will cover how to set up your development environment as well as walk through a simple app frontend and backend.</p>\n<p>Finally, we will look one the huge benefits of Reach in the built-in verification process. Reach provides automatic verifications to ensure that your program does not lose, lock away, or overspend funds and guarantees that your applications are free from this entire category of errors.</p>"},{"id":142229,"day":"Tuesday","time":"17:00 - 17:30","location":"Microstage 3","name":"Building Slack Applications with Bolt.js","speaker":"Alba Rivas","info":"<p>Slack (https://slack.com/) is a messaging app for business that connects people to the information they need. In this talk we&rsquo;ll see how to extend Slack functionality by developing a travel approvals app. We&rsquo;ll use Slack&rsquo;s SDK for Node.js, Bolt.js (https://api.slack.com/tools/bolt).</p>"},{"id":142230,"day":"Tuesday","time":"17:00 - 17:45","location":"Panorama Stage","name":"Langium: Design Your Own Language in Node.js and VS Code","speaker":"Miro Spönemann","info":"<p>I will show how you can easily design and implement your own text language including a compiler CLI and editor support for VS Code. The key ingredient for this is an exciting new open source framework named Langium. We created Langium based on the experience that I and my team at TypeFox have gained about designing programming languages and domain-specific languages over many years.&nbsp;</p>\n<p>Now we are keen on lifting these proven concepts into a new level enabling a much wider audience to make use of them.</p>\n<p>We chose TypeScript and Node.js as platform because it's easy to build CLIs like compilers, transpilers and interpreters, and because it's the basis for VS Code extensions. By integrating with the Language Server Protocol, it's simple to provide the same editor support in other IDEs as well.&nbsp;</p>\n<p>You will learn about language design in general and how you can elegantly solve problems using special-purpose languages. I will demonstrate how to get started with Langium with a few steps.</p>"},{"id":146476,"day":"Tuesday","time":"17:15 - 17:45","location":"Stage 4","name":"Blockchains: One Size doesn't Fit All","speaker":"Gautam Dhameja","info":"<p>Blockchain technology is being used for several different kind of use-cases. These different use-cases represent different kind of users and their interaction patterns. These different use-cases require different optimizations and integration techniques.</p>\n<p>Most of the smart contract platforms treat these use-cases exactly the same because they treat all smart contracts exactly the same. This limits the adoption and scalability of blockchains.</p>\n<p>In this session, we will learn about why different kind of blockchains are needed to solve use-case specific problems, and how Substrate and Polkadot make it possible to build and connect different blockchains.</p>"},{"id":142233,"day":"Tuesday","time":"17:15 - 17:45","location":"Stage 3","name":"From Cultural Heritage to Partying in the MetaVerse","speaker":"Zaid Zaim","info":"<p>Zaid Zaim 21 years old orginally from Syria. He came to Germany 2013 due the War. Today, as an Alumni of ReDI School Digital integration , Microsoft MVP and Mixed Reality Catalyst at Hololux brings Cultural Heritage of destroyed sites like the UNESCO city of Palmyra in Syria back to life with modern Mixed Reality technology.</p>\n<p>In this project, he wants to bring an inclusive dimension and promote more universal access to culture - Diverse volunteers contribute to this mission. I</p>\n<p>n December Zaid realized with the Help of the Tech Community like Hololux and Microsoft to bring the Deutsche Bank celebration Party into the MetaVerse that got a appeal from the participants and audience. Following next was New Years Eve Celebration in the metaverse created by Zaid &amp; fellow MVP Christian as our version of Avatar Pandora. World wide audience joined this Party with more than 250 Attendees.&nbsp;</p>"},{"id":142234,"day":"Tuesday","time":"17:15 - 17:45","location":"Stage 1","name":"Communicate efficiently with Software Architecture Diagrams","speaker":"Simon Lasselsberger","info":"<p>The ultimate goal of any software is to offer a great experience to its users. User interfaces and workflows must be clear, self-explanatory, and appealing. Software documentation should have a similar goal. Comprehensive diagrams that visualize ideas and concepts clearly are mandatory to do that.</p>\n<p>If you communicate solely via text (written or spoken) people will lose focus quickly and have a hard time remembering your thoughts. I am going to show how to create beautiful diagrams with the right level of detail, to communicate efficiently with other software professionals and stakeholders.</p>"},{"id":142235,"day":"Tuesday","time":"17:15 - 17:45","location":"Stage 2","name":"The Billion Dollar Machine: First Time Right.","speaker":"Dr. Andreas Kaldun","info":"<p>Today, every high-end CPU and, in fact, 80% of all microchips worldwide are made on ASML/ZEISS lithography machines. We tell the story of how passionate hard-and software developers formed a team and enabled the walkthrough of high-performance chip manufacturing.</p>\n<p>In this story you will learn about the tricks and knacks used to get the foundation of the next chip revolution right on the first try &ndash; our one-billion dollar project to build the world most precise machine.</p>"},{"id":142236,"day":"Tuesday","time":"17:15 - 17:45","location":"Mainstage","name":"A walkthrough on Responsible AI Frameworks and Case Studies","speaker":"Toju Duke","info":"<p>AI is fundamental, groundbreaking technology with an adoption rate of 64% year over year. Along with its innovative and transformational abilities comes challenges on ethics and responsibility. If AI/ML systems are developed without responsible and ethical frameworks, they have the propensity to deploy harm amongst individuals within society.</p>\n<p>It is the responsibility of every individual and organisation developing AI models, to have a Responsible framework they adhere to which is accountable, fair, transparent and safe. In this talk, you&rsquo;d learn how to approach Responsible AI, best practices for AI frameworks and relevant case studies.</p>"},{"id":142237,"day":"Tuesday","time":"17:15 - 17:45","location":"Stage 5","name":"Secure Code Superstars: Empowering Developers and Surpassing Security Challenges Together ","speaker":"Stefania Chaplin","info":"<p>To0 many developers, security can be a treacherous territory. Recurring bugs and context switching can lead to burnout. As we work together to deliver better products faster, how can we empower developers and help them become Secure Code Superstars? In order to empower our developers, we must surpass common obstacles. How do we empower our developers to acquire a foundation of security knowledge?&nbsp;</p>\n<p>To ensure that developers, security and operations are working together and using a common language? As recurring bugs and context switching become common pain points, how can we look at using empathy while addressing the problem not the person? To merge both a holistic and technical approach to the workplace? We will look in more detail at technical tools such as OWASP (Open Web Application Security Project) and its many resources, but also how to prioritize time to learn, upskill and to take a step back from the computer and look at how aspects outside of coding will increase productivity and reduce problems in security.</p>"},{"id":142385,"day":"Wednesday","time":"9:00 - 10:00","location":"Workshops M6","name":"Become your CISOs best friend and still write great code","speaker":"Stephan Kraft","info":"<p>As a software developer you want 3 things: you want to code, you want to develop great software... and finally, you want to code great software.&nbsp;</p>\n<p>Of course, you do understand that security is important as neither the world, nor the internet is a safe place. But if you follow all the guidelines of your CISO, you are handcuffed. The good news: There is a way to write great code AND become your CISOs almost best friend.</p>\n<p>Enter OpenID Connect, oAuth, API Management and Keycloak.&nbsp;</p>\n<p>In this live demo, we will show how an entirely unprotected web application can be secured against internal and external threats. The live demo consists of a role play of the bad (hacker) guy and the good guy who comes to the rescue of the developer.&nbsp;</p>\n<p>An epic battle. And a spoiler: The good will win.</p>"},{"id":142386,"day":"Wednesday","time":"9:00 - 9:30","location":"Microstage 2","name":"LaserSKI: Object detection for semiconductor defects","speaker":"William Clemens","info":"<p>Quality control in photonics requires detailed manual examination of microscopy images. In this project we aim to automate the inspection of wafers for diode lasers. To solve this we have been developing FasterRCNN object detection models to automate this process in pytorch.</p>\n<p>A single core architecture is used that is then fine tuned on each of the sub problems. The end result is a set of pipelines that can automatically locate and classify defects so that their severity can be estimated by a rule based post processing step.</p>"},{"id":142413,"day":"Wednesday","time":"9:00 - 9:30","location":"Microstage 3","name":"Build your backend using FastAPI","speaker":"Ashmi Banerjee","info":"<p>In this talk we will discuss about building the backend for a web-application using Python and FastAPI. FastAPI is a modern, fast (high-performance), web framework used for building APIs with Python. The session will highlight performing simple CRUD operations using the different endpoints of the API and testing them using pytest.</p>\n<p>It will focus not only on the concepts but also emphasise on some of the software engineering best practices (patterns and anti-patterns) required to excel in web-development.</p>"},{"id":142425,"day":"Wednesday","time":"9:00 - 9:25","location":"Virtual Only Track","name":"From ground zero to a fully structured development team","speaker":"Martynas Paškauskas","info":"<p>From almost having no developers to talk about to building a global software development team. How did we manage it? I&rsquo;ll tell you! Was it hard? Yes! Did I cut some corners?</p>\n<p>Of course! I&rsquo;ll be presenting the structure of our software development team - the thing&rsquo;s that work and those that need to be adjusted.&nbsp;</p>\n<p>Also, the know-how of building a future-proof solution without copying other methodologies. Explanation of different roles, processes, and other tips and tricks will be disclosed as well with real-life examples.</p>"},{"id":142240,"day":"Wednesday","time":"9:00 - 9:45","location":"Stage 3","name":"Future-Proof CSS","speaker":"Ire Aderinokun","info":"<p>The concept of &ldquo;not breaking the web&rdquo; is one of its oldest and most foundational. When we build a web page, we do it knowing that it could theoretically last as long as the internet itself. The CSS we write today is, or should be, future-proof.</p>\n<p>But how will your CSS hold up in 10, 50, or even 100 years? In this talk, we&rsquo;ll cover how to write CSS that stands the test of time.&nbsp;</p>\n<p>From progressive enhancement techniques to accessibility considerations, we&rsquo;ll learn how to write CSS for 100 years in the future (and, of course, today).</p>"},{"id":142241,"day":"Wednesday","time":"9:00 - 9:45","location":"Microstage 1","name":"Writing a full-text search engine in TypeScript","speaker":"Michele Riva","info":"<p>Have you ever wondered how full-text search engines such as ElasticSearch or Algolia works? Let's find out! In this talk, we will build a RESTful full-text search engine from scratch, understanding how to choose the right algorithms and data structures for accomplishing such a task.</p>\n<p>By the end of the talk, you will see how to maintain incredibly high performances while working with a massive amount of data and understand why it is so important to choose the right algorithm or data structure for accomplishing such tasks.</p>"},{"id":142242,"day":"Wednesday","time":"9:00 - 9:30","location":"Stage 2","name":"Developer Tools for Microsoft Azure","speaker":"Radu Vunvulea","info":"<p>During this session, we&rsquo;ll take a look at the proactivity tools that can be used to improve our development experience on Azure. We&rsquo;ll talk about tools from multiple areas like storage, computation, automation, cleaning and many more. All of them are free to use, build by the Azure community or Microsoft to improve the cloud experience.</p>\n<p>The impact on our day to day life can be improved drastically when we use the right tools. We coved tools that can be used for storage, computation and real-time monitoring and debugging.</p>"},{"id":142243,"day":"Wednesday","time":"9:00 - 9:45","location":"Stage 5","name":"Design as an algorithm, not as a feature","speaker":"Kaya Sohyun Kim","info":"<p>Disruptive changes in automobile industry through IT and how Volkswagen Group handles &amp; embrace A.I. technologies, big-data driven innovations. Design role and product development process through an actual product example.</p>"},{"id":142244,"day":"Wednesday","time":"9:00 - 9:45","location":"Panorama Stage","name":"Stairway to Heaven - Scaling Frontends the Right Way","speaker":"Florian Rappl","info":"<p>Web frontend projects tend to become larger and larger with multiple teams working on one application. The problem becomes even more severe with the requirement of including functionality from multiple domains - right now or at some point later on.</p>\n<p>To scale the development well the micro frontend architecture has been proven successful. But where to start here?&nbsp;</p>\n<p>In this talk micro frontend expert Florian Rappl will give you insights from dozens of successful micro frontend implementations. He will create a scalable solution on stage with you in the first row. Get to know the best practices and see how your next big frontend project can evolve without boundaries.</p>"},{"id":142245,"day":"Wednesday","time":"9:00 - 9:30","location":"Outdoor Airstream","name":"What can I do about climate change as a developer... and a human being?","speaker":"Julien Lengrand-Lambert","info":"<p>We are all well aware of it : the current trend of climate change is not looking great. We can already feel some of its consequences and it is very likely to only become worse. Tech is driving the world though, and us developers can surely help make an impact to bend the curve.&nbsp;</p>\n<p>So let's dive into the topic together and see how we can debug it! In this talk, we will look into the current situation, globally but also in the tech space. We will dive into the impact that we can make on our applications as developers.</p>\n<p>We will start by talking about our technical stack and what we can do to improve it, from reactive architectures to web performance. We will run the numbers and see the kind of improvements we can reach there. But we will also look into the larger perspective of things, and look closer at our own personal footprint. The future may look uncertain, but we can all start making a difference today and look at things in a positive way. So let's debug!</p>"},{"id":142246,"day":"Wednesday","time":"9:00 - 9:45","location":"Stage 4","name":"Quality Strategy with a side of Swiss Cheese","speaker":"Sarah Hutchins","info":"<p>The Swiss Cheese model is a risk avoidance strategy using often in the airline and healthcare industries. It assigns responsibility to different layers &mdash; with issues falling through the &lsquo;holes&rsquo; of Swiss Cheese.</p>\n<p>While it allows companies in the airline and health industries to see which layer are succeeding, it can help tech companies think strategically about Quality, rather than only focusing only on test units being faster and more reliable.&nbsp;</p>\n<p>Expect to learn what the Swiss Cheese model is, how to apply it in the software industry, and what to do when bugs still fall through the holes (hint: it doesn&rsquo;t involve your customer support team).</p>"},{"id":142247,"day":"Wednesday","time":"9:00 - 9:45","location":"Stage 1","name":"Treat yourself - A tale about dog training and test-driven development","speaker":"Mirjam Aulbach","info":"<p>Before I started my career in software development, I worked for many years as a dog trainer. The experiences I made in this time are the reason why I immediately fell in love with testing. So, let&rsquo;s talk about TDD!&nbsp;</p>\n<p>TDD stand for Test-driven development and it&rsquo;s not only a technique to write tests but also a design process in software development.</p>\n<p>I want to give you a new perspective on this process and explain how to TDD with the help of comparing it to how to train a dog. TDD has much in common with dogtraining, so at the end of my talk you should be able to write a piece of c test driven code, and also teach a dog a little trick - well, the last thing at least theoretically.</p>"},{"id":142248,"day":"Wednesday","time":"9:00 - 10:00","location":"Mainstage","name":"The Design and Evolution of C++","speaker":"Bjarne Stroustrup","info":"<p>Over the decades, C++ has evolved from a few key ideas to a comprehensive set of facilities supported by multiple compilers, tools for a wide range of uses, and thousands of libraries. It is available on essentially all platforms and used in essentially every country and industry.</p>\n<p>What are the key ideas and design principles sustaining C++?</p>\n<p>How did the original ideas evolve and survive 40 years of development and 30 years of attention from a 300+ member standards committee?&nbsp;</p>\n<p>The current ISO standard, C++20, offers major new features (such as modules, concepts, coroutines) and improved support for compile-time programming and concurrency.</p>"},{"id":142249,"day":"Wednesday","time":"9:00 - 11:00","location":"Workshops M4","name":"Experimentation after the Cookie-Reckoning","speaker":"Tim Klausmann, Eike Pierstorff","info":"<p>In experimentation on web platforms, privacy legislation like the EU ePrivacy directive will make it harder to assign users to variations and evaluate their behaviour.&nbsp;</p>\n<p>However, digital product development without experimentation would lack both direction and scientific rigour. We want to briefly touch upon the history and value of cookies, the technology behind most experimentation toolkits today.</p>\n<p>Then we will discuss the technical and political dimensions connected to the current drive for more privacy. With any luck, we will emerge from this workshop with ideas on how to reconcile obtaining insights via experiments with respecting user's privacy.</p>"},{"id":142369,"day":"Wednesday","time":"9:30 - 11:30","location":"Workshops M7","name":"Building cross-platform apps with Uno Platform","speaker":"Martin Zikmund","info":"<p>Uno Platform is a unique framework, which allows .NET developers to create single codebase cross-platform applications that target all mobile and desktop devices and even the web.</p>\n<p>In this workshop we will introduce Uno Platform app development and build our first fully cross-platform app in C# and XAML using Visual Studio 2022. We will also show some basic concepts like adding and styling base controls, handling navigation between application pages, writing platform-specific code and UI, and utilizing device sensors.</p>\n<p>&nbsp;</p>\n<p>Prerequisites: To prepare your developer environment for this workshop, please follow the instructions listed here https://platform.uno/docs/articles/get-started-vs-2022.html</p>\n<p>If you use a Mac, you can also follow instructions here https://platform.uno/docs/articles/get-started-vsmac.html&nbsp;</p>\n<p>Using Windows PC is preferable as it gives access to more Uno Platform target for running your application.</p>"},{"id":142121,"day":"Wednesday","time":"9:30 - 11:30","location":"Workshops M8","name":"Building applications on Bitcoin SV","speaker":"Darren Kellenschwiler, Jad Wahab","info":"<p>Application developers sometimes wrongly assume that running the Bitcoin SV Node software is required in order to interact with the Blockchain. They soon find that as block size increases, validating every transaction on the network becomes an unacceptable expense. During this session we will demonstrate a more efficient architecture designed to scale in proportion to your application&rsquo;s use, rather than the network as a whole.</p>"},{"id":142427,"day":"Wednesday","time":"9:30 - 10:10","location":"Virtual Only Track","name":"PrintCSS: Formatting PDF files with HTML and CSS Paged Media","speaker":"Bernhard Jungwirth","info":"<p>This session is about different techniques to create automated PDF files in business applications with a strong focus on HTML and CSS paged media module. Many developers are faced with the requirement to automatically create individual PDF files for different use cases. For example for invoices, bank statements or vaccination certificates.</p>\n<p>I will give an overview of some libraries for pdf formatting - with a focus on open source tools. Then I will go into more details about XSL-FO and the successor CSS Paged Media.&nbsp;</p>\n<p>In my live session I will show how to create layouts with table of contents, headers and other features of paged documents.</p>"},{"id":145818,"day":"Wednesday","time":"9:30 - 11:30","location":"Workshops M5","name":"Introduction to HashiCorp Vault Hands-On Workshop.","speaker":"Armin Mesic, Sara Asano, Tobias Rupprecht","info":"<p>Join us for overview of the HashiCorp toolset and a Vault hands-on workshop.</p>\n<p>HashiCorp Vault enables enterprises to centrally store, access, and distribute dynamic secrets like tokens, passwords, certificates, and encryption keys across any public or private cloud environment.</p>\n<p>During this workshop, participants will learn how to secure sensitive data with Vault. This is a beginner&rsquo;s workshops and no experience is required.</p>\n<p>What you will need:<br>1) A laptop<br>2) Practical experience with command-line tools is helpful</p>"},{"id":142250,"day":"Wednesday","time":"9:30 - 11:30","location":"Workshops M2","name":"Detect bottlenecks and create solutions by using a knowledge graph","speaker":"Kay Landeck, My Trang Trang Hong","info":"<p>The workshop focuses on breaking down data silos using a knowledge graph to identify alternative solutions and optimise response times. In times of crisis, we are constantly faced with the challenge of leaving our routine and looking for new ways to meet the requirements of customers.</p>\n<p>By creating and analysing a use case, we will illustrate the advantages of using a knowledge graph for the efficient development of new solutions.&nbsp;</p>\n<ul>\n<li>Introduction to graph databases with Neo4j and Cypher&nbsp;</li>\n<li>Modelling of a domain model&nbsp;</li>\n<li>Building a Knowledge Graph&nbsp;</li>\n<li>Analyses to support the solution finding process&nbsp;</li>\n<li>Real World Architecture in Cloud Environment</li>\n</ul>"},{"id":142251,"day":"Wednesday","time":"9:30 - 11:30","location":"Workshops M3","name":"Stranger Danger: Your JavaScript Attack Surface Just Got Bigger","speaker":"Micah Silverman","info":"<p>Building JavaScript applications today means that we take a step further from writing code. We use open-source dependencies, create a Dockerfile to deploy containers to the cloud, and orchestrate this infrastructure with Kubernetes.&nbsp;</p>\n<p>Welcome - you're a cloud native application developer! As developers, our responsibility has broadened, and more software means more software security concerns for us to address.</p>\n<p>Join me for a hands-on JavaScript and cloud native live-hacking session to show common threats, vulnerabilities and misconfigurations.&nbsp;</p>\n<p>Most importantly, I also show how you can protect your application with actionable remediation and best practices for each exploit I demonstrate.</p>"},{"id":142252,"day":"Wednesday","time":"9:35 - 10:05","location":"Stage 2","name":"Asynchronicity and multithreading in C#","speaker":"Grzegorz Lang","info":"<p>Async-await and Task don't need to be so scary and mysterious! In this session you will learn what is asynchronous, multithreading and parallel programming and how it can help you to improve performance of your code, when used correctly, using newest best practices.</p>\n<p>It's easy to misuse those concepts without proper knowledge, and hurt performance. This talk focuses on .NET Core / .NET but most of the content applies to .NET Framework, too. All of it (and more) is covered in my book \"Asynchroniczność i wielowątkowość w C#\".</p>"},{"id":142432,"day":"Wednesday","time":"9:45 - 10:15","location":"Microstage 2","name":"Your privacy, it is just an engineering problem.","speaker":"Adrianus Warmenhoven","info":"<p>Over the last 2 decades, the world has become more connected, more intertwined, than ever. The requirements for each connection are lower than ever; a mobile and a cell-tower within range. Is all.</p>\n<p>The speed of adoption of tech, however, has far outpaced the speed of cultural change that should have accompanied our new abilities. The online any to any connections did not teach us what we have, what we are.&nbsp;</p>\n<p>Our privacy, which used to be protected simply by closing a door behind us, is now a raw resource. To be protected, by tech, by law, but mostly by culture.&nbsp;</p>\n<p>Privacy is not about hiding things, it is about being the one to decide what you share with others, for whatever reason you want. Stripping of privacy is condoned because it makes things cheaper, but mostly, really, mostly because that privacy stripping infra is built. By developers.&nbsp;</p>\n<p>To them, you, your life, your feelings, your heart, your soul, everything you are and everything you have... it is just an engineering problem.</p>"},{"id":142253,"day":"Wednesday","time":"9:45 - 10:15","location":"Microstage 3","name":"Decoding web accessibility through audit","speaker":"Anuradha Kumari","info":"<p>Ever heard about accessibility, and wondered if it some rocket science? Or maybe considered exploring it but abandoned due to overwhelming documentation? Let's debunk all the complexities and myths around web accessibility. We will together explore browser tools and extensions for analyzing and auditing accessibility while looking at how to fix those. Takeaway - You can directly use these tools and tips to access and fix the accessibility of your websites and web applications. Web accessibility won't feel as confusing or burdensome after the session.</p>"},{"id":142255,"day":"Wednesday","time":"9:45 - 10:15","location":"Outdoor Airstream","name":"Get Started With Blockchain For Your Business","speaker":"Michael Ionita [Crypto]","info":"<p>Is the Blockchain any good for your business? Get inspired by existing use-cases and projects. Learn where to find resources.&nbsp;</p>\n<p>Learn how to get started fast (even with No-Code). And ask your questions at the Q&amp;A at the end of the session.</p>\n<p>We will answer these and more questions together: What is it all good for at all? How can you make use of the data storage capabilities of the Blockchain.&nbsp;</p>\n<p>How can you use NFTs and Coins to your advantage? Which tools can you use to get started. Are there No-Code tools (yes there are) :) LFG!</p>"},{"id":142256,"day":"Wednesday","time":"9:50 - 10:35","location":"Stage 3","name":"Extending HTML with Web Components","speaker":"Rowdy Rabouw","info":"<p>The official HTML specification features over 100 native elements you can use to create awesome websites or applications. But what if these are not enough, or you want to make your own implementation of a video tag?</p>\n<p>JavaScript frameworks like Vue, Angular and React offer the tools for creating components, but they are not interchangeable. You will need to build them for every framework, which is cumbersome for organisations with various tech stacks.&nbsp;</p>\n<p>Web Components are framework agnostic. They can be reused in any frontend project, whether you use a JavaScript framework or not. Stop rewriting components in the JS flavour of the month.&nbsp;</p>\n<p>In this talk, Rowdy will demonstrate how to create Web Components by implementing custom elements, shadow DOM and HTML templates. He will also show you how to use your new and shiny Web Component with your beloved JS framework.</p>"},{"id":142257,"day":"Wednesday","time":"9:50 - 10:20","location":"Stage 4","name":"Talk to the Duck - Secrets of the Debugging Masters","speaker":"Shai Almog","info":"<p>Debugging is something most of us do daily yet we often treat it like taking out the garbage i.e. running holding our nose and trying to get rid of it quickly. As a result even seasoned developers are unaware of some basic debugging capabilities and tricks.</p>\n<p>In this talk we&rsquo;ll shave the Yak properly. The session demonstrates practical debugging tips and tricks using IntelliJ/IDEA and Java but most of the ideas are universal and should be applicable to any language/IDE.</p>\n<p>Common tips include:&nbsp;</p>\n<ul>\n<li>Using go to line&nbsp;</li>\n<li>Variables are editable&nbsp;</li>\n<li>Use conditions&nbsp;</li>\n<li>Breakpoints don't have to \"break\"&nbsp;</li>\n<li>Logging is debugging and you don't have to stop for that...&nbsp;</li>\n<li>Field breakpoints are pretty darn useful and more...</li>\n</ul>"},{"id":142258,"day":"Wednesday","time":"9:50 - 10:20","location":"Stage 5","name":"Graph Neural Networks: What’s behind the Hype?","speaker":"Ekaterina Sirazitdinova","info":"<p>Graph Neural Networks (GNNs) are AI models designed to derive insights from unstructured data described by graphs. For different segments and industries, GNNs find suitable applications such as molecular analysis, drug discovery, prediction of developments in stock market, thermodynamics analysis, and even modelling of human brain.</p>\n<p>Unlike conventional CNNs, GNNs address the challenge of working with data in irregular domains.&nbsp;</p>\n<p>In this talk, I will provide an introductory overview of the theory behind GNNs, take a closer look at the types of problems that GNNs are well suited for, and discuss several approaches to model unstructured problems as classification or regression at various levels.</p>"},{"id":142259,"day":"Wednesday","time":"9:50 - 10:35","location":"Stage 1","name":"Going serverless using the Spring Framework ecosystem","speaker":"Timo Salm","info":"<p>Serverless applications are event-driven and take advantage of modern cloud computing capabilities and abstractions to allow developers to shift focus to writing business logic while not dealing with the complexity of the infrastructure their code runs on.</p>\n<p>After an introduction to Serverless, and the Serverless runtime Knative, this session will teach you how to implement your serverless applications and compile them to GraalVM native images with the robust collection of related functionality the Spring Framework ecosystem provides to get the full potential out of Serverless and reduce costs.</p>"},{"id":142260,"day":"Wednesday","time":"10:00 - 10:45","location":"Panorama Stage","name":"The Rise of Reactive Microservices","speaker":"David Leitner","info":"<p>Modern software architectures are amidst a paradigm shift &mdash; more and more software landscapes are built upon asynchronous and reactive patterns. This movement is understandable, as it takes scalability, resilience, and real-time integration to an elusive new level.</p>\n<p>In this talk, we will focus on the reactive paradigm's central concepts, core ideas, and the corresponding manifest and make them understandable. Based on this knowledge, we will go into detail by mapping it to concrete patterns, like event-centric persistence, the concept of hydrations or projections, and the shift of creating systems in a fully push-based design from end2end.&nbsp;</p>\n<p>Upon a closer look at the advantages and challenges we've experienced in customer projects, it turns out that reactive architecture is not a silver bullet either. Rather, they are suited for a specific set of problems but can be a game-changing tool to build cloud-native, highly responsive, and resilient applications.</p>"},{"id":142261,"day":"Wednesday","time":"10:00 - 10:30","location":"Microstage 1","name":"For the Cars and the Curious: Android Drift","speaker":"Stephan Schuster, Andreas Betz","info":"<p>An overview and deep dive into modern Android development for the automotive world</p>\n<p>We will start very high-level and step by step focus on the Android Automotive Operating System (AAOS) which is the main topic of this talk.</p>\n<p>Afterwards, we will provide an overview of the software stack that powers modern infotainment systems in cars.</p>\n<p>And finally, we will briefly talk about app development and theming on AAOS.</p>"},{"id":142254,"day":"Wednesday","time":"10:10 - 10:40","location":"Stage 2","name":"Rimac Technology in Software-Defined Vehicles","speaker":"Tomislav Čleković","info":"<p>Rimac Technology, the new company created out of former Rimac Automobili, is supporting the future of mobility by bringing products and services for autonomous, connected, electrified, and shared vehicles. Mainly focusing on the high-end, premium, and sports segment we are not only making an impact but also making work fun.</p>\n<p>In this session, we will present our key products and way of working and explain the leverage of having a technology business mainly in the fields of electronics and software closely tied to the vehicle itself. Having the access to the vehicle we made our development iterations shorter and were able to make needed changes faster in the end product.</p>"},{"id":142299,"day":"Wednesday","time":"10:10 - 10:40","location":"Mainstage","name":"Tame the Giant - Platform-Driven Architecture at Scale","speaker":"Stefan Baumgartner","info":"<p>You created and ultimately battled the Mighty Monolith. You set out and conquered the Land of Microservices, to drown in a sea of dependencies.</p>\n<p>No matter how much you prepared yourself, with the next wave of new teams joining your project, things just get out of hand!&nbsp;</p>\n<p>What if you can be the shoulder of giants other folks can stand on? What if you can create a platform that allows a myriad of developers to thrive in their creations?&nbsp;</p>\n<p>In this talk, we look at platforms and platform-driven architectures. What they mean for your organisation, what they change in the way you develop, and how they allow you to scale.</p>"},{"id":142373,"day":"Wednesday","time":"10:15 - 11:15","location":"Workshops M6","name":"Deploying applications to Kubernetes using Helm","speaker":"Andrew Pruski","info":"<p>Helm is a package manager for Kubernetes which simplifies deployments to Kubernetes. With Helm, applications are bundled into Charts which makes it easy to build, install, upgrade, and share complex Kubernetes applications.</p>\n<p>In this session we'll go over exactly what Helm is, the benefits it brings, and how to deploy applications to Kubernetes.&nbsp;</p>\n<p>Then we'll look at upgrading applications using Helm and then rolling back to a previous version. Once that's covered, we'll look at creating our own Helm Charts and storing them in a Chart Repository.&nbsp;</p>\n<p>To finish the session we'll then see how we can automate Helm Chart releases using Flux. This session is for anyone who has worked with Kubernetes and want to learn about Helm.&nbsp;</p>\n<p>Each topic covered in this session will be accompanied with live demos.</p>"},{"id":142374,"day":"Wednesday","time":"10:15 - 10:55","location":"Virtual Only Track","name":"Play Your Cards Right – Kotlin Practices for Java Developers","speaker":"Bas De Groot","info":"<p>Learning the language syntax is only the beginning. To unlock Kotlin&rsquo;s full potential, we need to play our cards right. Understanding Kotlin&rsquo;s best practices and idioms will make our code more elegant, efficient, and safe.&nbsp;</p>\n<p>In the past years, I&rsquo;ve worked with multiple teams making the switch from Java to Kotlin.</p>\n<p>During this time, I observed a reoccurring pattern of overlooked practices and idioms, resulting in code that does not take full advantage of the language. This talk covers these overlooked practices and explains how using them helps you to unleash the full power of Kotlin.</p>"},{"id":142264,"day":"Wednesday","time":"10:25 - 10:55","location":"Stage 4","name":"Solve the “But it works on my machine!” problem with cloud-based development environments","speaker":"Toma Puljak","info":"<p>Onboarding developers to projects with complex architecture is a tedious task. Hours, or even days, of your valuable time is wasted troubleshooting why your setup doesn&rsquo;t work on the new developers machine. That&rsquo;s where cloud-based development environments come in.</p>\n<p>Set up monolith or microservice infrastructures with a single click.&nbsp;</p>\n<p>With the approach presented in this talk, you will forget about ever having to walk through any setup steps, wait for long install times or trying to find a workaround for dependencies that just don&rsquo;t work on your machine.&nbsp;</p>\n<p>Cloud-based development environments will not only help your developers start coding right away, but cut costs in the process. There&rsquo;s no need to buy expensive hardware that can run demanding projects, all you need is a browser and you&rsquo;re ready to go.</p>"},{"id":142265,"day":"Wednesday","time":"10:25 - 10:55","location":"Stage 5","name":"Robots are coming into the wild! Full-Stack Robotics Engineers, be ready!","speaker":"Falk-Moritz Schaefer","info":"<p>Robots are coming into the wild, i.e. robots are increasingly used outside the manufacturing shopfloors and warehouses.</p>\n<p>It&rsquo;s an interesting and growing field for software engineers! Today, robots can relieve people from dull and dangerous tasks also in less predictable environments and situations such as inspecting industrial sites and assets.&nbsp;</p>\n<p>This session is about diving into the business and technology aspects of autonomous robotics systems used for inspection with two client-inspired showcases with different technologies 1 end-to-end drone inspection of a harbor, and 2 legged-robot inspection of an energy plant.&nbsp;</p>\n<p>The implementation of robotic systems requires cross-disciplinary work applying systems thinking across embedded, computer vision, signal processing, optimization, connectivity, distributed systems, cloud, user experience and human machine interaction.&nbsp;</p>\n<p>We will describe the term Full-Stack Roboticist and explain the opportunities for developers.</p>"},{"id":142266,"day":"Wednesday","time":"10:30 - 11:00","location":"Outdoor Airstream","name":"We adopted DevOps and are Cloud-native, Now What?","speaker":"Bruno Amaro Almeida","info":"<p>Today, one way or another, organisations are leveraging cloud to gain speed and agility to achieve their business goals.</p>\n<p>A DevOps and Cloud-native mindset is nowadays intrrisecly part of modern software development. The vast majority of organisations are already there, or giving steps towards it. However, after adopting DevOps and becoming cloud-native, it&rsquo;s hard to evaluate the organization maturity state and understand if it continues to evolute towards the right direction.&nbsp;</p>\n<p>In this talk, I share some real-world experiences, war stories and best practices for software engineers, engineering managers and technical leaders that want to drive their organisations towards engineering excellence - regardless on their organisational type (startup vs enterprise) and cloud strategy (single vs multi-cloud).</p>"},{"id":142267,"day":"Wednesday","time":"10:30 - 11:30","location":"Microstage 3","name":"Application of Theseus - Refactoring vs. Greenfield","speaker":"Benjamin Schütrumpf, Sebastian Brieler","info":"<p>While your software matures and ages, the rest of the world does not stand still. Sometimes this means part of your software does not fit the requirements any more or new technologies open up new possibilities.&nbsp;</p>\n<p>But what does that mean for your application and how can we keep it fit for the future?</p>\n<p>Replacing it piece by piece - will it still be the same application? Or did your core age beyond repair and its time to start anew? Let us have a look into the life cycle of software and talk about our experiences.</p>"},{"id":142268,"day":"Wednesday","time":"10:30 - 11:30","location":"Microstage 2","name":"Building the Next Generation travel companion - challenge & successes","speaker":"Subham Kumar","info":"<p>The session is about how Eurowings digital is moving from a legacy codebase toward a data drive company. The challenges faced during moving from legacy code to adapting the latest tech, success metrics we achieved by slowly refactoring the code.&nbsp;</p>\n<p>We will share the ways we used to move to new code base from old code base We will discuss how we refactored our codebase and use the A|B test to adapt the feature suitable for our customers.&nbsp;</p>\n<p>Also, UX is playing an important role by providing customers with a rich user experience.</p>"},{"id":142270,"day":"Wednesday","time":"10:40 - 11:25","location":"Stage 1","name":"Back(end) to the Future: Embracing the continuous Evolution of Infrastructure and Code","speaker":"Matthias Falkenberg, Timo Knapp","info":"<p>In this session, we will take you on a joyful journey. One that is about legacy systems and the evolution of both the infrastructure and the code that make them accessible to modern mobile applications.</p>\n<p>You will learn about the technology stack that we began with and how we continue to renovate what we once built.&nbsp;</p>\n<p>This talk is about sharing our experiences with you as we are moving to Microsoft Azure Container Apps and start leveraging Kotlin Coroutines with Spring WebFlux.</p>"},{"id":146785,"day":"Wednesday","time":"10:45 - 11:15","location":"Stage 3","name":"Coding and Mental Illness. A Survival Guide","speaker":"Chris Ward","info":"<p>Being a coder with mental health problems has very unique challenges, especially if you don't know you have them.&nbsp;</p>\n<p>After 8 years of medication for depression/anxiety, Chris got his diagnosis for ADHD at the age of 37 and the treatment changed his life.&nbsp;</p>\n<p>In an industry that is rife with imposter syndrome and where mental health \"quirks\" are often perceived as professional flaws or gaps in knowledge, Chris will share his experiences and give concrete helpful suggestions to overcome these challenges, as well as explaining to \"neurotypical\" people how they can be better allies.</p>"},{"id":142271,"day":"Wednesday","time":"10:45 - 11:15","location":"Microstage 1","name":"Model Governance and Explainable AI as tools for legal compliance and risk management","speaker":"Kilian Kluge, Isabel Bär","info":"<p>On their journey towards machine learning (ML) in production, organizations often solely focus on MLOps, building the technical infrastructure and processes for model training, serving, and monitoring.&nbsp;</p>\n<p>However, as ML-based systems are increasingly employed in business-critical applications, ensuring their trustworthiness and legal compliance becomes paramount.</p>\n<p>To this end, highly complex &ldquo;black box&rdquo; AI systems pose a particular challenge. Using the example of ML-based recruiting tools, we show how even seemingly innocuous applications can carry significant risks.&nbsp;</p>\n<p>Then, we demonstrate how organizations can utilize Model Governance and Explainable AI to manage them by enabling stakeholders such as management, non-technical employees, and auditors to assess the performance of AI systems and their compliance with both business and regulatory requirements.</p>"},{"id":142275,"day":"Wednesday","time":"10:45 - 11:15","location":"Stage 2","name":"Independently together: how micro-applications improve developer experience + app performance","speaker":"Bilal Cinarli","info":"<p>Over the last decade, products have moved to web-based applications, typically with the help of strong JavaScript libraries. Bigger, single-page applications were born, coupled with product teams and their road maps.</p>\n<p>But this marriage added additional complexities to how we build &ndash; and how we deploy.</p>\n<p>We&rsquo;re moving into a new era &ndash; one in which we change the how of building to ease these development and frontend architecture struggles.&nbsp;</p>\n<p>Enter micro-applications: single-page creations that create independent applications that can be managed separately, built separately, and deployed separately &ndash; without blocking each other: They essentially move together, independently.&nbsp;</p>\n<p>Bilal Cinarli, Sr. Engineering Manager at RapidAPI, brings his experience over the years of building and leading frontend application architecture to help the audience evaluate their product work at a granular level, and structure projects into manageable pieces.</p>"},{"id":142272,"day":"Wednesday","time":"10:50 - 11:20","location":"Mainstage","name":"Future of IT - the brave new connected, AI-powered world","speaker":"Tomislav Tipurić","info":"<p>Today's world of technology is full of buzzwords.</p>\n<p>No matter your role, from engineering to sales, your day-to-day discussions are filled with the cloud, SaaS, IaaS, PaaS, microservices, and other abbreviated and non-abbreviated terms.&nbsp;</p>\n<p>AI and IoT are probably very high on your list too. Various scenarios revolve around getting the sensor data to one place, analyzing it, and learning from it so we can automate some part of the process (e.g., when the car sees a stop sign on the road &ndash; what should it do?&nbsp;</p>\n<p>When the machine is sending out some unusual telemetry to the monitoring system &ndash; should we replace a potentially broken part?). IoT and AI are inseparable today and will be even more interconnected in the coming years.&nbsp;</p>\n<p>So, let's demystify them and answer the questions like how IoT systems work, what artificial intelligence is today, explain the dominant approaches, where we are today, what's coming in the next 2-3 years, and the business implications of these developments.&nbsp;</p>\n<p>This session aims to clear the fog in front of technology that promises to change the world that we know today, once and for all. Welcome to the brave new world of Artificial Intelligence!</p>"},{"id":142393,"day":"Wednesday","time":"11:00 - 23:45","location":"Virtual Only Track","name":"The Next Generation of Data Warehouses is for Developers","speaker":"Matan Sarig","info":"<p>Yes, developers. Because now that delivering data-enabled applications is at the core of so many software projects, data analytics are heavily influenced by software engineering practices. In order to build fast and versatile data experiences, software developers are adopting data engineering skills while data warehousing technologies are evolving to meet their needs. So what does this developer-friendly, modern data warehouse look like? And more specifically: - How can next-gen data warehouses simplify delivery of data features for dev teams - How will the rise of data-apps impact the future of analytics - What are common data-apps challenges - How to turn analytics into consumer-grade experiences</p>"},{"id":142273,"day":"Wednesday","time":"11:00 - 11:30","location":"Panorama Stage","name":"Serverless landscape beyond functions","speaker":"Mete Atamel","info":"<p>Serverless is much more than simple HTTP triggered functions. You can run containers and whole apps serverlessly, group functions behind an API gateway, coordinate services with a central orchestrator or let them communicate indirectly via events.</p>\n<p>You can schedule services or make them more resilient with task queues. You can even combine serverless orchestration with serverful services.&nbsp;</p>\n<p>In this talk, we&rsquo;ll look at the serverless landscape beyond simple functions and explore some patterns that help with serverless applications.</p>"},{"id":142278,"day":"Wednesday","time":"11:00 - 11:30","location":"Stage 5","name":"Humanizing Your Documentation","speaker":"Carolyn Stransky","info":"<p>It&rsquo;s no secret that most people don&rsquo;t read technical documentation for pleasure. Users often come to your docs when they are frustrated with your software, disappointed that they haven't been able to solve the problem on their own and generally feeling pretty low.</p>\n<p>This is sad, sure, but being aware of these feelings is key for developers and technical writers alike. These emotions frame the reader&rsquo;s perspective and therefore, should shape the mood of our docs.&nbsp;</p>\n<p>In this talk, we&rsquo;ll discuss how the language we use affects our users and the first steps towards writing accessible, approachable and use case-driven documentation.</p>"},{"id":142357,"day":"Wednesday","time":"11:10 - 11:55","location":"Virtual Only Track","name":"The Evolution of Software Testing: What is next?","speaker":"Mesut Durukal","info":"<p>In this talk, I provide some insights about the growth of software testing. Starting from the early times of software testing, finally we discuss what we can face in the future.&nbsp;</p>\n<p>Key take-away&rsquo;s are to be ready for the next generation testing activities (AI-supported testing and others). We all observe that software testing continues to grow, proving that it is a living organism.</p>\n<p>Then, in agile methodologies, we see testing activities in all phases of the Software Development Life Cycle (SDLC).&nbsp;</p>\n<p>To cope with complex scope to be verified in a limited time, automated testing started to appear in our life.</p>\n<p>Nowadays we meet lots of &ldquo;Continuous X&rdquo; terms, such as Continuous Integration, Deployment and Testing. Furthermore, researches are looking for adaptation of Machine Learning algorithms and other hot topics to testing processes to reduce the manual effort and improve quality.</p>"},{"id":142216,"day":"Wednesday","time":"11:10 - 11:55","location":"Outdoor Airstream","name":"Building a culture from chaos","speaker":"Steve Upton","info":"<p>Chaos engineering, popularised by Netflix, is an approach to building scalable, resilient systems through destructive experiments, but what other impacts does it have? How can adopting chaos engineering change organisational culture?</p>\n<p>This talk explores the parallels between modern distributed architectures and the unpredictable challenges of the modern world, and how approaches like chaos engineering help organisations deal with both.&nbsp;</p>\n<p>We will deep dive into the practices needed to make chaos engineering a success in your organisation and uncover how they help beyond just chaos engineering experiments.&nbsp;</p>\n<p>We will also explore the nature of complex, socio-technical systems and why new approaches are needed to deal with them.</p>"},{"id":146325,"day":"Wednesday","time":"11:15 - 13:15","location":"Workshops M5","name":"Building an app? Discover what HMS Core 6.0 can do for you!","speaker":"Adrian Busuioc, Muhammed Simsek","info":"<p>Huawei Mobile Services (HMS in short) is currently the 3rd largest mobile ecosystem. If you own a smart Huawei device, you're already familiar with: AppGallery, Browser, Wallet - just to name a few components of HMS.&nbsp;</p>\n<p>When you bring your apps to HMS, you need powerful building blocks. And that's exactly what HMS Core is about: an extensive collection of cloud and mobile APIs. Join our workshop to discover HMS Core and find out the ways it can enhance your apps and business.&nbsp;</p>\n<p>Expect mobile capabilities in areas such as: ML, AR, multimedia, security and connectivity to other smart devices. We'll attempt a couple of live demos (fingers crossed!) and all you have to do is relax and enjoy.</p>"},{"id":142281,"day":"Wednesday","time":"11:15 - 13:15","location":"Workshops M4","name":"Getting your ideas heard – How to pitch anything!","speaker":"Alexandra Nicolae","info":"<p>Working as a software developer, you constantly pitch for something. Convincing your fellow team-mates to use a new technology?&nbsp;</p>\n<p>That&rsquo;s a pitch. Asking your PO for more refactoring time? That&rsquo;s a pitch. Writing the README of your new NPM package?</p>\n<p>That&rsquo;s also a pitch. Anytime you try to convince someone else of your idea, you&rsquo;re pitching. So why do we so often fail at convincing others of our ideas? It mostly comes down to how we pitch. Join us to learn how to get better at making your ideas heard &ndash; through an amazingly crisp pitch! Meet your instructors: Alexandra spent a few months in Silicon Valley, figuring out how they do innovation at the big tech companies.&nbsp;</p>\n<p>The result was the internal pitching contest she introduced at Axel Springer, called the Ideation Council.&nbsp;</p>\n<p>Jonas is currently building up a Global Tech community between the 3000+ software developers working for Axel Springer globally. He successfully pitched the idea for an internal networking tool based on tech-stacks in front of the Ideation Council last year.</p>"},{"id":142277,"day":"Wednesday","time":"11:20 - 11:50","location":"Stage 3","name":"Building a large, complex product from the ground up with typescript & Atomic Design:lessons learned","speaker":"Nathalia Rus","info":"<p>Everyone talks about code \"scalability\" and \"maintainability\", but I remember struggling to come up with a such a project structure when I got started in tech. I needed a practical real-world example with best practices.</p>\n<p>Years later, I built Custodian - a large, complex platform. Our developers team grew in size seamlessly. I share some of my learnings and shortcomings.&nbsp;</p>\n<p>I will walk through our codebase structure, how I learned from open source projects, and crucially, how we leveraged typescript and atomic design - a match made in heaven.</p>"},{"id":142283,"day":"Wednesday","time":"11:20 - 11:50","location":"Stage 2","name":"Challenges of building React and React Native apps","speaker":"Milica Aleksic, Stefan Nikolic","info":"<p>Creating a React and React native app in today's world is full of challenges. In this talk we'll go over some of the most common challenges you'll experience when developing React and React Native applications.</p>\n<p>We'll share our knowledge and demonstrate how to solve real-world problems while developing your application.&nbsp;</p>\n<p>Topics will include performance, optimization, testing, code sharing, and more with code examples. The session will also go through the benefits of React and React Native in modern cross-platform development.</p>"},{"id":142276,"day":"Wednesday","time":"11:30 - 12:00","location":"Microstage 1","name":"Don't Be A Naive Developer: How To Avoid Basic Cybersecurity Mistakes","speaker":"Tino Sokic","info":"<p>In this talk, I would like to come to a conclusion why developers and programmers are simply that bad at security, and why there is such a big discrepancy between business and IT? The software out there isn't getting better - just worse.</p>\n<p>We are talking about clear text APIs, hard-coded passwords in websites, poorly configured internet-facing infrastructure like FTPs, usage of end-of-life VPNs, etc. Would you feel safe if the plane's pilot did not have valid flying training or a valid license to fly?&nbsp;</p>\n<p>You don't even question that when you are boarding a plane, and you assume he knows how to fly the thing, right? Now, how come developers only need to know how to code, without any kind of license or official training or even basic code-of-ethics training.&nbsp;</p>\n<p>I have seen how the whole SDLC goes to sh*t because someone just went for the functionality without considering what could go wrong.</p>"},{"id":142279,"day":"Wednesday","time":"11:30 - 12:00","location":"Mainstage","name":"Web development: where are we, and where are we going?","speaker":"Laurie Voss","info":"<p>For the last 5 years I've conducted annual surveys of tens of thousands of web developers about what technologies they use.</p>\n<p>Using technical usage and survey data from sources like npm, State Of JS, Stack Overflow, GitHub and Google's HTTP Archive, this talk will cover what the data says is the current state of web development, and what trends we see emerging.&nbsp;</p>\n<p>You should leave this talk with a better idea of where your current technical choices sit: are you behind the times, right on track, or ahead of the curve?&nbsp;</p>\n<p>Are there alternatives you should look into? Are there important technical changes coming you should be aware of?&nbsp;</p>\n<p>Web development is a big place, and this is an attempt to give you a map.</p>"},{"id":142280,"day":"Wednesday","time":"11:30 - 12:00","location":"Stage 1","name":"IKEA Story: Transforming an Iconic Retail Brand","speaker":"Parag Parekh","info":"<p>Since 2018, IKEA has embarked on a journey to transform itself and to ensure the relevance for today and tomorrows customers. We have set out to change everything, transforming our operating model while staying truly to our core and what makes us unique (our range, our values and our culture).&nbsp;</p>\n<p>Focus is of course the digitalization of the shopping experience, reaching more of our customers in the city centers, addressing climate change and resource scarcity and preparing for the future of work - and technology is at the heart of this transformation.</p>\n<p>And as we meet our customers in many formats, we see the digital and physical world coming together faster than ever. We have a positive outlook and believe that we have an endless opportunity to fully express the potential of IKEA digitally. The more we work on becoming customer centric, we will become more relevant and attractive to customers in the digital age, with products and services to create a better home, and a better life.</p>"},{"id":142282,"day":"Wednesday","time":"11:35 - 12:05","location":"Stage 4","name":"Securing your application software supply-chain","speaker":"Niels Tanis","info":"<p>With our complete software development process becoming more complex we also got a lot more security problems to deal with. What starts with code and ends with releasing/deploying software is also being referred at as the software-supply chain.</p>\n<p>The software supply-chain consists of a lot of moving parts. Each of them facing their own security risks starting from access to source code, compromised third-party libraries and tools, or even hacked build servers. For example with SolarWinds the compromised build server added malicious functionality to the end product used by their customers.&nbsp;</p>\n<p>And a tool called CodeCov had their upload script compromised which resulted in it stealing used access-keys. In this session we'll get hands-on with securing an application it's supply chain and look how we can limit the security risks in all the different area's.&nbsp;</p>\n<p>We're going to look into he concept of Software-Bill-Of-Materials (SBOM), Google's SLSA and tools like in-toto, cyclonedx and sigstore.</p>"},{"id":142284,"day":"Wednesday","time":"11:35 - 12:05","location":"Panorama Stage","name":"Svelte ♥ TypeScript and so will you","speaker":"Ivan Hofer","info":"<p>The most loved frontend-framework Svelte has gained good TypeScript support over the last years and is capable to deliver a great developer experience - also within buisness applications. Unfortunately it is not that easy to find good documentation about all the TypeScript features Svelte offers.</p>\n<p>In my talk I want to show how to get started and go over some code examples. At the end I will reference a repository where more examples are available to dig deeper into this topic. Along the way I will also give some general TypeScript tipps that enable even stronger static type checks than probably most developers currently know.</p>"},{"id":142287,"day":"Wednesday","time":"11:35 - 12:05","location":"Stage 5","name":"Enhancing AI-based Robotics with Simulation Workflows","speaker":"Teresa Conceicao","info":"<p>Anything that moves will be autonomous! With an ever-growing AI and data-centric world, robots will become more intelligent, flexible, and robust. However, with these new paradigms, some challenges arise:&nbsp;</p>\n<ul>\n<li>AI Robots need data! Lots of different data! But acquiring real data can be costly and laborious;</li>\n<li>AI Robots need training! Lots of training! But training in the real world is not scalable and getting representative scenarios covering hard edge cases might even be impossible;&nbsp;</li>\n<li>AI Robots need testing! Lots of testing! But real testing cycles are time-consuming, possibly unsafe, and slow down development iterations.&nbsp;</li>\n</ul>\n<p>Sounds hard? No, it is really no boogeyman! In this session, we'll go over how Simulation can play a key role in enabling AI-based Robotics but also how to easily get started enhancing AI workflows with the NVIDIA Omniverse and Isaac platforms.</p>"},{"id":142365,"day":"Wednesday","time":"11:45 - 13:45","location":"Workshops M7","name":"Workshop: Schools of Test-Driven-Development","speaker":"Marco Emrich, Thorsten Brunzendorf","info":"<p>In test-driven development (TDD), the Chicago and London Schools have dominated for many years. After the Munich School added a new point of view in 2018, Hamburg and St. Pauli School followed last year. These five (at least?) TDD schools differ fundamentally in their methodology.</p>\n<p>Nevertheless, they are not mutually exclusive. In this workshop, you will have the opportunity to get to know the different schools and learn which approach is best suited in which context.&nbsp;</p>\n<p>After a short introduction, we will try out the different approaches together in a mob and/or pair programming. This way you will not only learn the theoretical basics but also exercise the practical application.</p>"},{"id":142122,"day":"Wednesday","time":"11:45 - 13:45","location":"Workshops M6","name":"Smart contracts on Bitcoin SV","speaker":"Darren Kellenschwiler, Xiaohui Liu","info":"<p>sCrypt is a high-level language, syntactically similar to JavaScript and Solidity, which makes the creation of BitcoinSV smart contracts easy.&nbsp;</p>\n<p>In this session we will get to grips with a few key concepts, understanding how smart contracting works within Bitcoin&rsquo;s UTXO predicate paradigm.</p>\n<p>Then we&rsquo;ll demonstrate how you might integrate the sCrypt contract compiler into an existing application.</p>"},{"id":142431,"day":"Wednesday","time":"11:45 - 13:45","location":"Workshops M8","name":"AWS IoT Workshop","speaker":"Rameel Hashmi","info":"<p>Pre- requisite: Please bring your own machine and have a working AWS private account.</p>\n<p>Hands-on and deep working knowledge of the AWS IoT service.&nbsp;</p>\n<p>Internet of Things meets AWS Cloud</p>\n<p>The Internet of Things (IoT) will continue to transform the business landscape as well as the way we live. Cloud computing is the backbone of this transformation. Increased cloud adoption has acted as a springboard for many IoT applications and business models, offering the ability for companies to reduce time-to-market and total cost of ownership.</p>\n<p>This is a live workshop with a collection of labs to guide you through all the different aspects of using AWS IoT and the relevant downstream services and perform some IoT based use-cases.</p>"},{"id":142285,"day":"Wednesday","time":"11:45 - 13:45","location":"Workshops M2","name":"Implementing GraphQL with plain Java","speaker":"Josip Primorac, Josip Mlakar","info":"<p>You probably heard the GraphQL buzzword quite often. But did you ever find the time to try it yourself? This workshop will be a great opportunity to do exactly that. It is time to compare your usual REST APIs with GraphQL.</p>\n<p>After the difference is clarified, we will start off by defining a GraphQL Schema. Together, we will build a GraphQL server in plain Java from scratch. We will take a look at GraphQL resolvers and explain nodes and edges. Once we set up the service, we'll also create a simple client.&nbsp;</p>\n<p>We'll see how to perform CRUD operations using GraphQL queries and mutations.</p>\n<p>Important: Please bring a laptop with the latest version of Java installed as well as wifi-access.</p>"},{"id":142286,"day":"Wednesday","time":"11:45 - 13:45","location":"Workshops M3","name":"Design, Document, Discover, and Develop Event-Driven APIs","speaker":"Tamimi Ahmad","info":"<p>More and more organizations are adopting event-driven architecture (EDA) in their operations.&nbsp;</p>\n<p>In this workshop, we'll build and expand your toolbox by learning how PubSub+ Event Portal, paired with industry standard specifications and frameworks, enables a smooth journey to bring your EDA from initial architecture and design to code running in production.</p>\n<p>We will also cover AsyncAPI, an open initiative for defining asynchronous APIs and all the tooling around this specification, including code generation</p>"},{"id":142409,"day":"Wednesday","time":"12:00 - 12:35","location":"Virtual Only Track","name":"SSR: The Good, The Bad & The Ugly","speaker":"Mateusz Ostafil","info":"<p>Server-Side Rendering is a great feature that brings high performance and SEO to Single Page Applications. However, nothing comes without the price.</p>\n<p>In this talk, I would like to tell you what is SSR and why it causes so many problems in real-world applications. It can even impact User Experience in a bad way.&nbsp;</p>\n<p>So, during the live coding, I'll show you how to solve those problems. It's worth noting that SSR issues are not tied to any specific front-end framework, so any front-end developer is welcomed.</p>"},{"id":142344,"day":"Wednesday","time":"12:10 - 12:55","location":"Mainstage","name":"What's Next, or, how we messed up the WWW, and how to fix it!","speaker":"Joel Spolsky","info":"<p>Since the web became universal about twenty years ago, virtually all of the work around creating useful abstractions has happened in commodified spaces, where private commercial interests have very different goals than the users, resulting multiple chopped-up, privatized \"webs\" consisting of commercial private networks that don't serve humans and don't live up to the potential of an open and free internet. In this talk I will explain how The Block Protocol aims to retake the WWW for users and give them control again.</p>\n<p>&nbsp;</p>"},{"id":142288,"day":"Wednesday","time":"12:15 - 13:15","location":"Microstage 2","name":"Technical Excellence - A continuous challenge for software service providers","speaker":"Wolfgang Strunk","info":"<p>Technical excellence for us is defined as building innovative and excellent products for our customers by creative people with a broad technological know-how.&nbsp;</p>\n<p>The challenge is to keep this know-how up to date and to apply it to our customers&rsquo; products even though our preferred technology stack might differ significantly from what the customers would request firsthand. This is where the concept of an internal developer platform (IDP) comes into play.</p>\n<p>An IDP is a self-service layer that encompasses technologies and tools that allows developers to set up environments, deployments, databases, logs, and whatever else they need to operate their apps. In the past an application server might have been an appropriate IDP, but as cloud computing, DevOps, containerization, and microservice architectures evolved to be the building blocks of today&rsquo;s modern applications, an IDP must address the complete deployment process and various target platforms to make developers self-serving.&nbsp;</p>\n<p>We decided to invest into an IDP as a tangible asset to drive our technological innovation and excellence. Our initiative is not about re-using the actual implementation but to set the level for all future customer products.&nbsp;</p>\n<p>In this talk we give a detailed example of how we set up our IDP and which buildings blocks it comprises of.</p>\n<p>By that we enable all our engineers to deliver at the same level of technical excellence when they are asked to design and develop a new solution for our customers.</p>"},{"id":142289,"day":"Wednesday","time":"12:15 - 13:15","location":"Microstage 3","name":"How to make a 4 day week work for everyone","speaker":"Kit Barclay, Jake Levine","info":"<p>Awin has been on a 4 day working week since Jan 1st, 2021. The whole company, all 1,200 of us. And it&rsquo;s amazing! We all love it, which probably isn&rsquo;t a surprise. I mean, who would say no?! Work 30 hours for the same salary, same holiday entitlement, lots of flexibility over your weekly day off&hellip; It&rsquo;s the dream! But it hasn't come for free. As an organisation, Awin has had to make some big decisions. And we, the Product Development department, have had to react accordingly.</p>\n<p>How do you keep your delivery on track? How is stakeholder engagement affected? How do you ensure there's enough focus time if there are fewer hours in the week?&nbsp;</p>\n<p>And how can our teams remain happy and motivated?&nbsp;</p>\n<p>In this presentation, Kit Barclay (Head of Engineering) and Jake Levine (Solution Architect) will outline some of the bigger changes Product Development have implemented, looking at wins, lessons learnt, and hopefully giving you the ammunition to take the 4 day week argument to your board.</p>"},{"id":147428,"day":"Wednesday","time":"12:30 - 13:50","location":"Outdoor Airstream","name":"Startup Pitching","speaker":"","info":""},{"id":142371,"day":"Wednesday","time":"12:45 - 13:30","location":"Virtual Only Track","name":"Vaadin – SPAs (not only) for Java Developers","speaker":"Simon Martinelli","info":"<p>Single Page Applications (SPA) have become the quasi-standard in the development of web applications today. Angular, React and Vue.js are the most well-known representatives from this category of web frameworks.&nbsp;</p>\n<p>For Java developers, however, this means learning a new programming language and, which can often be more difficult, finding a completely foreign build environment with its own ecosystem. Are there alternatives?</p>\n<p>Vaadin is an established web framework that allows web applications to be developed entirely in Java, but recently also supported a classic SPA approach. F</p>\n<p>irst, the new architecture of Vaadin, which is no longer based on GWT but on WebComponents, is explained. A customer project shows how form-based and data-heavy web applications can be implemented very efficiently. The second part deals with Hilla (former Vaadin Fusion), which offers the possibility to develop SPAs with TypeScript and WebComponents in the frontend and Java in the backend.</p>"},{"id":142292,"day":"Wednesday","time":"12:45 - 13:45","location":"Stage 1","name":"C++ in constrained environments","speaker":"Bjarne Stroustrup","info":"<p>C++ is widely used in constrained and/or critical applications. How do we manage using a large multi-purpose language in such environments? How can we better use facilities from and techniques from modern C++ (C++11 &hellip; C++20)?</p>\n<p>The best answer is not &ldquo;use only facilities available in C and C++ in 1985.&rdquo;&nbsp;</p>\n<p>This talk focusses on a top-down approach to achieve safety, performance, and maintainability. It touches upon the C++ Core Guidelines, compile-time computation, type deduction, the span and chrono standard libraries, and error handling.</p>"},{"id":142291,"day":"Wednesday","time":"13:00 - 13:30","location":"Microstage 1","name":"Angular Magical directives","speaker":"Valentine Awe","info":"<p>Utilising the flexibility of most popular component libraries makes development easier and fun especially when we do not have to worry about what is happening under the hood.&nbsp;</p>\n<p>But as we progress in our career or as our apps grow bigger, we are likely going to find ourselves faced with the task of designing our own component libraries that can be reusable and highly configurable across all your applications in order to maintain consistency and also follow the DRY principle.</p>\n<p>This presentation will take you through that magical experience provided by the angular ng-magical directives in building clean and reusable components in Angular</p>"},{"id":142293,"day":"Wednesday","time":"13:00 - 13:30","location":"Stage 4","name":"Empathy: The secret sauce of Resilience","speaker":"Malin Litwinski","info":"<p>The resilience of a software product is only ever as strong as the resilience of the engineering body maintaining it.</p>\n<p>Introducing a culture of Chaos Engineering can be incredibly impactful in strengthening the product and the people, but never without its secret sauce: Empathy.&nbsp;</p>\n<p>In this session, I will outline the benefits of Chaos Engineering, explain the importance of looking at the entire process from an angle of empathy and finally introduce some of the most important tools in the empathy toolbox.</p>"},{"id":142296,"day":"Wednesday","time":"13:00 - 13:30","location":"Panorama Stage","name":"Debug a Kubernetes Operator","speaker":"Philipp Krenn","info":"<p>The goal of this live debugging session is to better understand how to work with a failing Kubernetes Operator and get used to some helpful Kubernetes commands. Each of the three examples follows the same structure:</p>\n<ul>\n<li>Apply an invalid YAML manifest.</li>\n<li>Figure out what is wrong and how to fix it.&nbsp;</li>\n<li>Hints that may help solve the problem. A detailed walkthrough to understand and solve the problem.</li>\n</ul>\n<p>Also we'll look at some handy command-line tools and how to connect them for your everyday work with Kubernetes.</p>"},{"id":142297,"day":"Wednesday","time":"13:00 - 13:30","location":"Stage 5","name":"Fleet Management - Reinvented","speaker":"Tonci Zilic","info":"<p>The story about Rimac M2M began back in the days of Concept_One development, when we figured out that creating our own telemetry system would be useful, but also, quite cool at the same time.</p>\n<p>From an internal side-project to bespoke monitoring, analytics and software update management engineering tool for automotive OEMs.&nbsp;</p>\n<p>How do our users make use of several thousand tracked signals, manage sw update packages, what tech stack powers the system, and how did we reinvent the classic fleet management - find out in this talk.</p>"},{"id":142294,"day":"Wednesday","time":"13:15 - 13:45","location":"Mainstage","name":"Neuromarketing and Neurodesign, the Science of Design & Pursuasion","speaker":"Flavilla Fongang","info":"<p>How have some brands or business individuals developed an emotional connection with a large audience who believe in them and buy from them frequently without questioning the value or authenticity of their products or services?&nbsp;</p>\n<p>Why is brand design so important in building the value of your business and how to do it right? Why colours and designs have an impact on our purchasing behaviour.</p>\n<p>We will explore during this session, the power of brand psychology that has been used by brands such as Apple or Telsa.</p>"},{"id":142298,"day":"Wednesday","time":"13:15 - 13:45","location":"Stage 2","name":"The Art of Becoming a Mature Product Team","speaker":"Daniela Lica","info":"<p>In a realm overflowing with innovation hype, creating winning products that truly address our customers' needs has become a very challenging assignment.&nbsp;</p>\n<p>While everyone aspires to build the most desirable products for their customers, reduce risks, and generate great value for their businesses, they are unlikely to succeed without the proper methods.</p>\n<p>Let's talk about how to create products that customers love by moving beyond the classical Agile delivery methodologies, adopting a continuous-discovery mindset and taking full ownership of your outcome.</p>"},{"id":142305,"day":"Wednesday","time":"13:30 - 14:30","location":"Microstage 3","name":"Who can and should write software?","speaker":"Tim Hoffmann","info":"<p>Through the uprise of data science and scientific computing more and more code get's written by non-software-experts and outside of classic software departments. Can this work without creating a mess?&nbsp;</p>\n<p>Spoiler:</p>\n<p>Yes, it can. At Carl Zeiss SMT, we develop high-tech semiconductor manufacturing equipment, that enables the production of today's high-end computer chips.&nbsp;</p>\n<p>Development and production of these machines relies heavily on simulation and data analysis. Thus domain expertise and software tools are tightly coupled.&nbsp;</p>\n<p>At the example two departments at Carl Zeiss SMT, one in R&amp;D and one in Process Development, we'll explain their specific needs with respect to software solutions.&nbsp;</p>\n<p>These needs lead to distinct approaches for bringing domain an software aspects together. We'll share our learnings on successes and pitfalls when developing software in these scenarios.</p>"},{"id":142302,"day":"Wednesday","time":"13:35 - 14:05","location":"Microstage 1","name":"Advanced Typing in TypeScript","speaker":"Lars Hupel","info":"<p>TypeScript is a powerful language with a type system that has been designed towards common programming patterns in the JavaScript world. Coupled with outstanding type inference and IDE support, it makes programming a breeze.</p>\n<p>In this talk, we will take a look at some of the more advanced parts of the type system and how they can be used to create rock-solid APIs. As an example we will consider the very common problem of data validation and processing. I will show how to build a data pipeline from scratch.</p>"},{"id":142300,"day":"Wednesday","time":"13:40 - 14:25","location":"Stage 4","name":"Introverted Developers on Social Media","speaker":"Francesco Ciulla","info":"<p>in this talk, I will talk about my experience as an introverted developer, from super skeptical about social media to Developer Advocate, a profession that involves a lot of content creation and it requires high communication skills.</p>\n<p>I will share everything I know and I have learned on my skin so you can use Social media and increase your communication skill, to open up to many new opportunities and, why not, find some friends on the internet.&nbsp;</p>\n<p>At the end of this talk, you will feel motivated to work on your social presence, even (and especially) if you are introverted.</p>"},{"id":142306,"day":"Wednesday","time":"13:40 - 14:25","location":"Stage 5","name":"Sustainable Mobility – Giravolta","speaker":"Txus Ballesteros, Jordi Abad","info":"<p>We at SEAT:CODE develop digital solutions for the VW Group and reinvest the margins to create new SaaS products. One of our most important products is the all-in-one Mobility Platform Giravolta. With Giravolta we enable the locations of our Group as well as external brands to sustainably move their people using connected and electrical mobility as well as micro- mobility vehicles.&nbsp;</p>\n<p>By that, we increase employee satisfaction, reduce costs, and contribute to a better and greener world! Giravolta, as a SaaS platform, operates with multiple vehicles types such as motorcycles, cars, bicycles, scooters, etc from a bunch of different providers and several brands (Continental, Astra, Omni, Okay, ...).</p>\n<p>As a result of that, from a technical standpoint, it's a huge challenge to interconnect the mix of providers, connectivities, networks and hardware. In this session we will present how Giravolta provides support to all of them through LoRa, Bluetooth and 3G. We will also share the learning that we got from our experiences integrating some of them on the platform.</p>"},{"id":142307,"day":"Wednesday","time":"13:40 - 14:10","location":"Panorama Stage","name":"Modern Headless Commerce with Vendure","speaker":"Michael Bromley","info":"<p>E-commerce apps are the backbone of the internet, and there are countless platforms you can use to build your next e-commerce app - from SaaS solutions to open-source frameworks. However, the Node &amp; JavaScript community has been badly under-served, with a distinct lack of mature yet forward-looking solutions for custom e-commerce development.</p>\n<p>That's the situation I saw four years ago when I started to build Vendure, an open-source headless commerce framework built on Node with TypeScript. Since then it has gained traction with companies of all sizes, including Fortune 500 companies and rapidly-growing start-ups.&nbsp;</p>\n<p>In this talk I will give a bit of background on the project, dive in to some of the technical choices, and demonstrate how you can get up-and-running with full-stack headless commerce faster than you might imagine.</p>"},{"id":142397,"day":"Wednesday","time":"13:45 - 14:20","location":"Virtual Only Track","name":"Testing Web Accessibility","speaker":"Adrián Bolonio","info":"<p>When we develop a new web application, we often put a lot of work on the design, on making it beautiful and usable. In other words, we want our web app to be effective, efficient, and satisfying for the user. But a lot of times we don&rsquo;t think about the user experience for people with disabilities, including people with age-related impairments. Our role as frontend and web developers is to create clear interfaces to make people understand and care about data, independently of their disabilities or impairments, but what we, developers, often forget is to ensure that the code we write follows the Web Content Accessibility Guidelines (WCAG), and the only way to achieve that is testing, either manual or automated. Automated web a11y tests can free up our QA team from manual testing every part of our application, but, they can&rsquo;t automatically make our site accessible. We should use automated a11y tests as one step of a larger testing process.</p>"},{"id":142407,"day":"Wednesday","time":"13:45 - 14:20","location":"Virtual Only Track","name":"Huh? to Aha! - A Refactoring Story","speaker":"Gopal S Akshintala","info":"<p>As a Dev, I need to Refactor, to make codebase Refactorable_. Refactorability [as defined by Martin Fowler](https://refactoring.com/) is, \"Ability to alter internal structure without changing its external behavior\". This applies to each atomic component of an app. Let's achieve our dev story through a unique, yet most effective Method, **Component Isolation**.</p>\n<p>Let's huddle over persuasive arguments against _Obstacles_ that hinder our goal causing entanglements among components, and _Metrics_ that measure our success.&nbsp;</p>\n<p>Let's refactor a real-world app to and witness how Isolated components make-up long-lasting structures.</p>\n<p>Please find the Audience, Takeaways, Talk Outline, Slide-deck and source-code links on my personal blog: https://overfullstack.ga/posts/huh-to-aha</p>"},{"id":142308,"day":"Wednesday","time":"13:50 - 14:35","location":"Stage 3","name":"Intro to FastAPI","speaker":"Sebastián Ramírez","info":"<p>Learn how to create an API ready for production in very little time using FastAPI... explained with memes.&nbsp;</p>\n<p>Your API will have automatic validation, documentation based on standards, high performance, and several other features. All this, having editor support including autocompletion everywhere.&nbsp;</p>\n<p>In this talk you will learn what FastAPI can do, and how it could benefit you.</p>\n<p>You will see how to declare the data you want to receive in each request using standard Python type annotations. I</p>\n<p>ncluding path parameters, query parameters, body payloads with JSON, etc.&nbsp;</p>\n<p>You will also see how to use simple, standard, Python type annotations to declare complex JSON body payloads with deeply nested structures, and get automatic data validation, serialization, and documentation.</p>"},{"id":142309,"day":"Wednesday","time":"13:50 - 14:20","location":"Stage 1","name":"May I interest you in ... R?","speaker":"Mihailo Joksimovic","info":"<p>One of the reasons we love visiting conferences is to hear and learn something new, right? So, why not learn something brand new? Why not learn a bit or two about ... R language?</p>\n<p>R is most widely used for statistics and machine learning.&nbsp;</p>\n<p>And yet, I think that's a pity. It's a pity because language is beautiful, has amazing set of packages and libraries and is built as purely functional language (although you can use OOP if you want).&nbsp;</p>\n<p>Additionally, one beautiful thing about learning new languages is that you, usually, get inspired.&nbsp;</p>\n<p>You get inspired to try something new in your language of choice and, who knows, we might end up with something revolutionary, can't we?</p>"},{"id":142310,"day":"Wednesday","time":"13:50 - 14:20","location":"Stage 2","name":"Writing truly cross plattform applications using flutter","speaker":"Simon Auer","info":"<p>Flutter is mostly gaining traction as a mobile app framework. But with the last 1-2 updates flutter allows not only to create almost native feeling apps on ios and android, but also on osx, windows, linux and even the web.&nbsp;</p>\n<p>The focus of this talk is to show how easy creating cross plattform applications with a single source can be and to highlight advantages/distadvantages and the potential.</p>\n<p>We will also discuss similar frameworks like react-native and their differences under the hood, with all the pros/cons gathered from real world examples and when they should be used instead. This talk will be half theoretical, half live coding with examples on how to manage cross plattform designs with a single codebase efficiently.</p>"},{"id":142123,"day":"Wednesday","time":"14:00 - 16:00","location":"Workshops M6","name":"The Future of Transaction processing and blockchain infrastructure as a service","speaker":"Frank Dickob, Liam Missin","info":"<p>At TAAL, we see a future where our blockchain infrastructure serves to underpin and process all forms of data standards and payment transactions on the internet, everything from carbon trading markets to IoT messaging to cash payments.</p>\n<p>Come join our interactive introduction session to learn about the highly anticipated Blockchain Infrastructure service platform that includes TAAL API, WhatsonChain, and STAS token protocol. We will run through demos and workshops using the tools, solutions, and APIs, all which you can easily integrate for free into your next blockchain project.</p>\n<p>At the end of the session, you will be able to build raw transactions, have explored how to post and retrieve data from the blockchain, all by using Taal&rsquo;s services.</p>"},{"id":142169,"day":"Wednesday","time":"14:00 - 16:00","location":"Workshops M3","name":"Video meeting on steroids - live data, layout hacks and automated tasks","speaker":"Stefan Benicke","info":"<p>Video conferences can be more than just people sitting in front of (muted) cameras. In this workshop we will show you how to control and influence a running meeting by manipulating the layout and the look and feel, how to add and show live data, and how to automate tasks based on your specific needs. The software will interact with the running meeting, receive information and show live data based on whatever is currently happening. Some of the topics covered by the workshop are: Cross-platform Video Meetings, Customize Video Layout, Customize Video Stream, WYSIWYG, Automate Related Tasks. We will build an example application covering some use cases to see how easy it is to enhance video meetings on the fl</p>"},{"id":148074,"day":"Wednesday","time":"14:00 - 16:00","location":"Workshops M8","name":"Developing a Blockchain Application with Lisk SDK 5.2.2","speaker":"Rishi Mittal, Mona Bärenfänger, Ishan Tiwari","info":"<p>During the workshop, the Lisk team will show how to build blockchain applications using JavaScript &ndash; the most popular programming language in the world. We will present the main features of the Lisk Software Development Kit as well as guide you in creating your own blockchain project.&nbsp;</p>\n<p>Moreover, we will talk a bit about the future of web3 applications and provide you with essential information about blockchain interoperability &ndash; one of the most important concepts for the entire industry.</p>"},{"id":146379,"day":"Wednesday","time":"14:00 - 16:00","location":"Workshops M2","name":"Build a Blockchain with Substrate","speaker":"Alexandre Lansky","info":"<p>Substrate is an open source, modular and extensible framework for building blockchains. It provides you with everything you need to run a blockchain out of the box: a database layer, networking layer, consensus engine, transaction queue, and libraries to compose your chain's business logic.</p>\n<p>It opens new doors for permissionless blockchains. With Substrate, decentralized applications are fully programmable, can be customized to domain-specific needs, and are built to evolve over time. In this workshop, we'll create a simple application-specific blockchain for minting NFTs.</p>\n<p>To follow along for this workshop, you'll need to have your local environment set up with Rust and a compiled version of the Node Template.</p>"},{"id":142303,"day":"Wednesday","time":"14:00 - 14:45","location":"Outdoor Airstream","name":"Panel: How to Raise Series A for SaaS Startups","speaker":"Benjamin Ruschin, Mark Kaslatter, Nina Rinke, Yang Tran, Lukas Leitner","info":"<p>In this session, VC practitioners will provide you with the essentials of raising Series A funds for SaaS startups. You will have the chance to ask questions and connect with the speakers.</p>"},{"id":142312,"day":"Wednesday","time":"14:00 - 14:45","location":"Mainstage","name":"Qwik + Partytown: How to remove 99% of JavaScript from main thread","speaker":"Miško Hevery","info":"<p>Making sites load fast with current tech is out of reach for most. Builder.io is reinventing server-side generation and front-end frameworks by prioritizing time-to-interactive.</p>\n<p>This radical approach is going to change how developers and frameworks approach the problem of initial interaction.&nbsp;</p>\n<p>The result is not only the highest Google PageSpeed Insight scores but also a user experience previously thought impossible. In this session, you will see how this is achieved, and gain a peek into the future of the Qwik + Partytown framework.</p>"},{"id":142314,"day":"Wednesday","time":"14:00 - 16:00","location":"Workshops M4","name":"5 best ways to optimize cloud costs","speaker":"Rene Heinzl, Markus Nissl","info":"<p>We are presenting our experience with optimization for our cloud costs in the area of AI and robotics for a sustainability startup located in Austria.&nbsp;</p>\n<p>Our main focus is on inexpensive cloud providers for a reactive AI and robotics end-to-end data pipeline.&nbsp;</p>\n<p>We are using our own storage and database layer and a well known queuing system.</p>\n<p>NestJS provides the real time update for our customers and for live data analysis. The presented data pipeline uses live data from one of our recycling facilities to detect plastic waste.</p>"},{"id":142311,"day":"Wednesday","time":"14:10 - 14:40","location":"Microstage 1","name":"Why pair programming is the best usability testing tool for developer focused products?","speaker":"Anil Kumar  Krishnashetty","info":"<p>Why pair programming is the best usability testing tool for developer focused products? Have you done the pair programming session with your users?</p>\n<p>The amount of insights you get while doing pair programming sessions is enormous. In this talk, Anil will share lessons learned while doing pair programming sessions with the users for developer focused products/services in his recent role as a Technical Product Manager.&nbsp;</p>\n<p>Learn why pair programming with users is the best way to identify the developer's pain while using your product/service.</p>"},{"id":142316,"day":"Wednesday","time":"14:20 - 14:50","location":"Panorama Stage","name":"Search and aggregations made easy with OpenSearch and NodeJS","speaker":"Olena Kutsenko","info":"<p>Learn how OpenSearch works and get equipped with practical knowledge to search, aggregate and visualise your data. This is a hands-on session where we will interact with the OpenSearch cluster with the help of OpenSearch NodeJS client - create an index, add documents, search and aggregate data.</p>\n<p>At the end we&rsquo;ll visualise results with OpenSearch Dashboards.&nbsp;</p>\n<p>NodeJS engineers who are ready to add search and aggregation features to their applications should attend this session; no previous knowledge of OpenSearch is required.</p>"},{"id":142317,"day":"Wednesday","time":"14:25 - 14:55","location":"Stage 1","name":"Dart - a language believed dead, experiences a new bloom","speaker":"Christoph Menzel","info":"<p>Version 1.0 of Dart was released back in November 2013. Since then, it has always been very quiet around this language and it never really became successful.&nbsp;</p>\n<p>But now that Dart is the programming language behind the more than successful cross-platform framework Flutter, it is gaining more and more popularity. Dart comes with some very interesting and unique features.</p>\n<p>For instance, it is possible to compile not only \"just in time\" (JIT) and \"ahead of time\" (AOT) but also Dart code to Java Script. Using various examples and live coding, I will give you an insight into the programming language Dart and show you different features. Let me take you into the world of Dart and get inspired!</p>"},{"id":142320,"day":"Wednesday","time":"14:25 - 14:55","location":"Stage 2","name":"Headless Flipper - embeddable mobile devtools for your CI and beyond","speaker":"Andrey Goncharov","info":"<p>Flipper is a platform for debugging mobile and web apps. Half a year ago, we decided to split the electron monolith in two parts: a standalone server and a UI. In this talk, we will cover why you need headless Flipper, what opportunities it unlocks for you.</p>\n<p>We will go over how Flipper can now be easily used for remote debugging, embedding, CI integration, and etc. We will overview how Flipper architecture transformed to support the migration, what Flipper is now, and how we plan to use it at Meta.</p>"},{"id":142368,"day":"Wednesday","time":"14:30 - 15:15","location":"Virtual Only Track","name":"To boldly go where no man has gone before","speaker":"Shlomi Livne","info":"<p>Our Space is the Database space. Building our database we have been solving head-on problems others have \"skipped\" / \"worked around\".</p>\n<p>&nbsp;The non compromise approach allowed us to reach performance others can not. In this talk I'll share some of the problems we at ScyllaDB have tackled over the last 8 years, the long journey toward solving some of this and the cost associated with that.</p>\n<p>Walking away form this talk you'll appreciate databases a bit more (I hope ) and rethink some of your \"workarounds\" and the cost they may have on holding you back.</p>"},{"id":152207,"day":"Wednesday","time":"14:30 - 15:00","location":"Virtual Only Track","name":"AI-Featured Solutions at Porsche Digital","speaker":"Peter Wolf","info":"<p>Cross-departmental development of ai-featured solutions in the automotive industry.</p>"},{"id":142315,"day":"Wednesday","time":"14:30 - 15:15","location":"Stage 4","name":"Decoding our differences - skills for the 21st century","speaker":"Karine Rübner, Gabby Austen Browne, Stuart Bruce, Flavilla Fongang","info":""},{"id":142318,"day":"Wednesday","time":"14:30 - 15:00","location":"Stage 5","name":"What is quantum computing?","speaker":"Alex Waldherr","info":"<p>This session gives a colorful introduction starting from what a qubit and quantum hardware are made of to a live demo on cloud services so you can bring experiments to life on a quantum device yourself!</p>\n<p>We will cover linear algebra and probability behind basic quantum circuits - I promise to make the theory fun - and look at how promising classes of quantum algorithms work.&nbsp;</p>\n<p>We finish with a game on engineering challenges and an open Q&amp;A on chemistry and quantum systems. Bring curiosity :)</p>"},{"id":142319,"day":"Wednesday","time":"14:40 - 15:25","location":"Stage 3","name":"Stop configuring infrastructure, start coding it!","speaker":"Robert Hoffmann","info":"<p>Do you want to become an infrastructure wizard overnight? Then this talk is for you. With most tools for Infrastructure as Code, we describe our infrastructure in a declarative configuration language. But there is another way: We can use a general-purpose programming language like TypeScript, Java or C#.</p>\n<p>This talk gives an overview of this alternative approach to IaC and answers some of the most burning questions: Can we finally get rid of tons and tons of YAML and JSON files? What are the pros and cons of coding instead of configuring? What tools can we use, what are their differences? And most importantly, do they help us to build infrastructure like a boss without 30 years of experience?</p>"},{"id":142322,"day":"Wednesday","time":"14:45 - 15:45","location":"Microstage 2","name":"The technical debt trap","speaker":"Sergio Herrero","info":"<p>The balance between building new features and future proofing your code. The false sense of security when a company hits a goldmine but builds bad tech.&nbsp;</p>\n<p>Not all technical debt should be fixed. Don&rsquo;t fix something that you will replace.</p>\n<p>Prioritise your tech debt. Generic first. Specific later. Your generic features are more used and tend to stick around for longer. Foster a culture of building right the first time. People should take pride in their work. No code monkeys.&nbsp;</p>\n<p>Train engineers to pitch tech debt as value for the users. Moving fast today could cause you to be slow tomorrow.&nbsp;</p>\n<p>Be aware of the consequences of bad code. If you are slow, maybe you should fix more tech debt, not less.</p>\n<p>Product points to slow down in feature output as evidence that we should work less on tech debt.&nbsp;</p>\n<p>Often it means the opposite, you have too much tech debt slowing you down so you have to get rid of it before you can be fast again.</p>"},{"id":142323,"day":"Wednesday","time":"14:45 - 15:45","location":"Microstage 1","name":"Java Sealed Classes vs. Kotlin Sealed Classes #Slideless","speaker":"Lothar Schulz","info":"<p>Sealed classes are one of the new Java 17 features. It has been on preview before, however with the latest Java 17 it is part of a LTS release for the first time. Kotlin also supports sealed classes and improved those in Kotlin 1.5 with additional details.</p>\n<p>In this live coding session, Lothar compares Java and Kotlin sealed classes. He uses Java and Kotlin code that smells. He improves the Kotlin and Java code with sealed classes (and interfaces) live on stage in an IDE and talks the audience through the code refactoring step by step. #slideless</p>"},{"id":142324,"day":"Wednesday","time":"14:45 - 15:45","location":"Microstage 3","name":"Remote monitoring of field level devices","speaker":"Sagar Veeranna Shiva, Arun Teja Sriramula, Aniket Yeole","info":"<p>As the race to digitalisation is gaining pace and the gap between IT and OT services is diminishing, the challenge of integrating these industrial communication protocols like PROFINET, EtherCAT, Modbus, OPC-UA etc., with the existing cloud service becomes critical.</p>\n<p>This talk+demo mainly focuses on demonstrating the best architectural designs that can be followed and giving a brief introduction to OPC-UA protocol, followed by a short demonstration on how data collected using OPC-UA from the field level devices can be monitored using AWS Greengrass Edge service.</p>"},{"id":142152,"day":"Wednesday","time":"15:00 - 15:30","location":"Panorama Stage","name":"What we Learned from Reading 100+ Kubernetes Post-Mortems","speaker":"Noaa Barki","info":"<p>A smart person learns from their own mistakes, but a truly wise person learns from the mistakes of others. When launching our product, we wanted to learn as much as possible about typical pains in our ecosystem, and did so by reviewing many post-mortems (100+!) to discover the recurring patterns, anti-patterns, and root causes of typical outages in Kubernetes-based systems.</p>\n<p>In this talk we have aggregated for you the insights we gathered, and in particular will review the most obvious DON'Ts and some less obvious ones, that may help you prevent your next production outage by learning from others' real world (horror) stories.</p>"},{"id":142295,"day":"Wednesday","time":"15:00 - 15:30","location":"Stage 2","name":"Create a Programmatic SEO Project Using Next.js and Static Site Generation","speaker":"Dino Lozina","info":"<p>Funnily enough, I will try to show you how a backend engineer can generate and deploy over 30,000 landing pages using Next.js. We will go through some of the features of Next.js that enabled me to succeed&mdash;such as getStaticPaths, getStaticProps, and the deployment process. This project was motivated by Zapier&rsquo;s SEO-driven user acquisition.</p>\n<p>My boss read an article on the subject and thought this would make a nice weekend project&mdash;We know what a weekend project is in manager terms, right? A couple of months later, here I am, ready to share my experience and the steps you could take to achieve the same. Ready for your next weekend project?</p>"},{"id":142325,"day":"Wednesday","time":"15:00 - 15:45","location":"Mainstage","name":"Intention, behavior and human-machine collaboration of slightly conscious AI in a human world","speaker":"Jonas Andrulis","info":"<p>Giant AI models have conquered the world of text, vision and multimodality with surprising fidelity. However, these models lack agency and values making them incredibly dependent on slight changes in the prompts with sometime unexpected outcomes. This has been addressed by fine-tuning with some success but fundamentally limit the usability to beyond simple problems. Will the next breakthrough come with even bigger sizes?</p>\n<p>Or are we missing an essential feature compared to human behavior? Together with some state-of-the-art examples of how to use the current generation we will look at an AI that acts deliberately &ndash; and is much more reliable that way.</p>"},{"id":142327,"day":"Wednesday","time":"15:00 - 15:30","location":"Stage 1","name":"Get the best of both worlds - Integrating Rust with other languages","speaker":"Fred Morcos, Harald Reingruber","info":"<p>There are several reasons why integrating Rust into other languages might be interesting. Rust is often used for computationally intensive applications, better control over memory management, or for accessing low-level hardware.</p>\n<p>Integrating Rust with other languages allows to get the best of both worlds, the power and safety of Rust as well as - for example - the advantages of managed languages like Java or C#. Another good reason is extending or migrating existing applications with/to Rust.&nbsp;</p>\n<p>This talk provides an overview of what is out there in the Rust ecosystem to bridge the worlds between Rust, Java, C#, and C++.</p>"},{"id":142329,"day":"Wednesday","time":"15:10 - 15:40","location":"Stage 5","name":"Launching a marketplace on-time: A lesson in taking shortcuts using spreadsheets!","speaker":"John Bettiol","info":"<p>This presentation is a story about how some times you need to throw ideology out of the window to get things done on time.</p>\n<p>Imagine the situation:&nbsp;</p>\n<ul>\n<li>You are building a new online marketplace for a huge European company that is the European leader for providing food &amp; materials to Hotels &amp; Restaurants.&nbsp;</li>\n<li>There's 3 months until go-live and the go-live date cannot be changed!&nbsp;</li>\n<li>You have a massive backlog of core features, you have no idea what your core demographic will be, you have no idea of the competency of your suppliers!&nbsp;</li>\n</ul>\n<p>What would you de-scope to get your platform live, on time without negatively impacting your customers?&nbsp;</p>\n<p>How would you make sure that the company can launch and yet still manage all of the processes required to keep a marketplace running.</p>"},{"id":142321,"day":"Wednesday","time":"15:15 - 15:45","location":"Outdoor Airstream","name":"I broke the production","speaker":"Arto Liukkonen","info":"<p>When was the last time you broke the production?&nbsp;</p>\n<p>Or if you haven't done that yet, the day will come. In this talk I'll go through the times when I broke the production, what I've learned from those incidents, who's fault is it, and especially the blame(less) culture in workplaces.&nbsp;</p>\n<p>I've worked as a full-stack developer for the past 15 years in multiple workplaces.&nbsp;</p>\n<p>Knowing how your employer reacts to these incidents can tell you a lot about that company as a workplace. Especially if a single developer can cause production issues, it's not the fault of that developer, but the company.</p>"},{"id":142120,"day":"Wednesday","time":"15:30 - 16:15","location":"Virtual Only Track","name":"Security for .NET developers and not only","speaker":"Alexej Sommer","info":"<p>Most popular attacks, standards, utilities and services. Let's talk briefly about all of them. I am going to talk about popular attacks like XXS, Path Traversal, Web Parameter Tampering, Zip Bombs and also about attacks that are less known. CSP, Cookies, SSL would be also covered.</p>\n<p>Finally I will show how to test applications with ZAP. Partly this presentation contains \"must know\" information, but I have some examples that could be interesting even for experienced developers. Check yourself to be sure that you haven't missed anything.</p>"},{"id":142331,"day":"Wednesday","time":"15:35 - 16:05","location":"Stage 1","name":"Swift Everywhere","speaker":"Firas Safa","info":"<p>Swift has come a long way, and in 2022 it can arguably be used to build anything not just iOS apps. Swift is on the server, can be used for scripting, and even building websites.</p>\n<p>The community is taking advantage of Swift robustness to buil numerous tools and frameworks to be used everywhere.&nbsp;</p>\n<p>A lot of these tools bring immense value and power to Swift developers, others not to the same extent. In this talk we will explore the tools and frameworks that enable it, and checkout their pros and cons.</p>"},{"id":142332,"day":"Wednesday","time":"15:35 - 16:05","location":"Stage 2","name":"Where we're going we don't need JavaScript - Programming with Type Annotations","speaker":"Peter Kröner","info":"<p>TypeScript's type annotations are more than just an addition to JavaScript - they are in fact a programming language in their own right! Types are essentially variables, generics work like function arguments and TypeScript's type annotations as a whole are a fully-features, functional DSL, embedded in JavaScript. And it's worth learning how to use this secret language!</p>\n<p>If we apply a programming mindset to types, we can unlock hidden superpowers that most TS users know very little about, but that have the potential to change how you think about types. This talk guides you through the implementation of a fairly basic message bus that we supercharge with type-level programming.&nbsp;</p>\n<p>Learn how mapped types, discriminated unions, conditional types and other advanced features to make the message bus type safe, simple to maintain and easy to use.&nbsp;</p>\n<p>By treating type annotations as a programming language, this talk opens up a new perspective on thinking in types for everyday TypeScript development.</p>"},{"id":142333,"day":"Wednesday","time":"15:35 - 16:05","location":"Stage 3","name":"Let developers develop again","speaker":"Kai Geißelhardt, Volker Zöpfel","info":"<p>The story on how we brought back speed and fun to our development in an enterprise environment. What we did and do to avoid the boring stuff and let our developers focus on realizing their ideas. And certainly how we used this to get the Lidl shop to the cloud.</p>"},{"id":142336,"day":"Wednesday","time":"15:45 - 16:15","location":"Stage 5","name":"Organizational Change Through The Power Of Why - DevSecOps Enablement","speaker":"Nazneen Rupawalla","info":"<p>&ldquo;Who owns your application&rdquo; is the question that has always kept me on my toes but I see security rarely being thought of as a enabler &amp; often an afterthought by delivery teams.</p>\n<p>As I picked up the role of a security consultant, the following pain points are what I strove to understand across the teams:&nbsp;</p>\n<p>Why does ownership and accountability of secure development falls onto security team&nbsp;</p>\n<p>Why are account leads not completely aware of the security requirements and integration of these practices in development work&nbsp;</p>\n<p>Why is security roadmap not being able to be integrated by leads&nbsp;</p>\n<p>A year later, we have engineers who have learned the value of &ldquo;why&rdquo; in security and SDLC, as opposed to checking a box and a maturity model that helped leadership take informed decisions.&nbsp;</p>\n<p>Via this talk, I would present the engagement model a product team can use to self-plan their security journey; a model that highlights the value of it which enhanced the engineering practice as a whole</p>"},{"id":142337,"day":"Wednesday","time":"15:45 - 16:30","location":"Panorama Stage","name":"Hacking Kubernetes: Live Demo Marathon","speaker":"Andrew Martin","info":"<p>In a live evocation of the recent O&rsquo;Reilly title Hacking Kubernetes (Martin, Hausenblas, 2021), this ultimate guide to threat-driven Kubernetes defence threat models and details how to attack and defend your precious clusters from nefarious adversaries.</p>\n<p>This broad and detailed appraisal of end-to-end cluster security teaches you how to attack and defend against a range of historical and current CVEs, misconfigurations, and advanced threats:&nbsp;</p>\n<ul>\n<li>See the historical relevance of CVEs and demonstrations of attacks against your containers, pods, supply chain, network, storage, policy, and wider organisation</li>\n<li>Understand when to use next-generation runtimes like gVisor, firecracker, and Kata Containers&nbsp;</li>\n<li>Delve into workload identity and advanced runtime hardening&nbsp;</li>\n<li>Consider the trust boundaries in soft- and hard-multitenant systems to appraise and limit the effects of compromise&nbsp;</li>\n<li>Learn to navigate the choppy waters of advanced Kubernetes security</li>\n</ul>"},{"id":142334,"day":"Wednesday","time":"15:45 - 16:45","location":"Stage 4","name":"Live DOOM II deathmatch with John Romero","speaker":"John Romero","info":""},{"id":142338,"day":"Wednesday","time":"16:00 - 16:30","location":"Microstage 1","name":"Shoot for the moon - machine learning for automated online ad detection","speaker":"Parinitha Hirehal, Humera Minhas","info":"<p>We at eyeo are dedicated to bringing sustainable balance to the internet. For this to work, content creators, publishers and advertisers must be able to fairly monetize but also must do so without compromising the user experience. We think the best way to reach this is with ad filtering.&nbsp;</p>\n<p>We looked into using advanced artificial intelligence such as machine learning to tackle 1 of the main issues for internet users today, how to handle intrusive &amp; inappropriate ads which can invade privacy &amp; the overall user experience.</p>\n<p>We set ourselves 1 huge, crazy goal - a moonshot - to create a minimum viable product (MVP) that automates ad detection. This would include components from data collection to model training &amp; testing; from research &amp; development to putting things in production including QA &amp; monitoring. In this talk, we will take you through our journey to the moon as we look to revolutionize the way ad detection works &amp; we&rsquo;ll go over our efforts, learnings, challenges and achievements</p>"},{"id":142339,"day":"Wednesday","time":"16:00 - 16:30","location":"Microstage 2","name":"The next frontier of data management in dev platforms","speaker":"Nikita Shamgunov","info":"<p>Serverless, CI/CD, and deploying applications closer to the user are becoming the foundation of building and deploying apps. Databases and analytical systems must follow to complete the developer experience as well as deliver the most usable and responsive app to the end-user.</p>\n<p>In this talk, Nikita Shamgunov will outline the architectural transformation of modern data management systems for the next 5-10 years.&nbsp;</p>\n<p>The audience will get a chance to get a sneak peek of the open-source serverless Postgres Nikita and a team of Postgres technologists have been working on in stealth mode for two years.</p>"},{"id":142124,"day":"Wednesday","time":"16:00 - 16:45","location":"Microstage 3","name":"a Data Mesh needs Open Metadata","speaker":"Ferd Scheepers","info":"<p>Data meshes are a hot topic. Many companies claim to deliver a data mesh, but in reality the technology is still nascent. ING is actively working together with partners to develop an open source data mesh, with a big focus on how we can manage the data across the entire landscape via the associated metadata.&nbsp;</p>\n<p>Not only is is necessary to have a mindset of thinking in decentralised data management, and in the concept of data products, but also to fit the data mesh into a very heterogeneous data landscape, where all vendors have their own data management tooling.</p>\n<p>The concept of an open metadata exchange format, delivered as an open source product called Egeria is needed to have a metadata highway (open metadata) next to the data highway (data mesh)</p>"},{"id":142150,"day":"Wednesday","time":"16:00 - 16:45","location":"Outdoor Airstream","name":"Fireside Chat: Building an audience on Social Media","speaker":"Marc Backes, Francesco Ciulla","info":""},{"id":142335,"day":"Wednesday","time":"16:00 - 16:45","location":"Mainstage","name":"A Million And One Random Digits","speaker":"Douglas Crockford","info":"<p>This talk looks at the history of random numbers and their counter-intuitive nature, with an emphasis on their use in computer languages. Examples of several algorithms will be presented. The presenter came to this subject long ago because of his involvement in the computer games industry. Games are humanity's first explicit and intentional interaction with randomness, using primitive random number generators such as knuckle bones. Random numbers start to become really interesting in 1947 at the somewhat secretive RAND Corporation.</p>"},{"id":142341,"day":"Wednesday","time":"16:10 - 16:55","location":"Stage 1","name":"Why GraphQL is Perfect for Microservices","speaker":"Roy Derks","info":"<p>GraphQL and microservices architectures are perfectly compatible. You can use GraphQL as a data layer for these microservices and combine data from all these services into one universal API.</p>\n<p>This way, you can break the core of your services into different microservices while still providing one endpoint that your clients can interact with.&nbsp;</p>\n<p>And the best part is that you can do this by writing GraphQL SDL only. Before diving into GraphQL, let's explore what microservices are and why it can be helpful to add GraphQL.</p>"},{"id":142342,"day":"Wednesday","time":"16:10 - 16:40","location":"Stage 3","name":"GitOps for the people","speaker":"Lian Li","info":"<p>MoneyBank Inc is a fintech enterprise that recently made the jump to K8s and GitOps to cope with the shift of demands from cranking out features towards stability and scalability.&nbsp;</p>\n<p>Yet, even with a fully automated CICD and shiny new microservices, features still take weeks to be released. As teams keep waiting on each other, frustrations, resentment and mistrust grow. MoneyBank&rsquo;s situation is typical for organisations with enterprise processes and startup mindsets.</p>\n<p>When faced with problems, the urge is often to move fast and automate them away. However, the cultural and regulatory structures to support these changes are not in the scope of said automation.&nbsp;</p>\n<p>One more piece is missing to address the needs of non-technical stakeholders within the ever changing CICD landscape. In this talk, we will attempt to automate the non-automatable with ReleaseOps: GitOps for the people.</p>"},{"id":142343,"day":"Wednesday","time":"16:10 - 16:40","location":"Stage 2","name":"Is your Progressive Web App Lazy? How to read and improve your PWA Performance","speaker":"Laura Morinigo","info":"<p>A progressive web app is a way to bring a native app experience into the browser, therefore the idea is to have a progressive enhancement of your app but during our development process, we have to keep in mind a few factors in order to make it.</p>\n<p>During this talk, we are going to discuss how to read and test our PWA performance, check some metrics that are useful to keep in mind like Cumulative Layout Shift and which are the tools that can help us to deliver web apps that are fast and progressive (for real!).</p>"},{"id":142381,"day":"Wednesday","time":"16:20 - 16:55","location":"Virtual Only Track","name":"How to Secure Your Software Supply Chain – Practical Lessons to Protect Your App","speaker":"Feross Aboukhadijeh","info":"<p>How do you know that you can trust your JavaScript dependencies? Software supply chain attacks have exploded over 2021 and they&rsquo;re only accelerating in 2022 and beyond. We&rsquo;ll dive into examples of recent supply chain attacks and what concrete steps we can take as an ecosystem to protect ourselves from this emerging threat.</p>"},{"id":142330,"day":"Wednesday","time":"16:20 - 16:50","location":"Stage 5","name":"How to Optimize Non-Coding Time","speaker":"Yishai Beeri","info":"<p>This talk is unique because 99% of developer productivity tools and hacks are about coding faster, better, smarter.&nbsp;</p>\n<p>And yet the vast majority of our time is spent doing all of this other stuff. I cover how to save time by reducing cognitive load and by cutting menial, non-coding tasks that we have to perform 10-50 times every day. E.g. Bug or hotfix comes through and you want to start working on it right away so you create a branch and start fixing.</p>\n<p>What you don&rsquo;t do is create a Jira ticket but then later your boss/PM/CSM yells at your due to lack of visibility. You have 20 minutes until your next meeting and you open a pull request and start a review. But you get pulled away half way through and when you come back the next day you forgot everything and have to start over. You build. You ship it. You own it. Great. But after I merge my code I never know where it actually is.&nbsp;</p>\n<p>Did the CI job fail? Is it release under feature flag? Did it just go GA to everyone?</p>"},{"id":146887,"day":"Wednesday","time":"17:00 - 17:45","location":"Mainstage","name":"Closing Keynote","speaker":"","info":""}]